{"id":8163,"date":"2019-02-13T20:49:34","date_gmt":"2019-02-13T15:19:34","guid":{"rendered":"https:\/\/clovedental.in\/?post_type=specialties&#038;p=8163"},"modified":"2021-10-14T17:30:54","modified_gmt":"2021-10-14T12:00:54","slug":"wisdom-teeth-removal","status":"publish","type":"specialties","link":"https:\/\/clovedental.in\/specialties\/wisdom-teeth-removal-extraction\/","title":{"rendered":"Wisdom Teeth Removal"},"content":{"rendered":"<div class=\"service-toppanel\">\n<div class=\"inner_servicebg\"><\/div>\n<div class=\"box\">\n<div class=\"service-contentbox\">\n<h2 class=\"hed-all\"><strong>WHAT ARE WISDOM TEETH?<\/strong><\/h2>\n<div class=\"content_fullcol\">\n<p><img class=\"img_placed\" src=\"https:\/\/clovedental.in\/wp-content\/uploads\/2019\/02\/wisdom-tooth.jpg\" alt=\"Wisdom Teeth Removal\" \/><\/p>\n<p>Wisdom teeth often known as third molars are the last teeth to erupt. One usually gets them in late teens or early twenties. However, even instances of eruption in late adulthood are common. If they erupt smoothly and without any interruption, then they can be proved as an asset. But the problem with third molars is that in case they do not erupt properly or are misaligned, they would need to be extracted. If they are poorly aligned, then they can damage the adjacent teeth.<\/p>\n<\/div>\n<\/div>\n<div class=\"inner-contentbox\">\n<h2><strong>What problems can a wisdom tooth cause?<\/strong><\/h2>\n<p>It is also possible that wisdom tooth is impacted. This means that the wisdom teeth remain intact in the soft tissue and partially break or erupt through gums.<br \/>\nIf they remain partially open, then the chances of bacteria entering the tooth are high which may cause infection &amp; lead to the swelling in the jaw, pain and general illness.<br \/>\nBecause of the misaligned positioning of the jaw, it will become difficult to brush or floss making the tooth prone to decay and gum disease.<br \/>\nThere is 4 set of wisdom teeth two on each upper and lower jaw.<br \/>\nNowadays majorly due to lifestyle changes people do not get wisdom teeth. This is because the jaws do not develop completely &amp; properly which restrain the wisdom teeth to erupt.<\/p>\n<h2><strong>Is there a need to remove Wisdom Teeth?<\/strong><\/h2>\n<p>It is not necessary to <a href=\"https:\/\/clovedental.in\/blog\/what-to-expect-when-getting-your-wisdom-tooth-removed\/\">remove wisdom teeth<\/a> as long as they are not causing any problem. They would have to be extracted if they are impacted or causing crowding. If you do not remove the wisdom tooth, it will be impacted. Your mouth might not provide space for it to erupt as a result it will erupt at the wrong angle which can damage the adjacent tooth.<\/p>\n<p>Your dentist may advise you to remove your third molar at an early stage, this is because as you age the bones in your mouth becomes harder which will then make it difficult to remove.<\/p>\n<p>Delaying can also lead to severe surgeries and heavy bleeding or can even cause a minor loss of movement in your jaw.<\/p>\n<h2><strong>Symptoms to get Wisdom Teeth Removed<\/strong><\/h2>\n<ul>\n<li>Pain behind molars which can increase with time.<\/li>\n<li>Redness, swelling, tenderness which can lead to infection<\/li>\n<li>Foul breath, bad taste can also be detected due to wisdom teeth<\/li>\n<li>Jaw pain and stiffness<\/li>\n<\/ul>\n<h2><strong>Should Wisdom Teeth be removed?<\/strong><\/h2>\n<p>Wisdom teeth may\/should be removed in case of any understated problems. Your dentist will be able to help and guide you with diagnosis:<\/p>\n<ul>\n<li>Crowding: The adjacent teeth are getting harmed. Because of the misalignment wisdom teeth if erupts in the wrong angle then it can harm other teeth.<\/li>\n<li>Jaw Damage: Wisdom teeth can damage your nerves making the jaw hollow.<\/li>\n<li>Sinus Issue: Wisdom teeth can be a reason for sinus pain and congestion.<\/li>\n<li><a href=\"https:\/\/clovedental.in\/specialties\/gum-diseases-treatment\/\">Gum Problem<\/a>: It will be difficult to clean the area which results in swelling of the tissue.<\/li>\n<li>Gaps in Gums: The pocket is created due to swollen gums thus helping in the process of decay<\/li>\n<\/ul>\n<h2><strong>Procedure for Wisdom Tooth Extraction<\/strong><\/h2>\n<p>The tooth removal process depends upon the stage in which the wisdom teeth is. It is easy to extract wisdom tooth if it has fully erupted. But if the tooth is impacted then it will require an incision in the gums. Usually, the tooth is extracted in parts to minimize the amount of bone required to be extracted for tooth removal.<\/p>\n<h3 style=\"font-size: 16px; margin: 0; font-weight: 600;\">Post Wisdom Tooth removal<\/h3>\n<ul>\n<li>Avoid vigorous rinsing and touching the area<\/li>\n<li>If you start feeling discomfort take the prescribed medicines<\/li>\n<li>A certain amount of bleeding is expected, however, if the bleeding exceeds then visit your dentist immediately<\/li>\n<li>Swelling around mouth and cheeks is common for a couple of days<\/li>\n<li>Be on a liquid diet for the first few days. Avoid the use of straw<\/li>\n<li>Do brush twice a day but make sure you are gentle on rinsing<\/li>\n<\/ul>\n<h2><strong>Price of Tooth Extraction<\/strong><\/h2>\n<p>The cost of a tooth extraction depends on the position of the tooth, the degree of its impaction, the requirement of anaesthesia, the requirement of sutures etc. Always talk to your dentist about these factors that may influence the cost of the procedure.<\/p>\n<h2><strong>FREQUENTLY ASKED QUESTIONS<\/strong><\/h2>\n<h3><strong>Q.1. <\/strong><strong><b>Do wisdom teeth need to be removed?<\/b><\/strong><\/h3>\n<p>It depends on how they have erupted and grown. In many instances, it is seen that the mouth does not have enough space, thus causing crowding <strong><b>impacted wisdom tooth<\/b><\/strong>. In such cases, the wisdom teeth need to be removed. If they have grown without any hassle, then there is no need.<\/p>\n<h3><strong>Q.2. <\/strong><strong><b>Do they put you on anaesthesia for the procedure?<\/b><\/strong><\/h3>\n<p>Dentists usually prefer to numb the area before <strong><b>wisdom tooth extraction<\/b><\/strong>, and thus recommend a local anaesthesia. If you need to get them removed, consult an expert dentist at your nearest Clove Dental clinic.<\/p>\n<h3><strong>Q.3. <\/strong><strong><b>How long does the pain last after the removal of wisdom teeth?<\/b><\/strong><\/h3>\n<p>The <strong><b>wisdom tooth pain<\/b><\/strong> may be there for at most a couple of days. In these days, you will need to take all the necessary precautions as directed by your dentist.<\/p>\n<h3><\/h3>\n<h3><\/h3>\n<\/div>\n<\/div>\n<\/div>\n<p><script type=\"application\/ld+json\">\n{\n  \"@context\": \"https:\/\/schema.org\",\n  \"@type\": \"FAQPage\",\n  \"mainEntity\": [{\n    \"@type\": \"Question\",\n    \"name\": \"Do Wisdom Teeth Need To Be Removed?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"It depends on how they have erupted and grown. In many instances, it is seen that the mouth does not have enough space, thus causing crowding impacted wisdom tooth. In such cases, the wisdom teeth need to be removed. If they have grown without any hassle, then there is no need.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"Do They Put You On Anaesthesia For The Procedure?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"Dentists usually prefer to numb the area before wisdom tooth extraction, and thus recommend a local anaesthesia. If you need to get them removed, consult an expert dentist at your nearest Clove Dental clinic.\"\n    }\n  },{\n    \"@type\": \"Question\",\n    \"name\": \"How Long Does The Pain Last After The Removal Of Wisdom Teeth?\",\n    \"acceptedAnswer\": {\n      \"@type\": \"Answer\",\n      \"text\": \"The wisdom tooth pain may be there for at most a couple of days. In these days, you will need to take all the necessary precautions as directed by your dentist.\"\n    }\n  }]\n}\n<\/script><\/p>\n","protected":false},"featured_media":8164,"template":"","acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/specialties\/8163"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/specialties"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/specialties"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/8164"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=8163"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}