{"id":10188,"date":"2019-08-05T19:05:30","date_gmt":"2019-08-05T13:35:30","guid":{"rendered":"https:\/\/clovedental.in\/?p=10188"},"modified":"2022-02-15T05:17:42","modified_gmt":"2022-02-14T23:47:42","slug":"human-milk-versus-formula-milk-better-child-dentition","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/human-milk-versus-formula-milk-better-child-dentition\/","title":{"rendered":"Human Milk versus Formula Milk &#8211; What is better or why for child dentition?"},"content":{"rendered":"<p>According to Centre of disease control and Prevention (CDC), “Breastfeeding is an investment in health, not just a lifestyle decision.”<br \/>\nIt is really important to understand the right comparison between human milk and formula milk.<\/p>\n<p><strong>Breast Milk versus Formula Milk: Effects on General Health of Babies<\/strong><\/p>\n<p>According to AAP, breast milk is right nutrition for child up to 6 months of age. Even after solid foods are introduced, breastfeeding should be continued till it is comfortable for the mother. Human milk has ideal composition that provides antibodies to protect infants from any illness. Colostrum protects the GI lining of babies. It reduces the risks of ear and respiratory infections. Moreover, breast feeding prevents risks of arterial diseases, since fats in breast milk can be easily emulsified.<br \/>\nFormula feed on the other hand, is a blend of skimmed cow’s milk with several preservatives, emulsifiers, enzymes and amino acids. These are not natural source of nutrition for infants and cannot be easily digested because of nature of the fat present in them. As compared to breast milk, it does not provide natural defence mechanism to infant against any infection.<br \/>\nSeveral psychologists have proved that breastfeeding has psychological benefits for both infants and mother, and enhances the bond between the two.<\/p>\n<p><strong>Breast Milk versus Formula Milk: Effects on Oral Health of Babies<\/strong><br \/>\nBesides proven benefits on systemic health of infants, breastfeeding has been advantageous in maintaining good oral health. Feeding human milk affects two most important aspects of oral health, <a href=\"https:\/\/clovedental.in\/specialties\/braces-aligners\">teeth alignment<\/a> and dental caries.<\/p>\n<h3>Teeth Alignment<\/h3>\n<p>Breastfeeding has direct effect on facial muscles and jaw movements. Suckling at breast is advised since it stimulates facial muscles and help in the growth of teeth and jaw. During breast suckling, tongue is placed at lower position on lower jaw, and milk is squeezed through constant suctioning movements of lips, jaw and tongue. However, bottle fed infants have passive movements, where in tongue creates a negative pressure against nipple of the bottle to squeeze out milk. The flow of milk is continuous because of which, oral muscles do not work, resulting in lack of development of oral structures, jaw and teeth. Bottle feeding can also result in problems of crowding between teeth, incorrect teeth alignment and interference in palatal growth.<\/p>\n<h3>Dental Decay<\/h3>\n<p>The composition of human milk consists of lactose. This lactose does not provide favouring medium for the oral bacteria (S. mutans) to harbour and cause demineralisation of teeth. Streptococcus mutans is unable to metabolise lactose sugar completely, therefore cannot cause dental caries. Moreover, antibodies (IgA, IgG) and proteins present in human milk inhibit bacterial growth.<br \/>\nFormula milk on the other hand, consists of sucrose, which when contacts with teeth, make them more susceptible to bacterial demineralisation. Also, during the process of bottle sucking, the nipple of the bottle rests on the palate, thus blocking the salivary flow in upper incisor area, making them more susceptible to dental caries. However, care of baby teeth is still recommended and cleaning with wet gauze should be done after feeding human milk.<br \/>\nLastly, it has been well proven that breastfeeding has a positive impact on both child and mother. Breastfed infants are much healthier and happy kids.<br \/>\nFor better understanding take a dentist appointment and visit a <a href=\"https:\/\/clovedental.in\/specialties\/kids-dentistry\/\">kids dentist<\/a>.<\/p>\n<p align=\"justify\">By:-<\/p>\n<p><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\"><b>Dr. Alpa Vasishat Sharma<\/b><\/span><\/span><\/span><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\">;<\/span><\/span><\/span><\/p>\n<p><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\">Paedodontist<\/span><\/span><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to Centre of disease control and Prevention (CDC), “Breastfeeding is an investment in health, not just a lifestyle decision.” It is really important to understand the right comparison between human milk and formula milk. Breast Milk versus Formula Milk: Effects on General Health of Babies According to AAP, breast milk is right nutrition for &hellip; <a href=\"https:\/\/clovedental.in\/blog\/human-milk-versus-formula-milk-better-child-dentition\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Human Milk versus Formula Milk &#8211; What is better or why for child dentition?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10189,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10188"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10188"}],"version-history":[{"count":8,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10188\/revisions"}],"predecessor-version":[{"id":14811,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10188\/revisions\/14811"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10189"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10188"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10188"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10188"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}