{"id":10186,"date":"2019-08-05T19:14:29","date_gmt":"2019-08-05T13:44:29","guid":{"rendered":"https:\/\/clovedental.in\/?p=10186"},"modified":"2022-02-15T05:45:04","modified_gmt":"2022-02-15T00:15:04","slug":"busting-myths-infant-oral-health","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/busting-myths-about-infant-oral-health\/","title":{"rendered":"Busting Myths about Infant Oral Health"},"content":{"rendered":"<p>Right knowledge about infant oral health can provide basis upon which preventive measures and basic education can be imparted to prevent dental diseases. Parents are the primary care givers to their children and can play an important role in prevention of dental decay. However, since ages, there are several myths related to oral health of the little ones. As young parents, several questions bother our mindsets like what is the right age to start brushing, at what age should the children be taken to the dentist and what is the right toothpaste for my little one.<br \/>\nIn course of searching answers for all these questions, we end up believing in several myths that are being presumed and followed since ages.<\/p>\n<p>Let’s counter some of these myths with facts on infant oral care.<\/p>\n<h3>Myth: There is no need to start brushing at early ages.<\/h3>\n<p><strong>Fact:<\/strong> According to American Academy of Paediatric Dentistry (AAPD) guidelines, children should start brushing as soon as the first tooth erupts in the mouth.<br \/>\nHowever, cleaning of gum pads should start as early as within first week of birth. This can be done with clean, sterile gauze piece dipped in boiled water. Presently infant tooth brushes and wipes are also available that can be used for the same.<br \/>\nCleaning should be done twice a day, especially after the last feed at night.<\/p>\n<h3>Myth: First dental check-up should be scheduled at the age of three.<\/h3>\n<p><strong>Fact:<\/strong> The latest recommendations of AAPD, American Dental association (AAD) and US Federal Agencies recommend that the first dental visit must be scheduled before the first birthday of the child. Early visits to dental clinic for routine check-ups can lay a foundation of non-threatening overview to dentistry. These visits have also proven to be helpful in parental counselling and education on importance of baby teeth. Dentist at the same time perform the risk assessment, gives dietary counselling and teaches right oral hygiene technique to the parents.<\/p>\n<h3>Myth: Brushing teeth once a day is sufficient to keep child cavity free.<\/h3>\n<p><strong>Fact:<\/strong> Brushing should be done twice daily during morning and evening hours. Thorough plaque removal is not possible with one time brushing and therefore it is recommended to brush twice. The correct <a href=\"https:\/\/clovedental.in\/blog\/hesitant-brushers-guide-getting-munchkins-brush\/\">brushing technique for toddlers and children<\/a> involves the use of soft brush in horizontal strokes that should cover all surfaces of the teeth (Fones technique). Along with regular brushing, rinsing is also recommended between meals which removes food deposits on the teeth. Lastly, fluoridated pastes should be introduced at the age of 3 years when a child can start to spit.<\/p>\n<h3>Myth: Does teething really occur and can it make child sick?<\/h3>\n<p><strong>Fact:<\/strong> Teething is a process wherein gm-pads prepare themselves for tooth eruption. It can start at early ages of 3 months and can last up to 2 years of age. Teething can make child irritable and he\/she tends to put fingers in the mouth constantly. Drooling of saliva and loss of appetite are a few symptoms of teething. On few occasions, child can become sick like loose tummy and there can be slight rise in fever. However, if fever persists for more days, then a paediatric consultation is important. To relieve teething symptoms, bisphenol A (BPA) free cold teethers can be introduced, and carrots and cucumbers can be given to bite which can turn out to be soothing to gums.<\/p>\n<p>It is important to organise dental visits after every six months to effectively establish concept of ‘dental home’, wherein dentist and parents together work in achieving good oral health goals for children. Visit your nearest dental clinic and get your kid examined only by <a href=\"https:\/\/clovedental.in\/specialties\/kids-dentistry\/\">children dentist<\/a>, as they specialize in this field of dentistry and have a way in dealing with kids.<\/p>\n<p align=\"justify\">By:-<\/p>\n<p><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\"><b>Dr. Alpa Vasishat Sharma<\/b><\/span><\/span><\/span><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\">;<\/span><\/span><\/span><\/p>\n<p><span style=\"color: #222222\"><span style=\"font-family: Calibri, sans-serif\"><span style=\"font-size: medium\">Paedodontist<\/span><\/span><\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Right knowledge about infant oral health can provide basis upon which preventive measures and basic education can be imparted to prevent dental diseases. Parents are the primary care givers to their children and can play an important role in prevention of dental decay. However, since ages, there are several myths related to oral health of &hellip; <a href=\"https:\/\/clovedental.in\/blog\/busting-myths-about-infant-oral-health\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Busting Myths about Infant Oral Health<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10193,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10186"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10186"}],"version-history":[{"count":9,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10186\/revisions"}],"predecessor-version":[{"id":14831,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10186\/revisions\/14831"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10193"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10186"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10186"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10186"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}