{"id":10583,"date":"2019-12-10T18:37:16","date_gmt":"2019-12-10T13:07:16","guid":{"rendered":"https:\/\/clovedental.in\/?p=10583"},"modified":"2021-10-05T15:52:09","modified_gmt":"2021-10-05T10:22:09","slug":"balanced-diet-childhood-insurance-lifetime","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/balanced-diet-childhood-insurance-lifetime\/","title":{"rendered":"A balanced diet in childhood is insurance of lifetime"},"content":{"rendered":"<p>According to 2018 Factsheet on Diet and Oral health by the World Health Organisation, an unhealthy diet and poor nutrition affect the teeth and growth of the jaws during development and later during the life-course. The diet provided to children during their initial years of life, help in their physical and cognitive development. Consequently, it also impacts their oral and overall health. Experts say that imbalanced diet containing too many carbohydrates, sugar and starch leads to oral ailments like cavities and tooth decay, further affecting the overall health of children.<\/p>\n<p>&#8220;Diet and nutrition have the most significant effect in the mouth. Eating foods that are high in sugars can lead to the production of acids that attack the tooth enamel and eventually cause decay. Dental ailments not only affect the Oral Cavity but have a massive impact on the overall development of children,&#8221; says Dr. Priyanka Mathur, General Manager – Clinic Operations, Clove Dental.<\/p>\n<p>The associations between Oral Health conditions, dietary practices and nutritional status, and the general health are complex and have many interrelating factors. Compromised Oral Health can alter food choices and negatively impact food intake leading to a suboptimal nutritional status which may lead to chronic systemic diseases. Recognizing and treating Oral Health and thereby the nutrition problems is important in improving the health and quality of life, states the National Centre for Biotechnology Information, USA.<\/p>\n<p>&#8220;Oral Health is a window to overall health and well-being. It not only affects a child&#8217;s development but also affects their self-esteem. They are more likely to feel inferior, embarrassed, and unhappy with poor set of teeth. A well balanced and nutritious diet is the <a href=\"https:\/\/clovedental.in\/blog\/oral-health-do-we-really-care\/\">best way to ensure great oral health<\/a> and prevent future discomforts&#8221; says Dr Lt. Gen. Dr. Vimal Arora, Chief Clinical Officer of Clove Dental.<\/p>\n<p>&#8220;Healthy nutrition for healthy teeth is very important at the early stage of life. Parents should necessarily pay attention to their child’s eating habits and inculcate healthy food choices. Food rich in calcium such as low-fat milk, yoghurt and cheese, almonds, dark green leafy vegetables and others that help in promoting strong teeth and bones should be promoted in a child’s diet. Eggs, fish, lean meat and dairy products are filled with phosphorus which is known to be beneficial for strong teeth. Parents should also include Vitamin C-rich food that in the balanced diet as it promotes gum health,&#8221; she added.<\/p>\n<p>Fluoride in right amount help in cavity prevention against the tooth decay, however, if fluoride content is increased, it leads to brown patches which is very embarrassing.<\/p>\n<p>Similarly, deficiency of other vitamins and minerals can affect the development of teeth and bone causing deformation.<\/p>\n<p>Soft sticky food is the sure short precursor to gum disease which manifests itself in the form of bleeding gums. Irregular teeth which have a high incidence are a result of poor diet during childhood where proper masticatory stimulus is missing thereby causing small jaw and mandibular which causes irregular teeth. Converting food habits towards the food which requires robust chewing will not only prevent irregular teeth but also develop healthy gums, bone &amp; jaw.<\/p>\n<p>It is true that the food we eat gives nutrients to the body, bones, teeth and gums and helps in renewing the tissues along with fighting infection and diseases. Doctors believe that childhood is the best stage to develop mind and body in the right direction by adopting good eating habits. The role of parents is crucial in this process of fostering a healthy diet and lifestyle from an early age. This will help children build healthy eating habits which shall, in turn, lead to good oral health.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>According to 2018 Factsheet on Diet and Oral health by the World Health Organisation, an unhealthy diet and poor nutrition affect the teeth and growth of the jaws during development and later during the life-course. The diet provided to children during their initial years of life, help in their physical and cognitive development. Consequently, it &hellip; <a href=\"https:\/\/clovedental.in\/blog\/balanced-diet-childhood-insurance-lifetime\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">A balanced diet in childhood is insurance of lifetime<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10585,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10583"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10583"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10583\/revisions"}],"predecessor-version":[{"id":13582,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10583\/revisions\/13582"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10585"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10583"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10583"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10583"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}