{"id":10589,"date":"2019-12-10T19:00:32","date_gmt":"2019-12-10T13:30:32","guid":{"rendered":"https:\/\/clovedental.in\/?p=10589"},"modified":"2021-02-24T11:33:43","modified_gmt":"2021-02-24T06:03:43","slug":"chocolates-can-make-kid-smile-can-leave-tooth-fragile","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/chocolates-can-make-kid-smile-can-leave-tooth-fragile\/","title":{"rendered":"Chocolates can make your kid smile but can leave the tooth fragile!"},"content":{"rendered":"<p>Is your child’s sweet tooth making you anxious? Experts estimate that every second child in India has cavities, which if not prevented, can lead to severe dental ailments and can even affect the overall development of the child. According to US National Institute of Dental and Craniofacial Research, 42% of children aged 2 to 11 develop a cavity in their primary teeth and nearly 28% of children aged 2 to 5 develop at least one cavity.<\/p>\n<p>Cavities refer to tooth decay which happens when tooth enamel (outer layer of teeth) is destroyed. This happens when bacteria in the form of plaque reacts with sugary foods to form acids that attack the enamel and erode it. Dental plaque is the sticky, slimy substance made up mostly of the germs that cause tooth decay, it sticks to teeth and can eat away the enamel.<\/p>\n<p>&#8220;Cavities are more common among children. Due to poor eating and oral habits, dental plaque is developed frequently in kids&#8217; teeth. If your child faces toothache and holes\/pits are visible then it is surely a symptom of the cavity. Ignoring the same can further lead to tooth loss and decaying of inside parts of teeth,&#8221; says Lt Gen Dr Vimal Arora, CCO, Clove Dental.<\/p>\n<p>In fact, a recent study by University of Melbourne and the Murdoch Children’s Research Institute at Royal Children’s Hospital in Melbourne, Australia has found that environmental factors are also responsible for triggering risk for cavities. All this, says Dr Arora, requires that parents be aware of the various dimensions of the problems, as well as the fact that this is common yet preventable disease. Cavities in baby and permanent teeth can cause pain and prevent children from eating, speaking, sleeping, and learning properly. It is important to protect both primary (baby) teeth and permanent teeth.<\/p>\n<p>Primary teeth can get cavities and permanent ones can develop dental infections. Tooth decay, especially of baby teeth is a serious, infectious and transmissible disease that can spread quickly and lead to infection without proper precautions. But the good news is that it is preventable and treatable.<\/p>\n<p>&#8220;Cavities in children can be treated by different methods like dental sealant and fluoride varnishing apart from a dental filling. Dental sealant protects teeth especially when children are most susceptible to having decay. It is less expensive than filling. Whereas, fluoride varnish is a thick liquid painted on the teeth with a small disposable brush. It strengthens tooth enamel and can help prevent dental decay,&#8221; says Dr Jayna Gandhi, Deputy Zonal Clinical Head at Clove Dental.<\/p>\n<p>Dental plaque and cavity is not a matter to ignore especially in children as it increases with time and can make their oral health poorer. Along with<a href=\"https:\/\/clovedental.in\/blog\/beware-of-your-childs-dental-habits\/\"> teaching your child good oral habits<\/a> like brushing teeth regularly, preventing them from eating loads of sweets and feeding them nutritious and balanced meals, it is vital to visit the dentist and get their cavity checked.<br \/>\n<!--\n\n\n<\/p><p align=\"justify\">For more information contact GreyMatters Communication<\/p>\n\n\n<span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\"><b>Karuna Dhoundiyal,Karuna@thegreymatters.in, +91 8512844993<\/b><\/span><\/span><\/span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\">;<\/span><\/span><\/span>\n\n<span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\">Maryam Raja, Maryam@thegreymatters.in, +91 9958104454<\/span><\/span><\/span>-->\n","protected":false},"excerpt":{"rendered":"<p>Is your child’s sweet tooth making you anxious? Experts estimate that every second child in India has cavities, which if not prevented, can lead to severe dental ailments and can even affect the overall development of the child. According to US National Institute of Dental and Craniofacial Research, 42% of children aged 2 to 11 &hellip; <a href=\"https:\/\/clovedental.in\/blog\/chocolates-can-make-kid-smile-can-leave-tooth-fragile\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Chocolates can make your kid smile but can leave the tooth fragile!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10590,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10589"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10589"}],"version-history":[{"count":4,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10589\/revisions"}],"predecessor-version":[{"id":13574,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10589\/revisions\/13574"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10590"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10589"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10589"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10589"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}