{"id":10587,"date":"2019-12-10T18:48:11","date_gmt":"2019-12-10T13:18:11","guid":{"rendered":"https:\/\/clovedental.in\/?p=10587"},"modified":"2021-10-05T15:48:52","modified_gmt":"2021-10-05T10:18:52","slug":"ignorance-oral-healtha-silent-cause-heart-ailments-doctors","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/ignorance-oral-healtha-silent-cause-heart-ailments-doctors\/","title":{"rendered":"Ignorance of oral health,a silent cause of heart ailments: Doctors"},"content":{"rendered":"<p>The burden of cardiovascular diseases is increasing in India, and systematic understanding of its causes is a huge topic for the ongoing research. It is well-known that high blood pressure, tobacco consumption and diabetes are the usual triggers for heart trouble. But there is a silent killer that is hardly known to anyone which later on may affect the health of your heart and remains largely ignored and that is the ‘Oral Health’. Ignoring Oral Health can put your heart at severe risk.<\/p>\n<p>Various reports and researches have proved that prevalence of heart disease and stroke has gone up in past 25 years. The news studies published in The Lancet and its associated journals in 2018 reveal that heart disease is the leading individual cause of disease burden in India, whereas the stroke is the fifth leading cause.<\/p>\n<p>With an alarming rise of over 34%, death rate due to cardiovascular diseases has become the latest health concern in India.<\/p>\n<p>According to the study ‘The Changing Patterns of Cardiovascular Diseases and Their Risk Factors in the States of India: The Global burden of Disease Study 1990-2016’, the number of deaths due to cardiovascular diseases in India has gone up to 2.8 million in 2016. It has shown a rise from 1.3 million in 1990, and more than half the deaths caused by heart ailments in 2016 were reported in persons less than 70 years of age.<\/p>\n<p>&#8220;Our oral cavity harbors millions of bacteria and there is a greater chance that one of these microorganisms enters into heart via the bloodstream and cause infection in the heart valves or heart tissues. This inflammation, known as endocarditis or infective endocarditis (IE), generally occurs when bacteria, fungi or other germs from another part of the body infects heart via bloodstream,&#8221; says Dr. ShalleyBatta Rishi, Clove Dental.<\/p>\n<p>The infection in heart tissues is capable of destroying all the four heart valves through which the blood is guided in to the right direction to reach every part of the body. The source of this scary infection lies in the improper care of your mouth. Here lies the indispensable need for proper dental care, from brushing and flossing twice to visiting the dentist once in six months.<\/p>\n<p>Sometimes, even after taking good care of your oral hygiene, thecardiovascular system can be infected with this bacterium. &#8220;Infectious bacteria can enter the bloodstream while undergoing dental procedures like extraction, <a href=\"https:\/\/clovedental.in\/specialties\/root-canal-treatment\/\">root canal treatment (RCT)<\/a> or flap surgeries that are often accompanied by some bleeding. While a bacterial infection of this nature can happen to anyone, people with an underlying heart condition are at a greater risk,&#8221; says Lt. Gen Dr. Vimal Arora, Chief Clinical Officer of Clove Dental.<\/p>\n<p>For people with heart conditions, the American Heart Association (AHA) has issued guidelines to follow before they undergo dental procedures that involve any manipulation of gum tissues, digging inside the tooth or perforating oral tissues. The guidelines include an antibiotic regimen and direct all that if you have a heart condition, please alert your dentist to it.<\/p>\n<p>&#8220;Apart from the guidelines, the role of the dentist and the dental clinic becomes very crucial in preventing such conditions as here comes the need to pay high attention to hygiene and quality maintained at the clinic, from the sterilized instruments to dental chairs that prevent cross-contamination to ensure patient’s wellbeing,&#8221; added the doctor.<\/p>\n<p>The connection between ill-oral hygiene and inflammation in the heart has opened doors to prevent chronic diseases by paying good attention to your mouth. With the advances in dental health and awareness about its causes, the global burden of heart diseases can be addressed.<\/p>\n<p>Shape up your Oral Health for a Healthy Heart!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The burden of cardiovascular diseases is increasing in India, and systematic understanding of its causes is a huge topic for the ongoing research. It is well-known that high blood pressure, tobacco consumption and diabetes are the usual triggers for heart trouble. But there is a silent killer that is hardly known to anyone which later &hellip; <a href=\"https:\/\/clovedental.in\/blog\/ignorance-oral-healtha-silent-cause-heart-ailments-doctors\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Ignorance of oral health,a silent cause of heart ailments: Doctors<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10588,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10587"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10587"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10587\/revisions"}],"predecessor-version":[{"id":13578,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10587\/revisions\/13578"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10588"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10587"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10587"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10587"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}