{"id":10655,"date":"2019-12-24T20:29:26","date_gmt":"2019-12-24T14:59:26","guid":{"rendered":"https:\/\/clovedental.in\/?p=10655"},"modified":"2022-02-15T05:47:10","modified_gmt":"2022-02-15T00:17:10","slug":"breast-feeding-affects-childs-oral-health","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/breast-feeding-affects-childs-oral-health\/","title":{"rendered":"How breast feeding affects your child&#8217;s oral health"},"content":{"rendered":"<p>Human milk is thefirst food of a newborn that provides all the nutrients and energy needed for the proper growth and health. Breast milk that is also called ‘liquid gold’ is like armor for the child from several health threats in present and future.<\/p>\n<p>Breast milk has many benefits and according to the World Health Organisation (WHO), &#8220;Breastmilk reduces child mortality rate and has lasting effects leading to several health benefits, even in adulthood.&#8221;  Apart from many proven health benefits like protection from allergies, chronic diseases and promoting cognitive and sensory development, breastfeeding has been also found helpful in maintaining good oral health in infants.<\/p>\n<p>Several recent studies, one in Pediatrics in 2015 and one in the August 2017 issue of the Journal of the American Dental Association, found that babies who were exclusively breastfed for the first 6 months were less likely to have teeth alignment issues such as open bites, crossbites, and overbites, than those exclusively breastfed for shorter lengths of time or not at all.<\/p>\n<p>It is evident that the well-balanced composition of human milk provides all necessary nutrients required for the proper development of a child but it also helps in developing facial bones and later growth of teeth.<\/p>\n<p>At the same time, breastfeeding also has a direct effect on facial muscles and jawbone. Feeding on a bottle requires less effort in suckling milk and non-stop flow of milk from bottle leads to weak movements of facial muscles, lips and tongue contributing least to the development of jawbones and teeth alignment. Bottle feed may lead to dental issues like crowding between teeth, improper teeth alignment and even issues in palatal growth. But in breastfeeding, continuous effort to suck milk stimulates the movement of facial muscles and helps in growth and correct alignment of teeth.<\/p>\n<p>Breastmilk is found to have reduced risk of another major dental concern of dental decay in babies. “Another benefit of exclusive breastfeeding is a reduced risk of baby bottle tooth decay, the frequent, prolonged exposure of the baby’s teeth to drinks that contain sugar. This type of tooth decay often occurs when a baby is put to bed with a bottle – even ones containing formula, milk or fruit juice.” American Dental Association.<\/p>\n<p>&#8220;The lactose in human milk does not support oral bacteria growth. Besides, antibodies (IgA, IgG) present in breastmilk also prevent any bacterial growth or other infections. It is already a proven fact that antibodies present in breastmilk prevent gastrointestinal and respiratory infections,&#8221; says Dr AlpaVasishat Sharma, Preventive Dentistry, Clove Dental.<\/p>\n<p>&#8220;However, formula milk contains sucrose which, when comes in contact with teeth, makes them more susceptible to bacterial infection and demineralization. In bottle feeding, the flow of saliva is blocked in the upper incisor area, increasing the risk of dental caries,&#8221; she added.<\/p>\n<p>This year, the slogan of World Breastfeeding Week is &#8216;Empower parents, Enable breastfeeding&#8217;. It is always advised to breastfeed more overfeeding through a bottle. Empowering parents to enable breastfeeding is the motto of WHO.<\/p>\n<p>Formula milk that uses skimmed cow milk or soya milk as base and includes other components like iron, composition of fatty acid and probiotics to make it attain the approximate nutritional value as of human milk, if compared to human milk, scores much more in nutritional value and thus make it hard for the infant to digest. On the other hand, a balanced composition of casein and whey protein makes human milk easier to digest reducing the risk of diarrhoea, stomach infection and inflammation of the stomach.<\/p>\n<p>&#8220;For mothers, it is also advised to take good care of oral and overall health. Changes in hormones during pregnancy and then postpartum may affect the oral health of mothers. Thus, it is always advised to get a dental check-up after postpartum to check issues like inflammation of gums, bleeding or bad breath,&#8221; Lt Gen Dr Vimal Arora, CCO, Clove Dental.<\/p>\n<p>Going for dental treatment while breastfeeding is ok as ignoring a dental health issue may aggravate the problem!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Human milk is thefirst food of a newborn that provides all the nutrients and energy needed for the proper growth and health. Breast milk that is also called ‘liquid gold’ is like armor for the child from several health threats in present and future. Breast milk has many benefits and according to the World Health &hellip; <a href=\"https:\/\/clovedental.in\/blog\/breast-feeding-affects-childs-oral-health\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">How breast feeding affects your child&#8217;s oral health<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10656,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10655"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10655"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10655\/revisions"}],"predecessor-version":[{"id":10657,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10655\/revisions\/10657"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10656"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}