{"id":10662,"date":"2019-12-24T20:50:50","date_gmt":"2019-12-24T15:20:50","guid":{"rendered":"https:\/\/clovedental.in\/?p=10662"},"modified":"2019-12-24T20:52:06","modified_gmt":"2019-12-24T15:22:06","slug":"need-invasive-dental-care-prevent-dementia-like-alzheimers-lt-gen-dr-arora","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/need-invasive-dental-care-prevent-dementia-like-alzheimers-lt-gen-dr-arora\/","title":{"rendered":"Need for invasive dental care to prevent Dementia like Alzheimer&#8217;s – Lt Gen Dr Arora"},"content":{"rendered":"<p>Few years back, it would have been unimaginable to believe that poor oral health can cause anything else except foul smell. However, therelation between gum disease and dementia as reported in the scientific literature has reiterated the need for invasive dental care to prevent diseases like Alzheimer and others. Dental plaque and gum inflammation generally caused by poor andirregular oral hygiene habits, can only be addressed easily and managed well to keep under control to safeguard against such diseases.<\/p>\n<p>Dementia has witnessed a steep rise in occurrence in recent past, becoming the fifth biggest cause of death worldwide. &#8220;Alzheimer disease is the most common form and may contribute to 60–70% of cases,&#8221; reveals the World Health Organisation’s factsheet on Dementia.<\/p>\n<p>Alzheimer&#8217;s, an invariable, progressive brain disorder that slowly deteriorates cognitive function affecting memory and thinking skills, is devastating for both, the patient as well as the family. The lack of understanding of the disorder and awareness about it leads to late diagnosis and often further worsening the condition. While there is no treatment to cure or reverse the progressive deterioration of cognitive functions, timely diagnosis helps in the best possible management of the syndrome. Symptoms of Alzheimer’s like memory loss, difficulty in planning and executing tasks, determining time or space, vision loss and others start appearing in early stages of the disorder. It is commonly prevalent in people of mid-60s age group.<\/p>\n<p>The debate over the cause of this life-taking disease has always been active. The leading hypothesis since 1984 has been indicating that the condition is caused by the defective control of proteins like Amyloid and Tau, which form sticky plaques in the brain disrupting the function of neurons. However, some have raised questions on the hypothesis. In a review of the researches, Bryce Vissel at the University of Technology Sydney, Australia, concluded that there isn’t sufficient data to suggest that &#8220;amyloid has a central or unique role in Alzheimer&#8217;s.&#8221;<\/p>\n<p>Amidst all this turmoil, the connection between gum inflammation and memory loss has come up as a new ray of hope in detecting the cause of Alzheimer’s. Researchers have learned that gum disease (gingivitis) plays a crucial role in probability of the occurrence of Alzheimer´s in a person.A new US study published in Science Advances tells how Porphyromonas gingivalis or P. gingivalis, a bacterium linked with gum disease has been found to be present in the brais of patients suffering with Alzheimer&#8217;s.<\/p>\n<p>&#8220;Researchers from Cortexyme and several universities have reported finding two toxic enzymes that P. gingivalis feedson in human tissue of 99 and 96% of 54 human brain samples of those having Alzheimer&#8217;s. The samples were taken from the hippocampus – a brain area important for memory. These protein-degrading enzymes, called gingipains, were found in higher levels in brain tissue that also had more tau fragments and thus more cognitive decline,&#8221; says NewScientist.com.<\/p>\n<p>P. gingivalis has also been recognised to be the main causative factor in periodontal cases. It is found to be present in pockets infected by dental plaque. Dental plaque is a group of bacteria that grows on dental surface as a consequence of bad oral hygiene and irregular brushing.<\/p>\n<p>Dental plaque and gum diseases eventually result in tooth loss and at the same time studies have shown that people with fewer teeth are more prone to dementia. The inflammation and toxins caused by P. gingivalis damage the lining of the mouth, allowing oral bacteria to enter the bloodstream and then other organs.<\/p>\n<p>Lack of awareness about the importance of oral and dental health generally makes people neglect minor dental health issues which, if not taken care of, gradually grow up into serious health issues affecting other organs too. Oral health, an inevitable part of a healthy life, should be kept on the priority list. Taking good care of mouth, teeth and gums is most important for an healthy intake hence ensuring good health of the entire body.<\/p>\n<p>Whether the scientific evidence is strong enough or not to support the hypothesis that there is increased incidence of Alzheimer’s disease in people with sub optional gum health is a question which time will prove; however, keeping your gums in an excellent health is relatively easier and least expensive &amp; can be managed well by few visits to the dental surgeon and thus help in keeping you fine, fit &amp; healthy.<\/p>\n<p><strong>The writer is Chief Clinical Officer at Clove Dental<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Few years back, it would have been unimaginable to believe that poor oral health can cause anything else except foul smell. However, therelation between gum disease and dementia as reported in the scientific literature has reiterated the need for invasive dental care to prevent diseases like Alzheimer and others. Dental plaque and gum inflammation generally &hellip; <a href=\"https:\/\/clovedental.in\/blog\/need-invasive-dental-care-prevent-dementia-like-alzheimers-lt-gen-dr-arora\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Need for invasive dental care to prevent Dementia like Alzheimer&#8217;s – Lt Gen Dr Arora<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10663,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10662"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10662"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10662\/revisions"}],"predecessor-version":[{"id":10664,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/10662\/revisions\/10664"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10663"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10662"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=10662"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=10662"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}