{"id":11951,"date":"2020-04-06T12:58:26","date_gmt":"2020-04-06T07:28:26","guid":{"rendered":"https:\/\/clovedental.in\/?p=11951"},"modified":"2022-02-15T05:48:30","modified_gmt":"2022-02-15T00:18:30","slug":"boost-immunity-fight-covid-19","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/boost-immunity-fight-covid-19\/","title":{"rendered":"BOOST YOUR IMMUNITY-FIGHT AGAINST COVID-19"},"content":{"rendered":"<p>When we all think about this present situation where COVID-19 threatening the whole world with its aggressive attack leading to the death of thousands of people all over world-Its really need of the hour to know things which help to boost our immunity and strengthen us to fight against this threat-full situation.<\/p>\n<p>The inbuilt immune system in the body helps to fight against diseases and makes us healthy and strong. But to maintain immunity and boost it regularly with a healthy lifestyle is the need of the hour.<\/p>\n<p>To boost immunity is a superb idea but proper effects are required to acquire and maintain it. It never depends on a single entity, it’s all combined effect to maintain proper function and harmony.<\/p>\n<p>Several factors affect immunity. First comes proper lifestyle which includes diet, exercise, age, physiological stress, and many other factors.<\/p>\n<p>To boost immunity and strengthen our body most important precautions to be taken are quit smoking and alcohol consumption, a diet rich of fruits and vegetables, regular exercise to maintain a healthy weight, adequate sleep, reduce stress, proper hygiene maintain by washing hands thoroughly and consumption of properly boiled and cooked meat.<\/p>\n<p>Generally, with an increase in age, immune system functioning comes down and they are more prone to diseases. Due to thymus atrophy with aging, reduction in the production of T cells to fight against infection.<\/p>\n<p>So in order to maintain good immunity, food containing vitamins C, E, D, A and antioxidants should be added in the diet.<\/p>\n<p>Both macronutrient and micronutrient deficiency also should be taken into consideration as these nutrients play an important role in various biochemical reactions taking place in the body.<\/p>\n<p>Daily intake of Vitamin C is required as it is not produced in the body.<\/p>\n<p>Excess intake of this vitamin C and B is also not harmful as it is water-soluble vitamin and excess is not stored in the body.<\/p>\n<p>Vitamin B6 is required for biochemical reactions in the immune system.<\/p>\n<p>Vitamin E is a powerful antioxidant and fights against infections.<\/p>\n<p>Most commonly available food that helps in increasing immunity are as follows:<\/p>\n<ul>\n<li>Citrus foods include grapefruit, oranges, tangerines, lemons, limes contain Vitamin C which increases the production of WBC.<\/li>\n<li>Red and green pepper and strawberries contain Vitamin C and beta carotene.<\/li>\n<li>Kiwi fruit is a rich source of folate, potassium, vitamin K and vitamin C.<\/li>\n<li>Papaya contains papain which has anti-inflammatory properties along with vitamin C, B, and folates.<\/li>\n<li>Turmeric contains curcumin which has anti-inflammatory properties.<\/li>\n<li>Ginger contains gingerol, decreases inflammatory illness. Best medicine during the sore throat and decreases nausea.<\/li>\n<li>Garlic contains allicin which makes it a good immune booster, along with this garlic had the capacity to reduce blood pressure and arteriosclerosis of vessels.<\/li>\n<li>Yogurt is a rich source of probiotics and Vitamin D and regulates immunity.<\/li>\n<li>Broccoli contains a rich source of vitamin A, C, E along with many antioxidants and fibers. Spinach is also rich in many antioxidants and beta carotene.<\/li>\n<li>Almonds contain vitamin E gives a great fight for infections.<\/li>\n<li>Green Tea contains amino acid L-theanine may aid in the production of T cells.<\/li>\n<li>Sunflower seeds contain potassium, magnesium, vitamin B6 and E.<\/li>\n<li>Chicken soup contains Vitamin B6 and gelatin, chondroitin and other nutrients which boost immunity. It also provides more protein and water to the body.<\/li>\n<\/ul>\n<p>Sufficient water intake at least 8 glasses per day gives a proper boost to the body by the detoxification process. Extra two more cups of water are required during the infectious condition to fight against it by regenerating the immune fighting lymphatic cells to get back to normal.<\/p>\n<p>Maintaining a healthy lifestyle with a nutritious diet helps to give body good resistance against infections and fight against the need of the hour.<\/p>\n<p>With proper isolation, hygiene and diet make you fight against Covid 19 or any other life-threatening situations.<\/p>\n<ul>\n<li>Be healthy-Be strong.<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>When we all think about this present situation where COVID-19 threatening the whole world with its aggressive attack leading to the death of thousands of people all over world-Its really need of the hour to know things which help to boost our immunity and strengthen us to fight against this threat-full situation. The inbuilt immune &hellip; <a href=\"https:\/\/clovedental.in\/blog\/boost-immunity-fight-covid-19\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">BOOST YOUR IMMUNITY-FIGHT AGAINST COVID-19<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/11951"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=11951"}],"version-history":[{"count":4,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/11951\/revisions"}],"predecessor-version":[{"id":11961,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/11951\/revisions\/11961"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=11951"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=11951"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=11951"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}