{"id":12445,"date":"2020-06-15T15:25:24","date_gmt":"2020-06-15T09:55:24","guid":{"rendered":"https:\/\/clovedental.in\/?p=12445"},"modified":"2022-02-15T04:53:31","modified_gmt":"2022-02-14T23:23:31","slug":"new-normal-dentistry-indian-perspective","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/the-new-normal-in-dentistry-an-indian-perspective\/","title":{"rendered":"‘The New Normal’ in Dentistry &#8211; An Indian Perspective"},"content":{"rendered":"<p>WHO Emergencies doctor, Michael Ryan warned that the “new Coronavirus may never go away, and the populations have to learn to live with it”. This will be ‘one long, long way to Normal’, says Ryan and of course the countries will have to stay on course for prevention.<\/p>\n<p>There is no doubt that the ‘return to normal’ is being eagerly anticipated by populations, however, that may never happen in its true sense. We have to understand the ‘New Normal’, which will be the <em>normal<\/em> now onwards. And the dental profession will have to epitomize such changes, which it will undertake to survive this pandemic, which has crippled the profession.<\/p>\n<p>For the first time ever in the history of dental practice, the Government has become the final arbitrator of the fate of the Indian dentist. Dentists can no longer undertake a treatment at their own will. They will undertake as per the list given by the Govt and abide by the rules issued by them, which have the element of becoming more and more stringent as the positive cases increase. And all this is happening, when there is scant evidence of communicability from dental practices across the world; rather huge spread is occurring from hospitals and other such businesses which have been allowed to operate and where no statutory warnings have been imposed.<\/p>\n<p>Fear of contracting the disease in dental clinic has brought in a change in the very <em>psyche<\/em> of dentists and patients. More than 90% dentists closed their businesses and they are yet to come to terms of how to operate and sustain under the changed conditions.  Most dentists refused even emergency treatments to their patients and went into self-imposed pity and depression. Patients fortified with half understood information through media shunned dental treatment like the plague. Worst nightmare for the practice of dentistry.<\/p>\n<p>The established norms of practice are to be discarded and new norms ushered in. Large number of patients sitting in the waiting room doesn’t stand good anymore in light of new norms of social distancing. Patients have awakened to the new norms and are no more <em>naïve<\/em> to accept everything with closed eyes. They demand absolute hygiene measures in place. The phenomenal change is the way dentist and the patient feel about dentistry. The patient looks at dentist and his clinic with great suspicion fearing that he may contract disease and the doctor is constantly evolving to move abreast and keep himself safe from the patient. This unimaginable situation of lack of trust which has crept up in every mind can only go once everyone embraces the <em>new normal<\/em>.<\/p>\n<p>Patients are no longer being treated on ‘first come, first serve’ basis; instead, they are triaged as per the emergency of procedure and prior appointments have emerged as the new norm. Suddenly, the Tele-dentistry has come to the forefront and it has become a mandate to call each patient beforehand to ascertain the need for the visit. Since, the Corona Virus has extra-ordinary spread capability and a unique feature of asymptomatic infection; the dentist harbors the greatest fear of spreading the infection to their near and dear ones. Thus, managing the clinic staff and looking after their health and medical condition has also come as a new focus area. Further, enquiring about the personal, travel and medical history of patients have become customary practices. General public is becoming increasingly aware of the hygiene measures and the need for efficient sterilization, and hence average patient also will be very inquisitive and  skeptical of the precautionary measures taken by the dentist at the clinic. The focus has come on the design of the office and the need for a well ventilated office with special focus on air flow and the negative pressure in addition to the disinfection measures adopted to maintain hygiene and sanitation after every patient. Earlier masks, gloves and other PPE were tools reserved for the doctor which are now the new norms for every patient. Spending on the interiors of the clinics will be considered wrong and clean smooth surfaces which can be easily disinfected will be the new norm. Reading materials like newspapers and magazines are a thing of the past now and bare waiting areas will be the accepted norm. Physical distancing will be the new norm and most patients will walk-in when the surgery is ready, and the doctor is free to start the treatment. Digital media is replacing patient education pamphlets and magazines. Cash is being replaced by online payment methods. Specific modifications like issue of patient PPE, managing strictest sterilization and adopting latest disinfection measures and aerosol reducing methods will be the only norm discerning the successful clinics.<\/p>\n<p>Govt announcements on declaration of Containment or the Red, Orange and Green zones will dictate the practices. Dentists will have to modify their treatments as per this new norm. Dental Practice will depend on how many COVID positive cases are there in the area. One may have to give up practice suddenly one day if the area in which the clinic falls is declared as a ‘containment zone’. The positive is that there are huge number of patients waiting to come for treatment, which will happen once the new norms find acceptance with the masses. Dental practices capture the mood of the population towards the disease. Sarah Kliff in NY Times (June 10, 2020) writes that the practice of dentistry has always been the ideal business model since decades, ‘till the Corona happened’ and ‘In the eyes of many economists, the dental practices serve as the perfect barometer for gauging the country’s recovery from the shock of any pandemic’.<\/p>\n<p>Overall, one can safely comment that all these measures which have been elaborated above defining the ‘New Norm’ will usher in a new era for the dental practice, which will be more responsive and reactive to the patients’ needs and will be much safer for the population. There is no better healthcare worker than the dentist who understands about the infection control procedures and the measures to be adopted for the same. And the golden period of dentistry is already dawning with a sea of opportunities for the dental fraternity. Let’s together define the New Normal for us and the patients and take our profession to new heights.<\/p>\n<div><strong>Lt Gen (Dr) Vimal Arora (Retd) <\/strong><\/div>\n<div><strong>BDS, MDS (Prostho) FDS RCPS<\/strong><\/div>\n<div>PVSM, AVSM, VSM &amp; Bar, OSRE (Oman)<\/div>\n<div><strong>Chief Clinical Officer, Clove Dental<\/strong><\/div>\n","protected":false},"excerpt":{"rendered":"<p>WHO Emergencies doctor, Michael Ryan warned that the “new Coronavirus may never go away, and the populations have to learn to live with it”. This will be ‘one long, long way to Normal’, says Ryan and of course the countries will have to stay on course for prevention. There is no doubt that the ‘return &hellip; <a href=\"https:\/\/clovedental.in\/blog\/the-new-normal-in-dentistry-an-indian-perspective\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">‘The New Normal’ in Dentistry &#8211; An Indian Perspective<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":12444,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12445"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=12445"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12445\/revisions"}],"predecessor-version":[{"id":12446,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12445\/revisions\/12446"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/12444"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=12445"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=12445"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=12445"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}