{"id":12484,"date":"2020-06-29T19:47:33","date_gmt":"2020-06-29T14:17:33","guid":{"rendered":"https:\/\/clovedental.in\/?p=12484"},"modified":"2022-02-15T05:34:53","modified_gmt":"2022-02-15T00:04:53","slug":"dental-visit-covid-19-whats-whens-making-next-appointment","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/dental-visit-during-covid-19\/","title":{"rendered":"Dental Visit during COVID-19: What&#8217;s and When&#8217;s before making your next appointment"},"content":{"rendered":"<p>Currently, the entire world is in the grip of a pandemic, the Novel COVID-19. These are unique and unprecedented times, as the country has been put under strict lockdown for the first time in modern Indian history.<\/p>\n<p>The COVID-19 pandemic is changing the way we access health care, and dental care is no exception. In a highly collaborative field such as dentistry, involving close patient contact, the risks of infection are high. The main reason for this is the nature in which this novel coronavirus spreads, that is, mainly via respiratory droplets. This has forced all segments of dentistry to reconsider infection control practices and products.<\/p>\n<p>As the lockdown guidelines are starting to ease across the country, dental clinics are also being allowed to reopen. But should you rush in making an appointment, or is it better to wait it out a little bit longer?<\/p>\n<p>Here’s everything you would want to know about visiting a dentist right now, during these uncertain times.<\/p>\n<p><strong>Is it Safe to Visit a Dental Clinic Now? <\/strong><\/p>\n<p>Even before the pandemic, dental clinics were required to maintain fairly strict hygiene practices. It has long been a standard protocol for the entire dental care team to wear protective gear, including gloves, surgical masks, and goggles for eye protection to minimize the risk of transmitting germs from one patient to another.<\/p>\n<p>Now, due to COVID-19, there are additional safety precautions in place, many of them recommended by the Ministry of Health &amp; Family Welfare (MoH&amp;FW) itself and with the newly enhanced safety precautions, the dental clinics are, therefore, safe to visit.<\/p>\n<p><strong>When Should I Visit a Dentist? <\/strong><\/p>\n<p>Firstly, it’s important to understand whether the situation is a dental emergency or not. It’s important to see your dentist, as soon as possible, if you notice any of the following conditions:<\/p>\n<ul>\n<li>Swollen cheeks\/gums and extreme pain from swelling or possible infection;<\/li>\n<li>Extreme tooth sensitivity or toothache causing constant pain;<\/li>\n<li>Gums that does not stop bleeding; or<\/li>\n<li>Trauma from an accident.<\/li>\n<\/ul>\n<p>Issues such as teeth cleaning, whitening of teeth, mild sensitivity, or a small chip in the tooth can all be treated at a later point in time. However, it is advisable to call up your dentist and let them decide if a visit is required or not.<strong> <\/strong><\/p>\n<p><strong>Do I Need a Prior Appointment? <\/strong><\/p>\n<p>In the present circumstances, it is advisable to take a prior appointment before visiting a dental clinic for the following reasons:<\/p>\n<ul>\n<li>To minimize the number of patients in the waiting area, hence, ensuring social distancing;<\/li>\n<li>To minimize waiting time for the patient;<\/li>\n<li>Since the time taken to prepare the dental operatory has increased because of the elaborate safety protocol to be followed, a prior appointment is encouraged.<\/li>\n<\/ul>\n<p><strong>What are Dental Clinics Doing to Protect Patients and Staff from COVID-19? <\/strong><\/p>\n<p>Safety is of utmost concern, especially now, as dentists enter the new COVID-19 world. Dental clinics today are taking extra precautions, which are also recommended by the MoH&amp;FW:<\/p>\n<ul>\n<li>Appointments: Telephonic screening of all patients is done prior to giving them an appointment. Appointments are staggered with more time allotted for each patient to reduce the number of people in the clinic at any given time to ensure social distancing among patients.<\/li>\n<li>Screening: The temperature and pulse oximeter reading of anyone entering the clinic is recorded for screening purposes. A detailed medical and travel information is being taken from all patients regarding COVID-19 along with other diseases in general, and treatment is rendered only after the assessment of risk.<\/li>\n<li>Eliminating shared spaces: Chairs are placed six feet apart in the waiting room. If you are early for your appointment or if the dentist is running late, you may be asked to wait outside in your car or in an outdoor space until the previous patient has left and the facility has been reset.<\/li>\n<li>Increasing sanitation: Dentists will have sanitized tools at the ready before you arrive for your appointment. New procedures have been established to ensure that chairs and non-disposable instruments are thoroughly disinfected after the treatment of every patient.<\/li>\n<li>Personal Protective Equipment (PPE): Dentists use PPE including hairnets, face shields, gloves, and full-body gowns and suits while they work. PPE is changed after treating each patient to minimize the risk of cross contamination, as recommended by the current guidelines.<\/li>\n<li>Changing procedures to avoid aerosols: Some equipment or certain procedures may end up producing more aerosols than others. If aerosols are unavoidable (which may be the case for certain surgeries or extensive procedures) then dentists are required to use other tools to effectively remove the aerosol.<\/li>\n<\/ul>\n<p><strong>What Precautions Should I Take While Visiting a Dental Clinic? <\/strong><\/p>\n<ul>\n<li>Participate in pre and post-appointment screenings, be honest with your dentist, and don’t skip on the details.<\/li>\n<li>You should wear a mask whenever possible- while walking through the facility, while discussing your consultation, and on the way out. Doing so may prevent you from unknowingly spewing infectious airborne particles and may even prevent you from breathing them in.<\/li>\n<li>Avoid using the restroom. If you choose to use the restroom or touch a surface with your bare hands, you should wash or sanitize your hands immediately afterwards. Also, washing your hands is important after you leave the clinic.<\/li>\n<li>Adhere to the appointment time and avoid getting an attendant, with an exception of dependents and children.<\/li>\n<li>Avoid wearing a wristwatch, jewellery, and any other additional accessories or bags.<\/li>\n<li>Online payments through wallets or QR codes are encouraged to avoid chances of transmission via cash or credit cards.<\/li>\n<\/ul>\n<p><strong>What Can I Do in the Meantime? <\/strong><\/p>\n<p>COVID-19 is going to be with us for many months. So it’s important to look after your oral health by maintaining a healthy diet and oral hygiene routine.<\/p>\n<ul>\n<li>Brush twice daily: Spend at least 2- 3 minutes on brushing.<\/li>\n<li>Use Fluoride toothpaste: Fluoride is absorbed into the enamel and helps to repair it by replenishing the lost calcium and phosphorous, required to keep your teeth hard.<\/li>\n<li>Avoid sticky foods: ‘Sticky foods’ are those that provide long-lasting sources of sugar, such as hard candies, breath mints, and lollipops. These are also linked to tooth decay and should be avoided.<\/li>\n<li>Drink lots of water: Water helps in keeping your mouth clean and fighting dry mouth. It washes away leftover food and residue that cavity- causing bacteria are looking for. Moreover, it also dilutes the acids produced by such bacteria.<\/li>\n<\/ul>\n<p>By:-<br \/>\nDr. Anisha Keshan,<br \/>\nPedodontist<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Currently, the entire world is in the grip of a pandemic, the Novel COVID-19. These are unique and unprecedented times, as the country has been put under strict lockdown for the first time in modern Indian history. The COVID-19 pandemic is changing the way we access health care, and dental care is no exception. In &hellip; <a href=\"https:\/\/clovedental.in\/blog\/dental-visit-during-covid-19\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Dental Visit during COVID-19: What&#8217;s and When&#8217;s before making your next appointment<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":12494,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12484"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=12484"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12484\/revisions"}],"predecessor-version":[{"id":12486,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12484\/revisions\/12486"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/12494"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=12484"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=12484"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=12484"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}