{"id":12497,"date":"2020-07-08T11:30:47","date_gmt":"2020-07-08T06:00:47","guid":{"rendered":"https:\/\/clovedental.in\/?p=12497"},"modified":"2022-01-17T15:45:04","modified_gmt":"2022-01-17T10:15:04","slug":"dental-visit-safer-ever","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/your-dental-visit-is-safer-than-ever-before\/","title":{"rendered":"Your Dental Visit is Safer than ever before"},"content":{"rendered":"<p>As you all might know, we have reopened our Clove Dental clinics to serve you back again. While we were planning to begin providing dental care to all our patients in Post Lockdown, the one thing which concerned us the most was the<strong> safety of our patients as well as the entire Clove Dental team<\/strong>, in other words, of all the people associated with Clove Dental. We are proud to announce that <strong>Clove Dental clinics<\/strong> are providing dental treatments to patients with <strong>100% protection against microbial infections including COVID-19<\/strong>. Clove Dental is the name already known to use the best infection control practices before the COVID-19 pandemic. Now, we have gone far beyond for every one of your safety.<\/p>\n<p>In these unprecedented times, we also need you to maintain your oral health. The COVID 19 pandemic has changed our lives in many different ways, your focus should be to stay healthy during this time. <strong>Your oral health is a part of your overall well-being<\/strong>. If you have any complaints, <strong>book your appointment<\/strong> with us. What we do is we ensure you get treatment in the <strong>safest environment<\/strong>.<\/p>\n<p>As you visit us, please expect some changes before, during, and after your dental visit. These new changes have been made in our clinics for the extra safety of all of us. <strong>Being prepared for your dental appointment is important.<\/strong> Isn’t it?<\/p>\n<ul>\n<li>First of all, you might receive a call from Clove Dental asking about your current health before your appointment<\/li>\n<li>You will be requested to wear a face mask during transport to Clove Dental<\/li>\n<li>You will also be given a 3-layered mask, gloves, shoe cover and sanitizers at the entrance<\/li>\n<li>You will find waiting chairs placed at a distance in the reception area<\/li>\n<li>You will be requested to come alone for the appointment, if possible. Children and older people should be accompanied by caregivers<\/li>\n<li>Your body temperature and oxygen saturation levels will be checked in the reception<\/li>\n<li>You will not find magazines, toys, TV remote or similar items for some entertainment<\/li>\n<li>You will find paper towels instead of cloth towels in clinics<\/li>\n<li>You will be requested to perform hand hygiene and wear mask at the end of your treatment<\/li>\n<li>You will find the latest technology-based machines and devices in the clinic which we have imported recently to suction aerosols<\/li>\n<li>You might see our dental assistants disinfecting the treatment area with high strength disinfectants and covering all contact points such as handles, computer keypad, etc. with disposable coverings<\/li>\n<li>You will be requested to rinse your mouth with an antibiotic oral rinse<\/li>\n<li>You will find our dentists at Clove Dental wrapped under multiple protective covers<\/li>\n<li>You will receive a follow-up call in 24 hours and after a week as we want to make sure you are in your best health<\/li>\n<\/ul>\n<p>With all these easy steps, you are 100% safe for your upcoming dental visit with us! So, let’s get started.<\/p>\n<p>Dr. Mani Baweja<br \/>\nPaedodontist at Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As you all might know, we have reopened our Clove Dental clinics to serve you back again. While we were planning to begin providing dental care to all our patients in Post Lockdown, the one thing which concerned us the most was the safety of our patients as well as the entire Clove Dental team, &hellip; <a href=\"https:\/\/clovedental.in\/blog\/your-dental-visit-is-safer-than-ever-before\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Your Dental Visit is Safer than ever before<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":12496,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12497"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=12497"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12497\/revisions"}],"predecessor-version":[{"id":12498,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/12497\/revisions\/12498"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/12496"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=12497"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=12497"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=12497"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}