{"id":13630,"date":"2021-03-08T12:14:45","date_gmt":"2021-03-08T06:44:45","guid":{"rendered":"https:\/\/clovedental.in\/?p=13630"},"modified":"2022-02-15T05:26:31","modified_gmt":"2022-02-14T23:56:31","slug":"pregnancy","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/gum-disease-healthy-pregnancy\/","title":{"rendered":"Establishing the Link between Gum Disease and a Healthy Pregnancy"},"content":{"rendered":"<p style=\"text-align: left\"><strong>Contributed By: Dr. Aarti Sharma &amp; Lt Gen Dr Vimal Arora<\/strong><\/p>\n<p>According to <em>The Journal of the American Dental Association,<\/em> Pregnant women with chronic gum disease are four to seven times more likely to have a premature baby. Pregnancy is a time of great expectations, however, few expectant mothers understand the importance of good dental health during pregnancy. Pregnancy causes a variety of hormonal changes and some of these changes bring an increased risk of gum disease. The elevated levels of progesterone that come with pregnancy, cause an exaggerated response to the bacteria present in plaque, which can cause gingivitis.<\/p>\n<p>Warning signs include gums that bleed easily or are red, swollen or tender. Gums that have pulled away from the teeth, or are loose or separating are also possible signs of gum disease. However, when gum disease goes untreated in pregnant women, very serious problems can result.<\/p>\n<p>According to research published by the US National Library of Medicine, National Institutes of Health, premature and low-birthweight babies are 40 times more likely to die during their first month. Premature infants are also vulnerable to complications including chronic lung disease, injury to the intestines, a compromised immune system, cardiovascular disorders, and hearing and vision problems.<\/p>\n<p>According to the <em>Journal of Natural Science, Biology and Medicine<\/em>, the bacteria that cause inflammation in the gums can get into the bloodstream and reach the fetus. In scientific terms, gum disease can produce endotoxins that stimulate the production of cytokines and prostaglandins. This fetal toxicity, or poisoning, that can result from bacterial infections can cause low-birthweight babies.<\/p>\n<p>However, gum disease can be easily treated and prevented – far more easily than the problems that can result in infancy when gum disease goes untreated in pregnant women with minimal care and consultation.<\/p>\n<ul>\n<li>As soon as you find out you are pregnant, see your dentist for a professional evaluation of your gums.<\/li>\n<li>Brush at least twice a day, floss once a day and use an antimicrobial mouth rinse to prevent pregnancy gingivitis.<\/li>\n<li>Frequent cleanings during pregnancy will enable your dentist to monitor the health of your gums and address any problems that arise.<\/li>\n<li>Pay careful attention to your teeth and gums during pregnancy and report any signs of gum disease to your dentist right away.<\/li>\n<\/ul>\n<p>If you do experience gum disease during pregnancy, it should be treated as soon as possible. Gingivitis, the early stage of gum disease, can usually be eliminated with professional cleaning or scaling. During the cleaning, plaque and tartar will be removed from above and below the gum line of the teeth. Root planing can also be performed to treat gum disease. As you prepare for the arrival of your little one, take care to practice good oral hygiene and seek regular care from a dental professional. Not only will you preserve your dental health, you’ll be taking important steps to protect the health of your baby.<\/p>\n<p><strong style=\"color: #ff7e23\">This Women&#8217;s Day, Clove Dental has special surprises for you to make that smile dazzle brighter!<\/strong><\/p>\n<ul>\n<li>Free Smile Consultation<\/li>\n<li>Complimentary Annual Dental Health Plan<\/li>\n<\/ul>\n<p><strong>Inclusions:<\/strong><\/p>\n<ul>\n<li>Rs 1500 worth of treatment<\/li>\n<li>Unlimited Complimentary Consultations &amp; X-Rays<\/li>\n<\/ul>\n<div class=\"btn-row\" style=\"margin-bottom: 20px\"><a class=\"btn3\" href=\"\/dhp-payment\/?cn=REVOVEFMIEhFQUxUSCBQTEFOIDIuMA==&amp;amt=NTYw\">Book now<\/a><\/div>\n<p>.blog-detail .col-left a {text-decoration: inherit !important;font-weight: 400!important;color:#000!important;}.btn3:hover{color:#000 !important;}<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contributed By: Dr. Aarti Sharma &amp; Lt Gen Dr Vimal Arora According to The Journal of the American Dental Association, Pregnant women with chronic gum disease are four to seven times more likely to have a premature baby. Pregnancy is a time of great expectations, however, few expectant mothers understand the importance of good dental &hellip; <a href=\"https:\/\/clovedental.in\/blog\/gum-disease-healthy-pregnancy\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Establishing the Link between Gum Disease and a Healthy Pregnancy<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":13642,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13630"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=13630"}],"version-history":[{"count":23,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13630\/revisions"}],"predecessor-version":[{"id":14817,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13630\/revisions\/14817"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/13642"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=13630"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=13630"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=13630"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}