{"id":13802,"date":"2021-03-24T12:46:06","date_gmt":"2021-03-24T07:16:06","guid":{"rendered":"https:\/\/clovedental.in\/?p=13802"},"modified":"2022-02-15T05:30:22","modified_gmt":"2022-02-15T00:00:22","slug":"dentist-may-diagnose-systemic-diseases-anyone-else","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/enamel-kidney-syndrome\/","title":{"rendered":"Your dentist may diagnose your systemic diseases before anyone else"},"content":{"rendered":"<p>World Health Organization defines oral health in terms of general, physical, psychological and social well-being. Teeth and gums speak volumes about the overall physiological well-being. The manifestation of our internal health can be observed through notable changes in teeth, gums or tongue. A similar manifestation has been seen in a case of tooth enamel defect associated with renal disease called Nephrocalinosis.<\/p>\n<p>Recently, a 10 year old female patient reported at Clove Dental clinic with the chief complaint of delayed eruption of upper front teeth. Based on oral examination, a tooth development disorder of Amelogenesis Imperfecta was suspected. However, the symptoms of generalized Gingival Fibromatosis raised the possibility of an underlying Renal Syndrome. While the parents of the child accounted for no significant medical history related to the patient, renal ultrasound confirmed the presence of Bilateral Nephrocalcinosis, a rare genetic kidney disease, which thereby confirmed the diagnosis of Enamel-Renal Syndrome.<\/p>\n<p>Enamel formation or Amelogenesis is a systematic process of tooth enamel deposition. Any disturbance in this process can lead to Tooth Discoloration, Hypocalcification, Hypomaturation, Fragility, Delayed\/Unerupted Teeth etc. It is controlled by genetic function due to which a genetic mutation is likely to cause the disorder. A British Medical Journal article found that one of the gene (CLDN16) mutation associated with Amelogenesis Imperfecta is also associated with genetic disorder of Nephrocalcinosis. It is a disease state known for too much deposition of calcium in kidneys in forms of Calcium Oxalate and Calcium Phosphate. This process can impair the kidney functions and can also cause kidney stones.<\/p>\n<p>Apart from the present case, several scientific journals in US National Library of Journal of Medicine such as Nephology Physiology, Archives of Oral Biology &amp; Journal of Clinical Pediatric Dentistry have also reported cases showing the association of between these two conditions.<\/p>\n<p>The possibility of common genetic mutation makes it essential to understand the disorders and its relationship. Systematic scoring of both tooth and kidney symptoms would help to discriminate both the conditions and will allow for early diagnosis. Hence, it is recommended that:<\/p>\n<ol>\n<li>All patients with Amelogenesis Imperfecta should have detailed renal examination<\/li>\n<li>All patients with Nephrocalcinosis should be referred for oral examination.<\/li>\n<\/ol>\n<p>Oral Health and Overall Health have a synergistic and dynamic relationship. Regular dental check-ups from experienced dentists can help a lot in maintaining good oral and overall health and be aware of possible ailments prevailing in body.<\/p>\n<p><strong>Contributed By: <\/strong><strong>Dr Niranjana Arumugam &amp; Dr Rahul Kumar Raman<\/strong><\/p>\n","protected":false},"excerpt":{"rendered":"<p>World Health Organization defines oral health in terms of general, physical, psychological and social well-being. Teeth and gums speak volumes about the overall physiological well-being. The manifestation of our internal health can be observed through notable changes in teeth, gums or tongue. A similar manifestation has been seen in a case of tooth enamel defect &hellip; <a href=\"https:\/\/clovedental.in\/blog\/enamel-kidney-syndrome\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Your dentist may diagnose your systemic diseases before anyone else<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":13801,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13802"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=13802"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13802\/revisions"}],"predecessor-version":[{"id":13803,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13802\/revisions\/13803"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/13801"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=13802"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=13802"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=13802"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}