{"id":13812,"date":"2021-03-31T16:10:48","date_gmt":"2021-03-31T10:40:48","guid":{"rendered":"https:\/\/clovedental.in\/?p=13812"},"modified":"2022-02-15T05:41:47","modified_gmt":"2022-02-15T00:11:47","slug":"covid-tongue-considered-symptom","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/covid-tongue-considered-symptom\/","title":{"rendered":"COVID Tongue: Should it be Considered as a Symptom After All?"},"content":{"rendered":"<p>Dentists have been known to diagnose plethora of diseases through oral cavity which is supposed to be a mirror to overall health. One of the latest symptoms that is being noticed in association with coronavirus infection is COVID tongue where dentists may play a major role.<\/p>\n<p>The term “COVID tongue” was coined recently after Mr Tim Spector, a professor of genetic epidemiology at King’s College London tweeted about patients reporting with COVID tongue and tongue ulcers. Mr Spector heads the ZOE COVID-19 Symptom Study app, where participants submit symptom reports on a daily basis. He found in his research that almost 1-2 patients out of every 500 got some strange symptoms in their mouths with may include swelling in the tongue, strange patches on the tongues and ulcers. According to the ZOE website, however, there is an increased user submissions of abnormal looking tongue, in particular white and patchy appearance.<\/p>\n<p>According to The British Journal of Dermatology, which published a report on 666 patients, 25.7% patients had oral cavity symptoms and 3.9% were reported having tongue swelling with patchy depapillation. As per Oral Diseases report, COVID‐19 patients frequently develop oral lesions symptoms related to a certain state of immunosuppression where stress may also play a crucial role in the appearance of these oral conditions.<\/p>\n<p>The British Dental Journal, published by Springer Nature, has suggested that the COVID Tongue has a resemblance of Geographic Tongue, an inflammatory condition affecting the surface of tongue. While there may be a possible association of Geographic Tongue with SARS-CoV-2 infection, there are only two communications in the literature reporting it as part of COVID-19 illness till date. The symptoms may be linked to the elevated levels of the inflammatory Cytokine Interleukin-6 (IL-6) in both Geographic Tongue and SARS-CoV-2 infection, as well as higher angiotensin-converting enzyme 2 (ACE2) receptor expression in the tongue where ACE2 receptors are also the entry point of the SARS-CoV-2 virus.<\/p>\n<p>The diagnostic value of COVID Tongue is still unknown and it should be treated with caution. According to the ZOE website, these changes to the mouth or tongue may not be the only symptom of COVID-19, or whether they tend to come earlier or later in the illness. Whilst a report by NDTV also claims that COVID Tongue could be one of the “non-classic symptoms” that tends to get overlooked since not every ulcer or patch in the mouth is associated with COVID. This may be very early sign in a very recent finding.<\/p>\n<p><strong>Contributed by<\/strong>: Lt Gen Dr Vimal Arora &amp; Dr Rahul Kumar Raman<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Dentists have been known to diagnose plethora of diseases through oral cavity which is supposed to be a mirror to overall health. One of the latest symptoms that is being noticed in association with coronavirus infection is COVID tongue where dentists may play a major role. The term “COVID tongue” was coined recently after Mr &hellip; <a href=\"https:\/\/clovedental.in\/blog\/covid-tongue-considered-symptom\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">COVID Tongue: Should it be Considered as a Symptom After All?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":13813,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13812"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=13812"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13812\/revisions"}],"predecessor-version":[{"id":13814,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/13812\/revisions\/13814"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/13813"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=13812"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=13812"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=13812"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}