{"id":14401,"date":"2021-11-11T19:53:53","date_gmt":"2021-11-11T14:23:53","guid":{"rendered":"https:\/\/clovedental.in\/?p=14401"},"modified":"2022-01-17T15:48:15","modified_gmt":"2022-01-17T10:18:15","slug":"wisdom-tooth-removal-happens-ignore-impacted-teeth-long","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/wisdom-tooth-removal-happens-ignore-impacted-teeth-long\/","title":{"rendered":"Wisdom Tooth Removal: What Happens When You Ignore Impacted Teeth for Long?"},"content":{"rendered":"<p>Impacted wisdom tooth is a dental condition where the third molars or wisdom tooth does not erupt completely through the gums. They can also grow at odd angles, and press the nerve of the nearby teeth. Plaque can accumulate easily on such teeth as they are difficult to clean. The result can be cavities, tooth decay, infection, gingivitis and other issues.<\/p>\n<p>Still, many people try to ignore impacted teeth for too long? Let us tell you, it is a serious dental condition that should be immediately taken care of. What are the consequences of overlooking this issue? Have a look!<\/p>\n<ul>\n<li><strong>Bacterial Infection –<\/strong> People who do not get their impacted teeth treated usually suffer from bacterial infections of the mouth. Swelling and inflammation of gums can further aggravate the issue. The dentist will treat this infection through antibiotics. However, in severe cases, they might also undergo oral surgery to open the gum flap that is preventing the tooth to come out. Please note that these bacterial infections can directly impact your kidneys, heart, and other organs by entering into the bloodstream.<\/li>\n<li><strong>Difficulty Brushing –<\/strong> Impacted teeth are always half-grown or erupt at abrupt positions. It makes cleaning them extremely difficult. Ignoring this condition for too long can invite dental issues like tooth pain, decay, and cavities. Hence, you should consult a dentist to get impacted teeth removed to prevent other dental issues.<\/li>\n<li><strong>Impacts Adjacent Teeth –<\/strong> Do you know that untreated impacted teeth can also pose a danger to their adjacent teeth? You should consult an experienced dentist in case you are experiencing any pain in the nearby teeth. The dentist will perform an x-ray to determine the exact condition of the impacted teeth. Tooth extraction might become the only option to get relief, in case, the issue escalates.<\/li>\n<li><strong>Cyst –<\/strong> An impacted tooth that stays long in the gums can give rise to a cyst. It is a serious dental condition that can lead to nerve damage or hollowing of the jaw. This cyst can also make drinking, chewing, and swallowing painful for the patient. Tooth extraction is the only way to get rid of this dental cyst.<\/li>\n<\/ul>\n<p>These were the effects of not removing or treating your impacted wisdom teeth. Procrastination can invite some lifelong complications as well. If your molars or wisdom teeth are impacted and hampering your oral hygiene, it is often safest to get them removed. So make sure you take this matter seriously, consult a good dentist and get them removed at the earliest. Visit your nearest Clove Dental clinic to know the current tooth extraction cost in Delhi before going for the procedure.<\/p>\n<p>Now, what about healthy wisdom teeth? You see, wisdom that erupts in a functional and upright position might not be removed, as long as, they do not impact your adjacent teeth and gums. However, dental experts recommend going for regular checkups to keep an eye on the health of these wisdom teeth.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Impacted wisdom tooth is a dental condition where the third molars or wisdom tooth does not erupt completely through the gums. They can also grow at odd angles, and press the nerve of the nearby teeth. Plaque can accumulate easily on such teeth as they are difficult to clean. The result can be cavities, tooth &hellip; <a href=\"https:\/\/clovedental.in\/blog\/wisdom-tooth-removal-happens-ignore-impacted-teeth-long\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Wisdom Tooth Removal: What Happens When You Ignore Impacted Teeth for Long?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":14404,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/14401"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=14401"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/14401\/revisions"}],"predecessor-version":[{"id":14409,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/14401\/revisions\/14409"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/14404"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=14401"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=14401"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=14401"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}