{"id":3095,"date":"2017-06-15T08:42:51","date_gmt":"2017-06-15T08:42:51","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=3095"},"modified":"2021-02-24T11:26:24","modified_gmt":"2021-02-24T05:56:24","slug":"dental-myths-busted","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/dental-myths-busted\/","title":{"rendered":"Dental myths busted"},"content":{"rendered":"<p>Visiting a Dentist is generally considered akin to asking the feeble minded to see a horror movie numerous myths have been woven around this very critical body of dentistry\/ oral healthcare which is unfortunately the most neglected and misunderstood amongst all. The good news is that all myths about dentistry will be quelled once you read on:<\/p>\n<h3>1\/ Visiting a Dentist is a painful and dreadful experience<\/h3>\n<p>This is absolutely untrue – Can vouch for some clinics which have a different feel altogether. Clinics are now specially designed unconventionally with a “feel good” factor. Clove is one of them. It’s café like ambience instantly puts frayed nerves at ease. Here you only interact with doctors, no reception desk, straight to the doctor who is pleasant and is an endearing personality.<\/p>\n<p>New techniques of tooth filling require ‘nil or minimal tooth cutting’ thereby the uncomfortable sound of drilling is avoided. Better equipment makes the procedure fast and painless and one can get a <a href=\"https:\/\/clovedental.in\/specialties\/root-canal-treatment\/\">single sitting root canal<\/a> done in a jiffy. The doctors and specialists undergo training in soft skills to treat you gently and make you relax. Never ever put off going to a dentist as a “stitch in time saves nine”!<\/p>\n<h3>2\/ Older the doctor, the better will be the outcome – not necessarily always true<\/h3>\n<p>The general perception is that if a dentist is older and has a salt and pepper crown, he is likely to be more skilled at his craft. Experience does undoubtedly count but not always entirely true- the level of expertise doesn’t always depend on a person’s physical demeanor but deep domain knowledge and specialization in various branches of dentistry which ranges from Periodontics, Pedodontics, Prosthodontics, Orthodontics, Endodontics, <a href=\"https:\/\/clovedental.in\/specialties\/dental-implant\/\">Implantology<\/a> or Maxillofacial surgery which is key, a “game changer”. To cite my own example, I was petrified of getting a RCT (Root Canal Treatment) done and was visiting one of the clinics where I was greeted by a young Doctor Shipra who was practicing from Rohini. My first impression was how young and pleasant is she and can one trust her with my Root canal treatment ? When we got talking, I divulged that I was putting off a cavity filling and an RCT which was long overdue. I also realized that she was an Endodontist specialized in Root Canal and she has been trained on latest technology unlike, probably, the grey haired doctor whose treatment process could be outdated. Believe it or not, I was soon sitting on the dental chair and she was doing the procedure. It was 99% painless and I just marveled at her skill of convincing me and was pleasantly taken aback that she was a young lady who was brilliant at her job. I, in fact went one step further and got my cavity filling done as well. So physical seniority wasn’t a measure to define a doctor’s skill. The young doctor instilled a sense of trust and confidence in me and the treatment was virtually painless. Here competence took precedence over seniority\/physical appearance.<\/p>\n<h3>3\/ You will get infected with germs if you visit a Dentist – now no longer true particularly in new age clinics<\/h3>\n<p>Healthcare business is serious business and particularly that of Oral Healthcare…here we are dealing with blood and saliva…a recipe for disaster if asepsis (complete hygiene) is not maintained. Getting infected with germs when you visit a dentist has to be always at the top of your mind…One must always choose a clinic where utmost precautions are taken towards sterilization. At Clove, sterilization &amp; asepsis protocols are similar and as practiced in States. Clinics rest on the foundation of commitment to the best and robust standards of Hygiene The Sterilization room stands testimony to the fact that Dentists and Dental Assistants are specifically trained to ensure that <a href=\"https:\/\/clovedental.in\/sterilization\/\">100% sterilization protocol<\/a> is maintained. Every equipment\/instrument in the clinic and the dental chair in the operatory is scientifically sterilized and goes through a 4-tier robust process. Instruments go through rigorous washing, cleaned in an ultrasonic cleaner are then eventually put in the B-class autoclave and are then pouched, dated complete with expiry dates. So one is sure that these instruments have not been used on any other patient.<\/p>\n<h3>4\/ Dentists are commercial and dental treatments are expensive – a misnomer<\/h3>\n<p>No longer true as good clinics revolve around values based on Trust, Respect &amp; Integrity coupled with conducting business and delivering healthcare ethically to its patients. Dentists charge a nominal consultation fee, which is a genuine amount as the doctor too will incur expenditure on disposables etc. which cost money. Dentists never impose the treatment plan but only help the patients by providing a little direction to arrive at a logical conclusion. Money should never be the criteria to determine a treatment as doctors who are ethical will give you a series of recommendations that are good and cost effective depending on case to case. Depending on an individual’s capacity to pay, EMI options are offered for hi-value cases. Most importantly, doctors will provide various options\/ treatments and offer an array of products that the patient can chose from. Products which are branded will have credibility, and have a better life and warranty. Most importantly, the doctor will emphasize the necessity of addressing your core issue at your earliest convenience lest it deteriorates into something worse and burns a hole in your pocket.<\/p>\n<h3>5\/ Braces are only meant for the younger lot &#8211; Incorrect statement as Dentistry has come a long way – Orthodontic treatment is now fit for all age groups<\/h3>\n<p>Whether you are 20, 30 or 50, you have a reason to celebrate &#8211; your crooked teeth can be realigned to make you look beautiful. Orthodontists are adept at <a href=\"https:\/\/clovedental.in\/blog\/reinvent-smile-speed-braces\/\">rectifying your teeth<\/a> by recommending braces (metallic or ceramic, invisible aligners etc., custom made for each case). Gone are the days, when there was a perception that only the younger generation could get their perfect smile….on the contrary, that aunt next door who is in her twilight years can surely heave a sigh of relief as specialists will offer to straighten her teeth almost painlessly and within a year she can regain her lost confidence and will be “all smiles” once again.<\/p>\n<h3>6\/ Frequent brushing results in cleaner and healthier teeth.<\/h3>\n<p>The good old adage “Excess of anything is bad” is so very true in this context. Correct technique and brushing twice daily is indeed the recipe for a good set of healthy and pearly white teeth. The type of brush and the brushing technique both are critically important. The use of a hard brush is the main culprit as it causes abrasion (wearing off) of teeth thus producing extreme sensitivity. Also, the brushing technique has an important role because, if too much of to &amp; fromotion is used, abrasion is inevitable. Actually, brushing the right way and rinsing after each meal and flossing regularly is the real answer. It is also important to massage your gums to make them feel healthy and keep the circulation of blood going. In fact, if you have developed the art of brushing, then a toothpaste is secondary. It is critical to rinse your mouth particularly after eating a lot of sweet meats as bacteria can lodge &amp; breed easily causing gum diseases &amp; cavities over a period of time. As age advances, there will be a necessity to start using inter-dental brushes.<\/p>\n<h3>7\/ Teeth Cleaning\/Scaling &amp; Polishing (oral prophylaxis) not a good idea – results in loss of enamel and increased sensitivity &#8211; statement not true.<\/h3>\n<p>Scaling and Polishing is recommended and particularly good to do after a period of 6 months. It’s important to follow this regime, especially if you are prone to accumulating plaque. Dentists help you clean your teeth and clean deposits or plaque which is lodged in places where brush cannot reach. You will be bereft of any impending periodontal \/gum disease particularly, if you have swollen or bleeding gums due to plaque accumulation. Not only will you be relieved of bad breath but will feel fresh with cleaner and healthier teeth which are so vital for overall good health. It’s a misconception that scaling and polishing will lead to loss of the outer protective layer of the teeth (enamel) resulting in increased sensitivity. The reverse is true.<\/p>\n<p>&lt;pHence, please do fix up an appointment with your dentist and don’t put this on the back burner as, who knows going for a regular consultation or normal scaling and polishing can prevent you<br \/>\nfrom a bigger problem lurking in the dark!<\/p>\n<p>By:-<br \/>\nRadhika Gupta,<br \/>\nClove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Visiting a Dentist is generally considered akin to asking the feeble minded to see a horror movie numerous myths have been woven around this very critical body of dentistry\/ oral healthcare which is unfortunately the most neglected and misunderstood amongst all. The good news is that all myths about dentistry will be quelled once you &hellip; <a href=\"https:\/\/clovedental.in\/blog\/dental-myths-busted\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Dental myths busted<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":950,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3095"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=3095"}],"version-history":[{"count":14,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3095\/revisions"}],"predecessor-version":[{"id":13569,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3095\/revisions\/13569"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/950"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=3095"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=3095"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=3095"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}