{"id":3604,"date":"2017-07-08T10:18:44","date_gmt":"2017-07-08T10:18:44","guid":{"rendered":"http:\/\/clovedental.in\/ws\/?p=3604"},"modified":"2022-02-15T05:44:32","modified_gmt":"2022-02-15T00:14:32","slug":"can-anyone-get-dental-implants","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/can-anyone-get-dental-implants\/","title":{"rendered":"Can Anyone Get Dental Implants?"},"content":{"rendered":"<p>After evaluating and treating thousands of cases who are looking for Implants to replace their missing teeth; I would like to say that most of the patients who were told some time back that you have poor or insufficient bone and are not fit for <a href=\"https:\/\/clovedental.in\/specialties\/dental-implant\/\">Dental Implants<\/a>, can be undertaken for the rehabilitation with Implants with ease today. The recent techniques and the newer materials including the bone augmentation procedures allow us to ensure placement of Implants in most of the poor prognosis cases also.<\/p>\n<p>The most apparent reason that stops an Implantologist from placing an Implant is absence of bone in the jaws as the implant has to have sound and healthy bone for suitable prognosis. Lack of bone will not create adequate union between the bone and the implant (Osseo-integration). Bone is measured for two factors which are important for treatment planning; quantity and the quality. Quantity broadly relates to the height and width of the leftover bone (residual alveolar ridge) once the tooth is extracted or it falls on its own. The quality refers to its density and hardness. Patients where the bone is deficient, it can be augmented or built up using different artificial bone options and where the bone is poor in quality; the location or the type of Implants used can be changed to get predictable prognosis. Recent techniques employed for bone grafting include use of Platelet Rich Plasma (growth factors from own blood), rhBMP (bone morphogenic protein), harvesting own natural bone or using artificial bone substitutes.<\/p>\n<p>The actual measurement of the bone (residual alveolar ridge) is carried out by taking intra-oral x-rays, OPG and the CBCT. While the x-ray and OPG gives us a two dimensional view, the CBCT affords a 3D view for better bone mapping and evaluation. CBCT allows the image to be manipulated in a number of ways to ascertain the bone availability and the presence of various other anatomical structures like the nerve bundle, blood vessels and the extent of sinus. However, it is the Implantologist’s decision, whether to send a patient for CBCT or not as in CBCT, the radiation dosage to the patient is massive. In straight forward and simple cases, CBCT is not an absolute must for treatment planning.<\/p>\n<p>Before Implants are placed, there is a need for definitive evaluation of the patient as a whole, only then we can have expected results. The evaluation takes into account not only the oral structures but the general health of the patient including taking stock of the patients’ age and other diseases. The implant process involves two procedures; the surgical and the prosthesis placement. Both need highly developed skill sets and competency level of the specialist. One has to be right the first time as there is no second chance. Failure of an implant leads to further bone loss and delays the treatment by months. The selection of the specialist has to be based upon his skills as this modality needs experience in multi specialties and one should never go for the cheapest options. It is worth spending money on a competent specialist and for a good implant system with proven certifications and configurations thereby increasing the chances of success. Immense information is available on web regarding the implant companies and the specifications and one must be satisfied with the product which will be used in their mouth. Implants from US and Europe are more expensive than the Israeli or Korean and are definitely worth the extra money. The treatment plan may change after the CBCT or during the surgical process depending upon the bone encountered or the presence of certain important structures. Implant placement has to be correct the first time, as the failure of Implant also results in further bone loss and the second surgery becomes more challenging.<\/p>\n<p>Another difficult area for Implant placement is when multiple posterior teeth are missing in upper jaw. The upper jaw houses maxillary sinus which is a hollow area and the bone quantity and quality is always a challenge adjacent to this. In such cases, the Bone augmentation or building up requires one stage or two stage procedure called ‘Sinus Lift’. One stage involves a surgical procedure where sinus is approached through the oral cavity and sinus membrane is lifted with bone and implant simultaneously placed. However, the two stage procedure involves implant placement after a gap of 3-6 months before the bone gets settled to afford better union for subsequent implant placement. This procedure has kindled hope and opened new opportunities for giving implants to many where otherwise implants were not indicated.<\/p>\n<p>Dental Implants require great home care and maintenance for a long term success. An implant in the knee joint or hip is not open to the infection as it’s placed inside body whereas a dental implant in mouth is subjected to constant presence of food debris and plaque, ideal for growth of bacteria which needs dedicated maintenance regime to ensure that implants stay forever. Six monthly evaluation by the dentist using simple x-rays is a must to monitor the bone health so that corrective action can be taken early.<\/p>\n<p>It is safe to say here that in expert hands there is no reason for someone not to be able to have dental implants. So if you have lost your teeth, you are a candidate for Implants, however they are not indicated in diseases where a person has compromised immune system, bone disease, vulvular heart disease, cardiac insufficiency or any other major systemic disease including mental disorders. People with uncontrolled gum diseases and infections would require to be fully treated to reduce the probability of implant being rejected by body. Heavy smokers and alcoholics will have to stop smoking\/drinking for a period of several weeks before and after the implant surgery to improve the success rate.<\/p>\n<p>Implants help a person keep his teeth in the mouth and not in a cup. They are the most viable options for better esthetics, speech and function. Broadly speaking, <a href=\"https:\/\/clovedental.in\/blog\/dental-implants-good-natural-teeth\/\">implants look, feel and function in a similar manner as natural teeth,<\/a> however, the important difference is in the way they attach to the surrounding tissues, response to dental disease and their upkeep. (Author is available to answer all queries on email &#8211; vimal.arora@clovedental.in)<\/p>\n<p>By:-<br \/>\nLt. Gen. (Dr) Vimal Arora; PVSM, AVSM, VSM &amp; Bar (Retd.)<br \/>\nBDS, MDS (Prosthodontist &amp; Implantologist), FDS, RCPS (UK)<br \/>\nChief Clinical Officer, Clove Dental<br \/>\nFormer Director General Dental Services, Indian Army Dental Corps<br \/>\nEx-Member, Dental Council of India<br \/>\nFormer Honorary Dental Surgeon to the President of India<\/p>\n","protected":false},"excerpt":{"rendered":"<p>After evaluating and treating thousands of cases who are looking for Implants to replace their missing teeth; I would like to say that most of the patients who were told some time back that you have poor or insufficient bone and are not fit for Dental Implants, can be undertaken for the rehabilitation with Implants &hellip; <a href=\"https:\/\/clovedental.in\/blog\/can-anyone-get-dental-implants\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Can Anyone Get Dental Implants?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":3615,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3604"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=3604"}],"version-history":[{"count":6,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3604\/revisions"}],"predecessor-version":[{"id":13570,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/3604\/revisions\/13570"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/3615"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=3604"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=3604"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=3604"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}