{"id":4131,"date":"2017-08-17T14:17:12","date_gmt":"2017-08-17T08:47:12","guid":{"rendered":"http:\/\/clovedental.in\/?p=4131"},"modified":"2021-02-24T11:28:43","modified_gmt":"2021-02-24T05:58:43","slug":"whiter-teeth-lets-know","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/whiter-teeth-lets-know\/","title":{"rendered":"WHITER TEETH? LET’S KNOW ABOUT IT…."},"content":{"rendered":"<p>“The best part of Dentistry is the new and confident smile we deliver to our patients”<\/p>\n<p>Who doesn’t want brighter, whiter teeth to look attractive smart and flash that ‘million-dollar smile’. But let’s face it, most of us have yellow teeth. No matter how hard we try brushing to get that smile, which can win a million hearts, it doesn’t happen. Sparkling teeth boost one’s confidence and self-esteem and making a person to leave a mark in society. Yellower teeth make a person shy who will not smile fully and usually puts a hand in front of their mouth while smiling. With advancements in teeth whitening and introduction of other alternatives like ceramics, nobody needs to suffer in silence?<\/p>\n<h3>What causes tooth discoloration?<\/h3>\n<p>Even if a person is not ingesting tobacco, many daily products such as tea and coffee cause staining. As age advances, stains become deeper and harder to remove just by scaling. With age, the outer layer called Enamel wears out exposing the inner layer Dentin which can easily take up colour of various spices we Indians are fond of! Major spice such as turmeric can stain teeth yellow and if there are fillings in front teeth they become very conspicuous. Apart from that many herbal products, medicinal mouthwashes such as Chlorhexidine if used for prolonged time also cause staining.<\/p>\n<h3>Effectiveness of teeth whitening<\/h3>\n<p>To have a sparkling attractive white smile to boost one’s confidence, teeth whitening (or bleaching as it is commonly known as) preceded by scaling and polishing may sound like a good idea. An important factor to discuss is whether teeth whitening is meant for you or not? Where is, the teeth whitening effective and where is it least effective? There is a continuous generative and degenerative process taking place in the body to which teeth are no exception. But with age, this process of degeneration gets enhanced and tooth structure wears off faster and its natural white shade is lost. Once that happens the whitening\/bleaching agents may hardly affect the shade of tooth at all.<\/p>\n<h3>Consulting your dentist for teeth whitening (WHEN?)<\/h3>\n<p>Most importantly you must consult your dentist before making assumptions about teeth whitening. On your dental visit, it is important for you to understand the treatment process and ask all the relevant questions such as – Will it be effective for my teeth? How effective is the procedure and how many shade lighter teeth will become? How long will it last? What type of whitening agents are you using and if there are better agents with better results available in the market? What are side effects of teeth whitening, etc. Being ready with all your doubts and putting them forward is as important as anything and helps us everywhere in life. So, don’t hesitate to ask even the silliest question to your dentist before going for the procedure.<\/p>\n<p>Also read: <a href=\"https:\/\/clovedental.in\/your-teeth\/oral-health-care-starts-early-never-stops\/\">10 Simple Dental Health Tips to Maintain Oral Hygiene<\/a><\/p>\n<h3>Teeth Whitening procedure (HOW?)<\/h3>\n<p>There are two main types of procedures that can be done:<\/p>\n<p>1) In-office bleaching<\/p>\n<p>2) Home bleaching<\/p>\n<h4>In-office bleaching<\/h4>\n<p>As evident from the name itself, in-office bleaching is teeth whitening procedure that’s done in the dental office. The whole procedure is done by the dentist under carefully monitored conditions to ensure safe use of bleaching agent to get the results that are visible immediately. After a thorough scaling of teeth, the dentist applies separating medium on the gums to prevent them from bleaching agent and afterwards the bleaching agent is applied on the teeth. The process is repeated several times till desired shade is achieved using either the bleaching light or heat or lasers.<\/p>\n<h4>Home bleaching<\/h4>\n<p>Home bleaching can be performed by sitting at your home. After a thorough scaling and polishing, the doctor fabricates customized trays to fit your teeth to load the bleaching material on affected site. The first session of bleaching is done by doctor at the clinic and the patient is explained the procedure which can be easily carried out at home. After the number of times you have been asked to repeat the procedure, you get the visible results.<\/p>\n<h3>Latest Advances in Teeth whitening<\/h3>\n<p>As the technology advances, so does the procedures in dentistry. The latest advance in teeth whitening, as you might have heard is LASER whitening. The effects are quicker and better than old trends in <a href=\"https:\/\/clovedental.in\/specialties\/teeth-whitening\/\">teeth whitening<\/a>. Let’s seek help to flash our smile confidently because ‘Smile is the Curve that Sets Everything Straight in Life.’<\/p>\n<p>By – Dr. Sheikh Mohsin Javaid<br \/>\nPatient Engagement Manager,<br \/>\nDental Health-line Centre, <a href=\"http:\/\/clovedental.in\">Clove Dental<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>“The best part of Dentistry is the new and confident smile we deliver to our patients” Who doesn’t want brighter, whiter teeth to look attractive smart and flash that ‘million-dollar smile’. But let’s face it, most of us have yellow teeth. No matter how hard we try brushing to get that smile, which can win &hellip; <a href=\"https:\/\/clovedental.in\/blog\/whiter-teeth-lets-know\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">WHITER TEETH? LET’S KNOW ABOUT IT….<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4132,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4131"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4131"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4131\/revisions"}],"predecessor-version":[{"id":13571,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4131\/revisions\/13571"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4132"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4131"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4131"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4131"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}