{"id":4134,"date":"2017-08-17T14:24:06","date_gmt":"2017-08-17T08:54:06","guid":{"rendered":"http:\/\/clovedental.in\/?p=4134"},"modified":"2022-02-15T05:06:26","modified_gmt":"2022-02-14T23:36:26","slug":"oral-health-care-starts-early-never-stops","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/oral-health-care-starts-early-never-stops\/","title":{"rendered":"Oral Health Care Starts Early And Never Stops"},"content":{"rendered":"<p>What is Good Oral Hygiene? Good oral hygiene results in a mouth that looks and smells healthy. This means, your teeth are clean and free of debris, Gums are pink and do not hurt or bleed when you brush or floss and bad breath is not a constant problem.<\/p>\n<p>Oral health is often neglected compared to overall health of an individual. We go to the gym regularly to keep our muscles toned, but forget to regularly brush at night to keep the germs away. Maintaining good oral hygiene is one of the most important things you can do not just for your teeth and gums but also for overall well-being. Healthy teeth not only enable you to look and feel good, they make it possible to eat and speak properly and ultimately boost your confidence.<\/p>\n<p>Daily preventive care, including proper brushing and flossing, will help stop problems before they develop and is much less painful, expensive, and worrisome than treating conditions that have been allowed to progress. Between regular visits to the dentist, there are simple steps that each of us can take to greatly decrease the risk of developing tooth decay, gum disease and other dental problems.<\/p>\n<h4>These include:<\/h4>\n<ul>\n<li>Brushing thoroughly twice a day and flossing at least one a day,<\/li>\n<li>limiting snacks between meals and especially sticky foods like gums and chocolates,<\/li>\n<li>using a toothpaste which has optimal fluoride content along with some antimicrobial properties and<\/li>\n<li>rinsing with a mouthwash in exactly the way your dentist has explained to you.<\/li>\n<\/ul>\n<h3>Selecting the Right Toothbrush<\/h3>\n<p>While selecting a tooth brush, choose one with soft or medium bristles. Hard bristled toothbrush, when used over long periods, can abrade your teeth and can be a reason for sensitivity. Instead of the toothbrush or the toothpaste, it is the correct technique which plays a bigger role in maintaining the oral hygiene. Starting on the inside (tongue side) of the teeth, place the brush at a 45-degree angle to the tooth where the gums meet the tooth.<\/p>\n<p><strong>Source:<\/strong> thesweethome.com<\/p>\n<p>It is a common practice to use horizontal motion with high pressure while brushing your teeth, thinking that with more force, better will be the cleaning. However, it is a myth and it often leads to tooth wear. Using a small circular motion, with gentle pressure, brush each tooth individually working your way around the upper and lower teeth for a minimum of two minutes.<\/p>\n<p>Your brush should clean all surfaces of teeth, outer, inner and most importantly the chewing surface. In areas where the brush does not have enough space, such as the lower front teeth, hold the brush vertically.<\/p>\n<p>Replace your toothbrush every three or four months, or sooner if the bristles are frayed. A worn toothbrush won’t do a good job of cleaning your teeth. While selecting your toothbrush, you can choose one with a tongue cleaning surface on the back of the toothbrush. It is equally important to clean the tongue regularly since an unclean tongue is not just a source of infection in the mouth, but also a reason for bad breath.<\/p>\n<p>Automatic and electronic toothbrushes are safe and are being widely used. They are especially helpful to patients who face difficulty in manual brushing due to some underlying medical conditions. Multiple researches have been conducted in this field, but none of them have been able to point out any major difference in the effectiveness of teeth cleaning with automatic brushing over manual brushing. Hence, it is completely a personal choice.<\/p>\n<p><strong>“You are what you eat”<\/strong> is a popular saying. Well, a similar philosophy applies to the type of toothpaste you choose. What you use to brush your teeth, often reflects your dental needs. Today, a variety of toothpastes are available and it can become a bit challenging to choose the best of all. However, a toothpaste with appropriate fluoride content, abrasives and an antimicrobial agent mostly suffice. Colour and taste are purely based on individual perception.<\/p>\n<h3>Floss like a Boss!<\/h3>\n<p>Floss and inter-dental brushes prove highly effective in cleaning spaces between teeth where it is impossible to squeeze your toothbrush. Flossing, though technique sensitive, can be very effective especially in the upper and lower front teeth. During your regular dental check-up or after your teeth cleaning appointment, your Dentist can easily teach you the correct technique to floss. Dentists often teach this technique by giving a real-time demonstration while the patient observes holding a mirror in hand and later it can be practiced on a model by the patient himself.<\/p>\n<p><img loading=\"lazy\" width=\"1024\" height=\"682\" class=\"alignnone size-full wp-image-4135\" src=\"https:\/\/clovedental.in\/wp-content\/uploads\/2017\/08\/Untitled-4.jpg\" alt=\"Clove Dental\" srcset=\"https:\/\/clovedental.in\/wp-content\/uploads\/2017\/08\/Untitled-4.jpg 1024w, https:\/\/clovedental.in\/wp-content\/uploads\/2017\/08\/Untitled-4-300x200.jpg 300w, https:\/\/clovedental.in\/wp-content\/uploads\/2017\/08\/Untitled-4-768x512.jpg 768w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p><strong>Source:<\/strong> mypenndentist.org<\/p>\n<p>Most dental floss are made of either nylon or Teflon, and both are equally effective. If there are large spaces between your teeth, then you can achieve proper cleaning with a flat, wide dental floss. If your teeth are close together, you can try thin floss. Take about 15-18 inch long piece of floss and curl it from both ends on to the first finger of both your hands. Now gently slide it through the inter-dental space without injuring the gum. Now you can simply keep pulling it one by one from each finger to clean laterally or slide it up and down.<\/p>\n<p><strong>Flossing<\/strong> once a day should be enough to keep you in good oral health. These days a variety of flossing aids are available in the market such as floss holders, flossing handles, or electric or pre-threaded flossers to help master the art of flossing. Many studies have been published and researches conducted, but none could prove that these agents offer any additional benefits. It solely depends on individual preferences.<\/p>\n<p>Neglecting your dental health as you age can have serious consequences, including premature aging of the smile (gum recession, teeth discoloration or teeth loss) and the need for extensive and expensive corrective procedures. Regardless of your age, visit your dentist atleast twice each year and make time for a complete oral health care routine every day so that your smile is healthy even during the golden years of your life.<\/p>\n<p>Remember, a genuine smile comes from the heart, but a healthy smile needs good Dental Care.<\/p>\n<p>By:- Dr. Chirag Dayal<br \/>\nBDS (Lko), MBA (Hosp &amp; Healthcare)<br \/>\n<a href=\"https:\/\/clovedental.in\">Clove Dental<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Good Oral Hygiene? Good oral hygiene results in a mouth that looks and smells healthy. This means, your teeth are clean and free of debris, Gums are pink and do not hurt or bleed when you brush or floss and bad breath is not a constant problem. Oral health is often neglected compared &hellip; <a href=\"https:\/\/clovedental.in\/blog\/oral-health-care-starts-early-never-stops\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Oral Health Care Starts Early And Never Stops<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4138,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4134"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4134"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4134\/revisions"}],"predecessor-version":[{"id":14800,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4134\/revisions\/14800"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4138"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4134"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4134"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4134"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}