{"id":4198,"date":"2017-09-08T11:32:39","date_gmt":"2017-09-08T06:02:39","guid":{"rendered":"http:\/\/clovedental.in\/?p=4198"},"modified":"2022-02-15T04:49:38","modified_gmt":"2022-02-14T23:19:38","slug":"tobacco-companies-kill-best-customers","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/tobacco-companies-kill-best-customers\/","title":{"rendered":"Tobacco Companies Kill their Best Customers!"},"content":{"rendered":"<p>Tobacco is injurious to health – the gospel truth…Any form of tobacco consumption be it smoking or chewing tobacco, leads to huge health issues. There are several forms of tobacco usage like : Bidis, Cigarettes, Cigars,Smoking Tobacco &amp; chewable Tobacco, Hookahs, Kreteks, Pipes as well as Gutka, Khaini, Naswar etc.<\/p>\n<p>Tobacco contains Nicotine, which is the most potent addictive agent. Nicotine acts rapidly on the brain &amp; causes dizziness, sometimes headaches as well. Mood swings, anxiety, nervousness are all the side effects caused by the consumption of Nicotine. Have you ever wondered why some of your loved ones have this constant lingering agonizing cough which doesn&#8217;t show signs of abating..It eats into you like a termite making your “insides” hollow. The reason is a “no brainer”…this is a smoker&#8217;s cough which is the most disabling chronic lung disease leading to serious ill effects like chronic bronchitis and even asthma apart from other life threatening diseases.<\/p>\n<h3>Effects of Smoking \/Tobacco Chewing on Oral Cavity :<\/h3>\n<p>Smoking\/ tobacco hurts teeth in many ways. Cigarettes limit your mouth&#8217;s ability to fight off infection, which leaves you defenseless against the bacteria produced by smoking.<\/p>\n<h4>Tooth Discoloration:<\/h4>\n<p>Yellow or stained teeth is one of the most obvious signs that you see in a smoker. The chemicals in tobacco cling to the enamel on your teeth, causing them to stain over time.<\/p>\n<h4>Bad Breath:<\/h4>\n<p>The old saying “your breath smells like an ashtray” definitely holds true with smokers today. Cigarette particles remain in the mouth long after a cigarette is finished, which cause the breath to take on the characteristics of a cigarette.<\/p>\n<h4>Gum Disease:<\/h4>\n<p>Smokers are twice as prone to gum disease as nonsmokers. The risk increases with every cigarette you smoke, and even the gum disease treatments do not work well on smokers. Why is this? Smoking decreases your mouth&#8217;s ability to fight off bacteria, which allows it to build up on teeth and eventually make its way to the gums thus causing gum diseases.<\/p>\n<h4>Delayed Healing:<\/h4>\n<p>Not only does smoking increase your risk of procedures like extraction and Oral surgery, it also slows down your body’s ability to recover from these procedures. It also lowers the rate of successful dental implant procedures.<\/p>\n<h4>Oral Cancer:<\/h4>\n<p>The risk of developing oral cancer increases when smoking is combined with heavy drinking.Oral cancer begins as a white or red patch in the mouth accompanied by burning sensation, senstivity to chillies, difficulty in chewing or swallowing and inability to open your mouth fully. It also shows as small swellings or lumps. While there are certainly other causes for these symptoms, anyone who has these symptoms for more than two weeks should see a dentist. The earlier cancer is detected, the more effective treatment will be.<\/p>\n<h3>Effects of Smoking \/ Tobacco on the body :<\/h3>\n<p>Bones: Smoking Tobacco is one of the factors for decreased bone density which can cause osteoporosis(fragile bone). Also Smoking lowers &#8216;estrogen&#8217; level in women which may lead to early menopause in women.<\/p>\n<h4>Cardiovascular system:<\/h4>\n<p>Smoking increases heart rate &amp; blood pressure as the blood vessels become thick and narrow, making one prone to strokes, heart attacks and other heart conditions.<\/p>\n<h4>Respiratory system:<\/h4>\n<p>Cigarette smoke contains more than 7000 harmful chemicals which enter the lungs and get trapped there over a period of time thus causing respiratory infections and reduced lung function.<\/p>\n<h4>Diabetes:<\/h4>\n<p>Smoking Tobacco has an adverse effect on the Insulin, which develops a condition called as Insulin resistance, thus putting smokers at a risk of getting Type 2 Diabetes.<\/p>\n<h4>Skin:<\/h4>\n<p>The skin is the giveaway! Dull looking skin is a significant side effect of tobacco and it&#8217;s ill effects. It causes premature ageing, wrinkles and skin discoloration.<\/p>\n<h4>Reproductive system:<\/h4>\n<p>Both men and women run the risk of facing infertility problems due to smoking. Restricted blood flow can lead to erectile issues in men. Women may also experience early menopause. Hence bidding good bye to the consumption of tobacco is the “need of the hour” to build a happy, healthy &amp; tobacco free nation.<\/p>\n<p>By:- Dr. Pragya Mishra<br \/>\nBDS, MBA<br \/>\nSenior Executive-Marketing<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Tobacco is injurious to health – the gospel truth…Any form of tobacco consumption be it smoking or chewing tobacco, leads to huge health issues. There are several forms of tobacco usage like : Bidis, Cigarettes, Cigars,Smoking Tobacco &amp; chewable Tobacco, Hookahs, Kreteks, Pipes as well as Gutka, Khaini, Naswar etc. Tobacco contains Nicotine, which is &hellip; <a href=\"https:\/\/clovedental.in\/blog\/tobacco-companies-kill-best-customers\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Tobacco Companies Kill their Best Customers!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4199,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4198"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4198"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4198\/revisions"}],"predecessor-version":[{"id":14788,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4198\/revisions\/14788"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4199"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4198"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4198"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4198"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}