{"id":4202,"date":"2017-09-08T11:40:08","date_gmt":"2017-09-08T06:10:08","guid":{"rendered":"http:\/\/clovedental.in\/?p=4202"},"modified":"2018-01-17T10:55:01","modified_gmt":"2018-01-17T05:25:01","slug":"help-parents-give-child-many-sweets","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/help-parents-give-child-many-sweets\/","title":{"rendered":"Help! My Parents Give My Child Too Many Sweets!"},"content":{"rendered":"<p>Grandparents are special figures in a child&#8217;s life. But their habit of spoiling the grandkids can wreak havoc on a child&#8217;s Oral Health. Sweets and treats are rarely denied, much to the angst of the parents. Dentists often hear the complaints: “Dadi and Dada keep giving my child chocolates and biscuits, no matter what I say! What can I do???”<\/p>\n<p>Chocolates, potato chips, sweetened drinks &amp; cookies etc are a tooth&#8217;s worst enemy. When they mix with saliva, they become sticky and cling to the tooth surface. Bacteria rapidly grow in this sticky substance, and produce acid which attacks the teeth, resulting in tooth decay.<\/p>\n<p>Protecting the milk teeth from decay is much more important as compared to the permanent teeth. Milk tooth is less mineralized and more prone to decay. The decay progresses very fast and often the tooth crumbles down. Tooth decay may progress to the point that the tooth must be extracted and if this happens before the permanent tooth is ready to erupt, the teeth next to the empty space may shift into this space. This may result in the need for braces later on, which can be time-consuming and expensive. So it&#8217;s important to monitor the diets of young children as well as older kids.<\/p>\n<p>Our diets have changed substantially over the past few years. Children today eat more processed foods that are full of sugar and sodium. Previous generations never had these issues while growing up, as the food was more fibrous causing necessary scrubbing action on teeth.<\/p>\n<p>If you are a parent who worries about your child&#8217;s consumption of less-thanhealthy foods, here are a few tips:<\/p>\n<ul>\n<li>Incultate good habits in your child &amp; make sure that your child rinses after every snack\/meal.<\/li>\n<li>Assist them to learn proper brushing after every meal and use dental floss.<\/li>\n<li>As tooth decay is visible to the naked eye, examine your child&#8217;s teeth regularly to detect dental decay early.<\/li>\n<li>Take your child to the dentist right away if he complains of pain in the teeth or gums.<\/li>\n<li>Please ask your dentist questions if you are ever in doubt about your child&#8217;s dental health.<\/li>\n<\/ul>\n<p>Most importantly, take your child to the dentist regularly for a preventive treatment. Dentists can administer fluoride treatment or a sealant to provide an additional and very effective measure of protection against decay. You can&#8217;t stop your parents from giving gifts to your kids, however, it’s prudent to discuss with them that dental diseases are rampant these days and have a prevalence rate of 89%. Grandparents should be encouraged to gift illustrative creativity books, crayons and coloring pen, which will be the first step in a right direction.<\/p>\n<p>By:- Dr. Aarti Sharma Kapila<br \/>\nHead &#8211; Quality, Clove Dental<br \/>\nBDS, MDHM, FRSM<br \/>\nFellowship in Disaster Management,<br \/>\nLife Member for ISDR, IADR,<br \/>\nAward Winner of ICD.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Grandparents are special figures in a child&#8217;s life. But their habit of spoiling the grandkids can wreak havoc on a child&#8217;s Oral Health. Sweets and treats are rarely denied, much to the angst of the parents. Dentists often hear the complaints: “Dadi and Dada keep giving my child chocolates and biscuits, no matter what I &hellip; <a href=\"https:\/\/clovedental.in\/blog\/help-parents-give-child-many-sweets\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Help! My Parents Give My Child Too Many Sweets!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4203,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4202"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4202"}],"version-history":[{"count":0,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4202\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4203"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4202"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4202"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4202"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}