{"id":4213,"date":"2017-09-08T12:15:51","date_gmt":"2017-09-08T06:45:51","guid":{"rendered":"http:\/\/clovedental.in\/?p=4213"},"modified":"2022-02-15T05:04:36","modified_gmt":"2022-02-14T23:34:36","slug":"oral-health-window-overall-health","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/oral-health-window-overall-health\/","title":{"rendered":"Oral Health: A Window to Our Overall Health"},"content":{"rendered":"<p>‘Cavity..! In my mouth&#8230;? Just not possible as I brush every morning so religiously.’<\/p>\n<p>This is the often heard exclamation from most of my patients, when they have been given a thorough oral examination and their oral health is charted.<\/p>\n<p>For most of us the Oral Health seems to be synonymous and is generally recognized as the 45 seconds to 1 minute of time spent with an inch of tooth paste on a brush in the morning. We all feel that if this morning chore is done, our teeth are not going to have any disease.<\/p>\n<p>This World Oral Health Day (WOHD), let&#8217;s promote awareness and importance of oral hygiene which is one of the most neglected areas of the health. Oral cavity is considered the mirror of health and thus it not only offers clues about your health, but also helps you in preventing certain ailments. Most of the diseases have their tell-tale signs in the oral cavity much before the onset of the disease entity itself. Did you know, that &#8216;Measles&#8217; are visible in the mouth as Koplik&#8217;s Spots three to four days before the onset and the nutritional status of an individual is also visible in the mouth and the deficiencies are manifested in one way or the other.<\/p>\n<p>With more than 600 species of bacteria harboring in the mouth, it becomes one of the prime areas of concern. Our mouth is literally the first area to come in contact with bacteria. Normally the body&#8217;s natural defenses and good oral health care, such as daily brushing and flossing, can keep these bacteria under control. However, without proper oral hygiene, bacteria can reach levels that might lead to oral infections by forming dental plaque, which is a sticky, colourless film and calculus, which are the hard deposits and cling to your teeth causing dental problems, such as tooth decay and gum disease. These bacteria also travel to various parts of the body via blood and cause problems of grave concern.<\/p>\n<p>Conditions such as heart disease and diabetes are the most common in the country and dental bacteria enhance these problems, making treatment and control of disease difficult. &#8216;Inflammation&#8217; or swelling occurring in gums is one of the main things that causes damage to blood vessels, including those of the heart. It leads to hardened arteries making blood flow to your heat difficult, putting you at a greater risk for heart attack and stroke. In Diabetes mellitus, deposits of plaque and calculus can increase blood sugar, contributing to increased periods of time when the body functions with a high blood sugar, putting people with diabetes at increased risk for diabetic complications. Another problem occurring due to dental bacteria and of concern is Low birth babies, who have birth weight less than 2500g which may cause infant mortality. Though low birth babies make up of 6-7% of all births, they account for more than 70% of all infant deaths.<\/p>\n<h3>March is celebrated as the World Oral Health Month<\/h3>\n<p>Following are some key points to maintain good oral health<\/p>\n<ul>\n<li>Warm saline rinses: It is the best protection that one can give to teeth and gums. Through the process of osmosis, all the unwanted bacteria are removed. Also, rinsing is easy to follow, even when one is working.<\/li>\n<li>Brush twice daily: American Dental Association (ADA) recommends brushing twice. Brushing before sleeping is mandatory. The protection of saliva during sleep decreases and bacterial activity increases. Brushing removes lodged food and reduces bacterial content and their activity.<\/li>\n<li>Brush at least 2-3 minutes and cover all the surfaces of teeth, specially the back teeth.<\/li>\n<li>Decrease sugar intake. Sugar sticks to teeth and acts as a catalyst for bacterial growth. Instead have fibrous food, they act as natural cleansers for teeth.<\/li>\n<li>Dental cavities can be prevented by maintaining a constant low level of fluoride in the oral cavity. Fluoride can be obtained from fluoridated drinking water, salt, milk and toothpaste, as well as from professionally-applied fluoride or mouth rinse.<\/li>\n<li>Regular check up, in every 6 months.<\/li>\n<\/ul>\n<p>By:- Dr. Sagrika Shukla<br \/>\nBDS, MDS &#8211; Periodontology<br \/>\nConsultant, Clove Dental<br \/>\n<img loading=\"lazy\" width=\"496\" height=\"472\" class=\"alignnone size-full wp-image-4215\" src=\"https:\/\/clovedental.in\/wp-content\/uploads\/2017\/09\/IMG-1.jpg\" alt=\"Clove Dental\" srcset=\"https:\/\/clovedental.in\/wp-content\/uploads\/2017\/09\/IMG-1.jpg 496w, https:\/\/clovedental.in\/wp-content\/uploads\/2017\/09\/IMG-1-300x285.jpg 300w\" sizes=\"(max-width: 496px) 100vw, 496px\" \/><\/p>\n","protected":false},"excerpt":{"rendered":"<p>‘Cavity..! In my mouth&#8230;? Just not possible as I brush every morning so religiously.’ This is the often heard exclamation from most of my patients, when they have been given a thorough oral examination and their oral health is charted. For most of us the Oral Health seems to be synonymous and is generally recognized &hellip; <a href=\"https:\/\/clovedental.in\/blog\/oral-health-window-overall-health\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Oral Health: A Window to Our Overall Health<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4214,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4213"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4213"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4213\/revisions"}],"predecessor-version":[{"id":14798,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4213\/revisions\/14798"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4214"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4213"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4213"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4213"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}