{"id":4516,"date":"2017-10-10T15:51:17","date_gmt":"2017-10-10T10:21:17","guid":{"rendered":"https:\/\/clovedental.in\/?p=4516"},"modified":"2022-02-15T05:33:03","modified_gmt":"2022-02-15T00:03:03","slug":"diyas-light-home-smiles-light-life","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/diyas-light-home-smiles-light-life\/","title":{"rendered":"DIYAS&#8230;.LIGHT UP YOUR HOME!! SMILES&#8230;.LIGHT UP YOUR LIFE!!"},"content":{"rendered":"<p>The season of lights, diyas, gifts, crackers, celebrations, dance and sweets loaded with fun and masti is back! The season of loving, caring and sharing is back! The season of festivals is back!<\/p>\n<p>We are all geared-up for extravaganza around the corner taking care of every little thing from gifts to clothes to decorations to sweets.<\/p>\n<p>But are we actually ready? Are we literally taking care of everything? Okay lets do a revision, gifts – check, clothes – check, decorations – check, Smile – mmmmmmm, Oral Health – No!<\/p>\n<p>You will think what&#8217;s with the Oral Health? What connection does it have with celebrations? Your Oral Health has nothing to do with festivals. But is that so? With festivals on board and having so much on our plate, we never think about our health especially the Oral Health. We eat anything and everything we like erratically giving the excuse of festivals.<\/p>\n<p>Unfortunately continuous snacking, eating sugary food and drinking sugary beverages can make the life of your teeth miserable. Sugary food and beverages cause demineralization of the outer layer of teeth, thereby leading to cavity formation and pain. If you feel pain or senstivity after taking sweets or cold, you already have a cavity and need to see the dentist immediately. Similarly, the sweet beverage also case enamel erosion which causes hypersensitivity of the teeth.<\/p>\n<p>We have different sweets for different festivals. For example Holi is termed with gujiyas, ghevar is associated with monsoon and Diwali is a festival of ladoos, rasgulla, kaju katli, jalebi and what not. It is impossible to get rid of these sweet treats. Spare a thought for your dental health. Instead of making a beeline to dentists post festivals, its better to practice good oral hygiene while tucking into those yummy goodies.<\/p>\n<p>There are some simple steps that you can follow:<\/p>\n<p>Rinse your mouth immediately after snacking and meals. It will not allow the food particles to stick to the teeth.<br \/>\nYou can try chewing a sugar free gum. This will help to take down the sticky food.<br \/>\nInstead of sticky sweets, have milk products and dark chocolates.<br \/>\nTake sweets and desserts before the meal. This will reduce the risk of sweets staying stuck to your teeth which causes cavities.<\/p>\n<p>Have cheese after meal. This reduces the chances of developing tooth decay.<br \/>\nFor beverages, prefer having it with a straw to have minimal contact with.<br \/>\nFestivals carry a high level of stress and this leads to grinding your teeth which causes wearing of teeth and also sometimes cracks.<\/p>\n<p>Celebrations means endless gossiping, staying over and night outs. Do not forget to carry your dental kit with you while planning a stay. If the plan was immediate, then make sure you drink a lot of water and gargle before going to bed.<\/p>\n<p>Your teeth are not tools. Festivals demand gift wrapping. Make sure that you never tear tape or gift wrappers with your teeth. It may chip your teeth.<\/p>\n<p>Enjoy every moment of celebration. Just a little bit of care and protection is all that you need for the festivals to be Festivals of Joy. When it is all about celebrating, let your teeth also celebrate.<\/p>\n<p>By:- Dr. Jayna Gandhi<br \/>\nBDS, MDS (Pedodontics)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The season of lights, diyas, gifts, crackers, celebrations, dance and sweets loaded with fun and masti is back! The season of loving, caring and sharing is back! The season of festivals is back! We are all geared-up for extravaganza around the corner taking care of every little thing from gifts to clothes to decorations to &hellip; <a href=\"https:\/\/clovedental.in\/blog\/diyas-light-home-smiles-light-life\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">DIYAS&#8230;.LIGHT UP YOUR HOME!! SMILES&#8230;.LIGHT UP YOUR LIFE!!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4515,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4516"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4516"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4516\/revisions"}],"predecessor-version":[{"id":14823,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4516\/revisions\/14823"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4515"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4516"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4516"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4516"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}