{"id":4678,"date":"2017-10-31T18:02:42","date_gmt":"2017-10-31T12:32:42","guid":{"rendered":"https:\/\/clovedental.in\/?p=4678"},"modified":"2022-02-15T05:43:18","modified_gmt":"2022-02-15T00:13:18","slug":"can-dentist-help-sleep-better","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/can-dentist-help-sleep-better\/","title":{"rendered":"CAN YOUR DENTIST HELP YOU SLEEP BETTER?"},"content":{"rendered":"<p>A decent sleep! Who doesn&#8217;t love that? But do people really get to sleep properly? Do you know what is Obstructive Sleep Apnea (OSA)?<\/p>\n<p>Many people complain that they cannot sleep properly. They are turning into insomniacs or that they wake up in the middle of the night or they begin their day with a pounding headache or have trouble concentrating at work and feel fatigued early in the morning. As per a study – 93% of Indians are sleep deprived. People overlook the symptoms and blame their busy lives, irregular routine and long working hours to be the cause of these problems. But the answer to all these complains might lie in a visit to the Dentist!<\/p>\n<p>Your dentist may ask you about your sleeping pattern or behaviour on the visit which may surprise you. This is because you know your dentist as someone who is concerned only about cavities and scaling. A dentist is more than just tooth fairy and many of them are trained in sleep medicine. If the dentist has even a minute doubt, they will ask questions as to what their patients are suffering from. Your mouth, jaw and neck may have telltale signs that points to problems related to sleep.<\/p>\n<p>If someone complains about snoring, having dry mouth, jaw pain, morning headache, experiencing excessive daytime sleepiness, dozing off while driving, grinding teeth or feeling lethargic then there are chances that one is suffering from “Obstructive Sleep Apnea&#8217;. It is a sleep disorder in which a person stops breathing periodically during the night due to variety of reasons. These pauses lasts for about 10 seconds and are followed by snorts, gasps and choking sounds. OSA is characterized by disordered breathing during sleep, resulting in sleep fragmentation and a lower self-reported quality of life.<\/p>\n<p>Besides Apnea these symptoms can also lead to other consequences; for instance, grinding can cause tooth wear &amp; breakages as well as inflamed and receding gums. These issues look frivolous but are not to be neglected as they may lead to an increase in the level of carbon dioxide in our bloodstream which can cause poor health. These frivolous issues in the long run can lead to high Blood Pressure, Heart Disease, Stroke, Obesity and can shorten the life span of a person.<\/p>\n<p>Sleep Apnea can cause attention deficit, moodiness, drowsiness, headaches, fatigue, dementia, memory loss, hypertension, stroke and heart attack. In addition there are added complications to pre-existing medical problems, like increased insulin resistance, hormonal disruption, abnormal heart rythms &amp; depression.<\/p>\n<p>These symptoms need to be handled in time and require a proper treatment plan. For this a sleep study is conducted by specialists in Sleep Medicine and is best carried out at your home. If the Sleep Apnea study shows inadequacy, treatment can be instituted by the sleep specialist in conjunction with a dentist.<br \/>\nThe treatment is divided into two stages depending upon the severity of apnea which is done after performing a detailed Sleep Study. In the first stage, the Dentist may advise you to make changes in your daily routine and your lifestyle such as the switch in your sleeping position, losing weight and quitting smoking. Your dentist may also ask you to wear a dental appliance when you are asleep. An appliance is like a mouth guard, called Mandibular Advancement Device(MAD) which is worn overnight. MADs help throat muscles from collapsing back into the airway and allows for normal breathing. They do so by pushing the lower jaw and tongue slightly forward.<\/p>\n<p>Another device which is used in the treatment process is a Tongue Retainer. These are used by the patients who cannot have their jaw repositioned forward. Similar to MAD, they are slightly different in a way that they fit around the tongue using a suction concept.<\/p>\n<p>In severe stage, which require a little aggressive management such as use of Continuous Positive Airway Pressure system (CPAP) which will supply air through a small mask with a constant pressure or would suggest you a surgery. The gold standard treatment for OSA is to pneumatically splint open the upper airway during sleep using continuous positive airway pressure (CPAP). The studies have found that if a person suffer from Sleep Apnea and use a CPAP, the grinding stops completely and this also improves breathing.<\/p>\n<p>Many oral devices are available in the market but one needs to be sure that they consult a dentist before using those devices. For instance, the oral device may cure your snoring problem but might not cure the sleep apnea and may lead to other health complications down the lane. They should be custom fitted as it suits the particular need of the patient.<\/p>\n<p>The sleep disorders are not only present in adults. Children are also prone to Sleep Disordered Breathing (SDB). Apnea may affect their growth rate and development leading to consequences. Most kids tend to sleep with their mouth open which leads to the detrimental risk of cavities. The most common symptoms in children that parents complain about are snoring and difficulty in breathing during sleep. They appear to be restless at night and often change their position while sleeping so much so that sometime they sleep sitting upright on the pillow. For the disorder to be treated the dentist after a careful examination may provide a mouth guard for the children that is to be used in the night while sleeping.<\/p>\n<p>Sleep Apnea can affect anyone but there are certain factors which cause some people to be more prone to it such as:<\/p>\n<ul>\n<li>Obesity: If one has excessive weight there is four times more risk of Sleep Apnea.<\/li>\n<li>Elder People: Sleeping disorders are more common in adults who are more than 60yrs in age.<\/li>\n<li>Family History: The hereditary can also be the cause of Apnea.<\/li>\n<li>Smoking: Smoking leads to fluid retention, increasing the amount of inflammation. People who smoke have three times more chances of getting the Apnea. It can stop if the person quits smoking.<\/li>\n<li>Intake of Alcohol: Alcohol relaxes the muscle in your throat and causes the apnea.<\/li>\n<\/ul>\n<p>According to a research, nearly one-forth to one-third of the human life is spent sleeping so why risk a part of your life by neglecting the symptoms which can lead to serious health hazards. Next time you come across these symptoms or suffer from sleep disordered breathing, don&#8217;t neglect instead visit your dentist. Your dentist can guide you on the right path for a better sleep.<\/p>\n<p>By:- Lt. Gen. (Dr) Vimal Arora; PVSM, AVSM, VSM &amp; Bar (Retd.)<br \/>\nBDS, MDS (Prosthodontist &amp; Implantologist), FDS, RCPS (UK)<br \/>\nChief Clinical Officer, Clove Dental<br \/>\nFormer Director General Dental Services, Indian Army Dental Corps<br \/>\nEx-Member, Dental Council of India<br \/>\nFormer Honorary Dental Surgeon to the President of India<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A decent sleep! Who doesn&#8217;t love that? But do people really get to sleep properly? Do you know what is Obstructive Sleep Apnea (OSA)? Many people complain that they cannot sleep properly. They are turning into insomniacs or that they wake up in the middle of the night or they begin their day with a &hellip; <a href=\"https:\/\/clovedental.in\/blog\/can-dentist-help-sleep-better\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">CAN YOUR DENTIST HELP YOU SLEEP BETTER?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4677,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4678"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4678"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4678\/revisions"}],"predecessor-version":[{"id":14830,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4678\/revisions\/14830"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4677"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4678"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4678"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4678"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}