{"id":4860,"date":"2017-11-28T16:09:44","date_gmt":"2017-11-28T10:39:44","guid":{"rendered":"https:\/\/clovedental.in\/?p=4860"},"modified":"2022-02-15T05:00:38","modified_gmt":"2022-02-14T23:30:38","slug":"pierced-tongue-looks-cool-really","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/pierced-tongue-looks-cool-really\/","title":{"rendered":"PIERCED TONGUE LOOKS COOL! REALLY?"},"content":{"rendered":"<p>Baggy jeans, tattooed body, funky hairstyle, wrist band &amp; pierced tongue! The trend that started in 1990&#8217;s shows no sign of slowing down. The 90&#8217;s generation believe in expressing themselves and found body art to be the best way to do so. For them, it is a fun way to communicate. Teenagers too are not left out from this vicious circle of &#8216;what is trending&#8217;. They have a tendency to follow anything that appears &#8216;hip&#8217; and &#8216;in&#8217;. Piercing is one such craze that has gained momentum as people are madly following it.<br \/>\nGone are the days of ear and nose piercing. Boys and Girls these days, believe in carrying their attitude on their navel, eyelashes, eyebrows, lip, under nose and even on the tongue. Yes! Even your tongue can be pierced and is supported to be trending. On the top of this, people are spending a good amount of money on getting their tongue pierced. Is it worth the spend?<\/p>\n<p>“Ah! That looks cool!” said a guy pointing to the man with pierced tongue. Does it really looks cool? Is it safe? And do we know its consequences? The range of dental problems they cause?<br \/>\nTongue piercing is dangerous for your oral health. Dental professionals never endorse this. It is done by quacks under total unhygienic conditions and runs the risk of injury to some vital part; the nerve or blood vessels. It definitely causes infection as your mouth contains millions of bacteria. As per American Dental Association, the mouth and tongue may swell so much that it will be hard for you to even breathe.<\/p>\n<p>Its interesting to know that there are various types of tongue piercings, and the very famous amongst all is &#8216;stud&#8217;. They are so versatile that they can go with simple barbell piercing to multiple piercing grouped in patterns and come in different colours, materials and shapes. If these are so versatile and attractive piece of jewellery, then why is it not advised to use them?<br \/>\nThis is because it causes some serious implications such as:<\/p>\n<ul>\n<li>The tongue piercing is unnatural and the tongue is not really meant for piercing.<\/li>\n<li>While talking or eating your tongue jewellery bumps against your teeth, causing the tooth enamel to chip away.<\/li>\n<li>Tongue is one of the most sensitive part of our body and any wrong procedure can cause permanent damage.<\/li>\n<li>The tongue muscles are active whole day; while eating food, speaking, drinking or even while sleeping. The &#8216;pierce&#8217; or the &#8216;stud&#8217;, continuously moves thereby causing injury to the wound site and pumping infection in the body of the tongue.<\/li>\n<li>The pierce changes the &#8216;resting place&#8217; of the tongue thereby lifting it from its natural position and there are frequent &#8216;tongue biting&#8217;, while eating or speaking thereby increasing the risk of Oral Cancer.<\/li>\n<li>The barbell you are wearing in your tongue can rub up against the gums and cause irritation leading to gum recession.<\/li>\n<li>Your tongue helps you to make lot of sounds and enable you to speak, but tongue piercing can alter your speech permanently.<\/li>\n<li>If not clean, it can accumulate bacteria making the breath smell disgusting!<\/li>\n<li>It can increase the amount of saliva in your mouth. Having tongue piercing and leaving puddle of spit will definitely not look cool!<\/li>\n<li>Tongue jewellery can hinder the process of dental treatment by blocking the x-rays.<\/li>\n<li>Spicy and salty food and acidic beverages will cause additional harm.<\/li>\n<\/ul>\n<p>Being cool can seriously cost you a lot these days. Huh! Still if you are crazy for this fashion take certain precautions:<\/p>\n<ul>\n<li style=\"list-style-type: none\">\n<ul>\n<li>Get it done from experts under extreme aseptic conditions.<\/li>\n<li>Chose the correct location and the style that goes with it.<\/li>\n<li>Make sure that the needle is new and is never used before.<\/li>\n<li>Surgical steel, solid gold or platinum should only be used as a material for the jewellery.<\/li>\n<li>Select a smaller ball for the underside of your tongue so that it does not come in contact with the floor of the tongue.<\/li>\n<li>If taking part in any sports activity, remove the jewellery and wear the mouthguard.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p>If you already have a piercing then try and follow certain rules:<\/p>\n<ul>\n<li>Take proper care of your oral health by regular brushing, flossing and rinsing.<\/li>\n<li>Do make sure that the ends of your jewellery properly attached.<\/li>\n<li>Try not playing with the jewellery as this may result in chipping off the tooth.<\/li>\n<li>Get regular dental check-ups.<\/li>\n<\/ul>\n<p>If you are a fashion freak then you for sure will be updated as to what is &#8216;in&#8217; and would like to follow that, but following the simple rules and taking precautions, can help you shine with style.<\/p>\n<p>By:- Dr. Priyanka Mathur<br \/>\nSenior Manager<br \/>\nClinic Business Operations<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Baggy jeans, tattooed body, funky hairstyle, wrist band &amp; pierced tongue! The trend that started in 1990&#8217;s shows no sign of slowing down. The 90&#8217;s generation believe in expressing themselves and found body art to be the best way to do so. For them, it is a fun way to communicate. Teenagers too are not &hellip; <a href=\"https:\/\/clovedental.in\/blog\/pierced-tongue-looks-cool-really\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">PIERCED TONGUE LOOKS COOL! REALLY?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4862,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4860"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4860"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4860\/revisions"}],"predecessor-version":[{"id":14796,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4860\/revisions\/14796"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4862"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4860"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4860"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4860"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}