{"id":4968,"date":"2017-12-11T15:04:27","date_gmt":"2017-12-11T09:34:27","guid":{"rendered":"https:\/\/clovedental.in\/?p=4968"},"modified":"2022-02-15T05:53:14","modified_gmt":"2022-02-15T00:23:14","slug":"adults-thumbsucking","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/adults-thumbsucking\/","title":{"rendered":"ADULTS AND THUMBSUCKING??"},"content":{"rendered":"<p>Last week while traveling in a metro, something unusual happened and grabbed my attention. I spotted a lady in her late 30&#8217;s reading a book and sucking her thumb. That scene was quite uncommon as I have always noticed kids with such habits. I had read about the thumb sucking habits in adults, but had never seen. After few minutes, we had eye contact and she got conscious and she stopped sucking her thumb, and was clearly uneasy about it. It seemed that she was suddenly awakened. I realized that these habits if not taken care of in time can become addiction.<\/p>\n<p>Later researching this matter, I found that this habit is not uncommon as I thought it to be. Around 1 in 10 adults are inclined towards this habit. 12 percent of adults continue this childhood habit into adulthood and it is most likely found in women than men. Infact the number of women is double than men. The celebrities too are not spared. As per a photograph issued in the UK magazine last year, the international music icon Rihanna have been spotted doing it and also an Indie movie Thumbsucker was made on it. It was a real story of the renowned American novelist &#8216;Walter Kirn&#8217; and how he stopped indulging in this habit in late 40&#8217;s.<\/p>\n<p>Adults usually do this in private rather than public. But, if they are tensed or concentrating, their thumb automatically reach their mouth. Some find it to be comforting and relaxing and they do this mostly while concentrating or when stressed.<\/p>\n<p>Let&#8217;s understand that this habit affects the teeth, jaws and the face. The pressure generated while sucking the thumb has deleterious effects and it causes the front teeth to jut out, the jaw remains narrow, the palate very high and the lower teeth also flare up. Person gets a bird-like face and the whole personality gets marred. This also causes mouth breathing thereby aggravating dryness in the mouth which makes gums very prone to gum disease. Also the fact that the thumb is dirty causes many other problems like gastro-intestinal infections and frequent oral ulcers and throat infections. Further, it becomes difficult to clean the teeth and the mouth generally smells bad which further affects the personality.<\/p>\n<p>If someone wants to undergo a cosmetic surgery then the dental issues are to be addressed first. As the entire cosmetic procedure will go in vain if the cause is not treated. And in the current era, the physical appearance matters a lot. Many people see this as means to an unsuccessful career and moreover its embarrassing getting noticed doing such things in public. This creates a negative or childish image of the person at work.<\/p>\n<p>To overcome this habit, one requires will power. People should be mentally prepared to end the habit. People who are self-conscious will surely end it. In extreme cases they are required to visit a dentist. Dentist will suggest the best way as to how to overcome it. They may provide certain devices such as:<\/p>\n<ul>\n<li>Hay Rake – These have projections in the middle and are placed just behind the front teeth thus, creating a situation of discomfort when someone inserts the thumb inside the mouth.<\/li>\n<li>Palatal Crib – These are similar to Hay Rake in a way that they too are inserted in the back of upper teeth but instead of projections they have metal rings and bars.<\/li>\n<li>Bluegrass – These can also be used and contain beads or roller which can be rotated with the tongue. This is used to rotate the tongue instead of sucking the thumb.<\/li>\n<\/ul>\n<p>These treatments can be used for kids as well as adults. In cases, where such treatment do not work, then hypnotherapy is recommended.<\/p>\n<p>If one doesn&#8217;t want to undergo such treatment then there are certain natural ways to end this. Record can be made as to when one start doing this, as in do you do this while stressed or when bored or while relaxing. Keeping a record of such events can help to end it. One can also get over such habits by simply chewing or having something in your mouth such as a candy, mints or gum. Also keeping your hands busy too can help. Carry stress balls in your pocket or pick up any habit that involves the use of both hands. Use of nail paint is a good idea too as people deter to the taste of nail paint.<\/p>\n<p>This habit does not lead to any serious health hazard but can make a person self-conscious. Do not let this habit make you famous for wrong reasons. If your child has this habit of thumbsucking make sure it ends by the age of 3 or 4. Because if this continues it can turn into an addiction which is hard to get rid off. In fact it looks unsophisticated if someone who is 30 year of age gets his\/her thumb in the mouth at public or even when he is at home relaxing in his\/her payjamas at night. Children are the best observers and so they notice everything their parents do. So next time you have an urge for it, think twice as to who all are you giving motivation to indulge in such habit. Not so rare to be a habit that it is found both in adults and kids.<\/p>\n<p>By:- Ms. Nishi Saini<br \/>\nVice President<br \/>\nHR and Talent Development<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Last week while traveling in a metro, something unusual happened and grabbed my attention. I spotted a lady in her late 30&#8217;s reading a book and sucking her thumb. That scene was quite uncommon as I have always noticed kids with such habits. I had read about the thumb sucking habits in adults, but had &hellip; <a href=\"https:\/\/clovedental.in\/blog\/adults-thumbsucking\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">ADULTS AND THUMBSUCKING??<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":4970,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4968"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=4968"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4968\/revisions"}],"predecessor-version":[{"id":14836,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/4968\/revisions\/14836"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/4970"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=4968"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=4968"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=4968"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}