{"id":5059,"date":"2017-12-19T12:40:28","date_gmt":"2017-12-19T07:10:28","guid":{"rendered":"https:\/\/clovedental.in\/?p=5059"},"modified":"2022-02-15T05:00:09","modified_gmt":"2022-02-14T23:30:09","slug":"protect-teeth-winters","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/protect-teeth-winters\/","title":{"rendered":"HOW TO PROTECT TEETH DURING WINTERS?"},"content":{"rendered":"<p><strong>How to protect teeth during winters:<\/strong><\/p>\n<p>The mouth is mirror of the body and thus it becomes mandatory to take care of our teeth always. But in winters just like our rest of the body needs extra tender care, so does our teeth. So here is how to take care of our teeth during winters.<\/p>\n<ul>\n<li>Brushing teeth is brilliant but not for too long. American Dental Association recommends to brush for not more than 2-3 minutes. Over zealous tooth brushing can abrade enamel causing sensitivity.<\/li>\n<li>Yes we all are a little more hungry in winters, but say yes to hot beverages rather than acidic carbonated drinks which can again erode the outer enamel layer and cause sensitivity.<\/li>\n<li>Another reason to avoid acidic food stuff is Canker Sores, which might be the result of indulging in your favorite winter treats. Food stuff high in acid can be a causative agent (Mayo Clinic, USA)so if you&#8217;ve been sipping on cider or noshing on spicy treats during the holidays, canker sores can actually set in and ruin your fun. If you&#8217;re already suffering, try swishing a mixture of one teaspoon of salt and a half-cup of water to help clean the sores for faster healing. Alcohol-free solutions such as Colgate® Peroxyl® Mouth Sore Rinse can also be used to relieve pain.<\/li>\n<li>In winters one more thing to take care is to cut down on the sugar intake. Though winters is all about &#8216;Gajak and Till-Ke-Ladoo&#8217;, they are stick food and since there is less amount of water\/fluid intake during winters, such food stuff have a higher chances of causing cavities.<\/li>\n<li>If anyone is already suffering from sensitivity then breathe through nose and not through the mouth so that teeth are kept protected and cold air does not aggravates the problems of sensitivity.<\/li>\n<li>Use fluoride toothpaste or toothpastes which are plain and do not have granules as they might abrade teeth causing sensitivity.<\/li>\n<li>Exposure to the harsh winter sun can also cause cold sore breakouts (University Health Services of the University of Wisconsin-Madison). Spending time outside during the winter can definitely exacerbate cold sores at the worst time possible. To avoid cold sores, ensure that the skin around your mouth is protected. Try to keep the mouth covered when playing in cold windy weather and keep the corners of the mouth clean to avoid bacterial growth. Also, keep your stress levels low and cuddle up in your blanket to have a good sleep.<\/li>\n<li>Do not clench you teeth if your feeling cold, make sure you are wearing proper warm clothes to keep yourself warm.<\/li>\n<li>Do not bite on anything very cold, as in winters there is a high chance of frost bite, which commonly happens while biting on an ice-cream during winters.<\/li>\n<\/ul>\n<p>Winters are just as fun as any other season of the year and to enjoy it more with your Christmas tree and santa along with a snow man make sure you are steeping good care of your teeth to eat all the goodies during the festive season.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How to protect teeth during winters: The mouth is mirror of the body and thus it becomes mandatory to take care of our teeth always. But in winters just like our rest of the body needs extra tender care, so does our teeth. So here is how to take care of our teeth during winters. &hellip; <a href=\"https:\/\/clovedental.in\/blog\/protect-teeth-winters\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">HOW TO PROTECT TEETH DURING WINTERS?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":5060,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5059"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=5059"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5059\/revisions"}],"predecessor-version":[{"id":14795,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5059\/revisions\/14795"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/5060"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=5059"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=5059"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=5059"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}