{"id":5427,"date":"2018-02-08T18:20:14","date_gmt":"2018-02-08T12:50:14","guid":{"rendered":"https:\/\/clovedental.in\/?p=5427"},"modified":"2022-02-15T05:29:45","modified_gmt":"2022-02-14T23:59:45","slug":"every-tooth-athletes-head-precious-diamond","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/every-tooth-athletes-head-precious-diamond\/","title":{"rendered":"EVERY TOOTH IN AN ATHLETE&#8217;S HEAD IS AS PRECIOUS AS DIAMOND!!"},"content":{"rendered":"<p>“India takes the Gold for wrestling in Olympics. A proud moment for India and Arjun Yadav. Arjun proudly carrying the Indian National Flag with tears in his eyes” – The commentator announced.<br \/>\nWith this, the alarm rung and Arjun had to wake up.<\/p>\n<p>Arjun had always dreamt about winning a Gold for India. And for this he is undergoing a lot of training and practice. His coach is making him practice weight training, strength training, skill drill. Apart from this he is making him follow a balanced diet including proper amount of protein, carbohydrate and fats.<\/p>\n<p>His coach ensures that he hits the gym, is following a proper diet and is visiting a dentist on a regular basis. Dentist?<br \/>\nWrestling and dentist? What&#8217;s the connection? To win a game they do not need a dentist but a dietician. But don&#8217;t you think oral health is equally important as physical health?<br \/>\nBeing fit is not only important in wrestling but in every sport or activity. So how do you think these sportsmen are working to be fit? Regular practice! Yes. A proper diet! Agreed. Comprehensive training! A must. Visit to a dentist!<\/p>\n<p>Along with other fitness regime it is advised to visit a dentist because it would be a shame to miss a match because you are sitting on a dentist&#8217;s chair undergoing a treatment.<\/p>\n<p>A visit to dentist though might not help you to win but not visiting one can make you lose. According to a press release from University College London, many of the elite sportsperson competing in London Olympics 2012 had poor oral health. A survey was conducted and it was found that 18% had a negative impact on their performance due to poor oral health and around 46.5% had not been to a dentist in the past year.<\/p>\n<p>This is because their fitness programme includes consulting their physician and physiotherapist but not a dentist. As a result, it was found that 55 percent of athletes suffered from tooth decay.<\/p>\n<p>The reason of increased rate of erosion is directed to consumption of sports products, including sports drink, intra-workout supplements and carbohydrate gels or sports lollies. Though saliva neutralises acid and provides calcium and phosphate to remineralize tooth enamel, yet these sports products are sources of sugar that adhere to teeth more than saliva and produce additional acid which increases the risk of dental decay. They weaken enamel, dentine &amp; bring the pH to less than 5.5. Amongst these, the pH of sports drink is 2.4 – 4.5 and that of sports gel is between 3.5 – 4.2, this is because these gels often include preservatives which is responsible for bringing down the pH level.<\/p>\n<p>Another reason for decay is dehydration. When the mouth is dry, it reduces the salivary flow increasing the potential for tooth erosion. This is a common issue for most athletes.<\/p>\n<p>For low intensity sports such as volleyball, baseball, tennis, biking etc. one can switch to tap water for hydration instead of consuming glucose all the time. They can consume adequate amount of carbohydrates which they can get from food items such as banana, because banana has comparatively lesser amount of sugar.<\/p>\n<p>And for high intensity sports like cycling &amp; wrestling, athletes require more of physical work and for this they can have food rich in calcium and phosphate like milk, cheese and yoghurt as these help to remineralize the tooth surface. For better results one can also have bi-carbonate and calcium added to sports drink to reduce the potential of tooth getting eroded but it can affect the taste and palatability.<\/p>\n<p>It’s not just about the low and high intensity, the sportsperson or athletes collectively need to take certain precautions so that their oral health is not affected and it is not a hindrance to the way they perform. Follow these basic steps to make sure you do not face any dental problem:<\/p>\n<ul>\n<li>If the sports drink is to be made by powder make sure that the amount of water is not less than mentioned and use cold water rather than warm or water with normal temperature.<\/li>\n<li>If feeling dehydrated, hydrate yourself by drinking water rather than sports supplements.<\/li>\n<li>Make sure brushing, rinsing and flossing is included in the list of your regular practice regime.<\/li>\n<li>While consuming sports beverage make sure that it is gobbled with straw and it is not swashed.<\/li>\n<li>If you think brushing your teeth just after ingesting the high energy drink makes your teeth less prone to enamel, then it is totally a myth. It is advised not to brush up till 60 min after the process as the teeth should be left to re-harden to make it fit for brushing.<\/li>\n<\/ul>\n<p>Sure that the sportsmen take various precautions when in ring or on field but the question is do they do the needful for their teeth as well? They should include mouthguard in the protective gears they use.<\/p>\n<p>Mouthguards protect your upper teeth and your lips, tongue, face and jaw against injuries. But mouthguard should be the one which is designed by your dentist, as they need proper fitting. Constitute it in your uniform and make it a habit to wear it whenever you get ready for the match.<\/p>\n<p>Yet if you think as to why oral health if damaged can harm your performance then here is the answer to it:<br \/>\n“As per a study published in the British Journal of Sports and Medicine, one-fifth of the athletes said that there oral health damaged their training and performance for the game.”<\/p>\n<p>The oral hygiene could be linked with the performance as if the sportsmen have a tooth pain there are chances that it can disrupt sleep and training and also the inflammation gum can could effect the rest of the body as the receded gums have some serious consequences to the other body parts. In fact some oral diseases or inflammation are also linked with type 2 diabetes and heart problems.<\/p>\n<p>A little time on oral care is no harm. The simple strategies mentioned above if adopted in the daily routine of a sportsmen can make crucial difference between Gold and Silver.<\/p>\n<p>By:-<br \/>\nDr. Akshay Nambiar<br \/>\nBDS<br \/>\nCentre Head, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>“India takes the Gold for wrestling in Olympics. A proud moment for India and Arjun Yadav. Arjun proudly carrying the Indian National Flag with tears in his eyes” – The commentator announced. With this, the alarm rung and Arjun had to wake up. Arjun had always dreamt about winning a Gold for India. And for &hellip; <a href=\"https:\/\/clovedental.in\/blog\/every-tooth-athletes-head-precious-diamond\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">EVERY TOOTH IN AN ATHLETE&#8217;S HEAD IS AS PRECIOUS AS DIAMOND!!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":5428,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5427"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=5427"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5427\/revisions"}],"predecessor-version":[{"id":14820,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5427\/revisions\/14820"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/5428"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=5427"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=5427"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=5427"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}