{"id":5458,"date":"2018-02-13T12:23:41","date_gmt":"2018-02-13T06:53:41","guid":{"rendered":"https:\/\/clovedental.in\/?p=5458"},"modified":"2022-02-15T05:50:02","modified_gmt":"2022-02-15T00:20:02","slug":"believe-healthy-kissing","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/believe-healthy-kissing\/","title":{"rendered":"AND&#8230;DO YOU BELIEVE IN HEALTHY KISSING?"},"content":{"rendered":"<p>Kissing burn calories! A fact that is known to all. But is kissing just about burning calories? Isn&#8217;t it an emotion or way of expressing our love for someone.<br \/>\nA kiss expresses sentiments such as love, romance, passion, greeting and friendship. It is a beautiful emotion experienced.<\/p>\n<p>Remember your first kiss? Ah! A stupid question because who doesn&#8217;t? Some may say it was &#8216;Perfect&#8217;, some would say it was &#8216;Magic&#8217; some will be lost in thoughts as to how wonderful it was. It is a memory that stays with a person forever.<br \/>\nBut are we aware that kissing can affect our oral health?<br \/>\nCertainly not. Because when you are in that moment, you for sure are not thinking about it&#8217;s implications on Oral Health.<\/p>\n<p>It&#8217;s good to express your love but at the same time it is important to be cautious about its affects. It can have both positive and negative implications.<br \/>\nKissing is good for your Oral Health. Yes, you heard it right. It has some healthy dental implications.<\/p>\n<ul>\n<li>Good for Teeth – Kissing involves exchange of many healthy bacteria. The saliva flow uses the self-cleansing mechanism to wash away food and other particles from surface of our teeth. Moreover the saliva contains mineral ions which protects teeth from dental decay and neutralizes acids. Oooooohhhh! Good.<\/li>\n<li>Fewer Cavities – More saliva is produced by salivary gland during a kiss which fights off bacteria, viruses and fungus. It leads to less tooth erosion as a result your dentist will find less cavities in your mouth. Interesting!<\/li>\n<li>Protects tooth enamel – A passionate kissing rebuilds the minerals in your tooth enamel as the saliva contains mineral salts which protects your teeth from erosion and cavities.<\/li>\n<li>Healthier cheeks and gums – Increased flow of saliva can do wonders for your oral health. It helps your cheeks and gums to heal quickly than skin. This is because it contains proteins like vascular endothelial which trigger the formation of blood vessels and that boosts the healing process of your mouth. Is that so?<\/li>\n<li>Better immune system – A quick 10 second kiss can transfer as many as 80 million bacteria to your partner which boosts your immune system keeping you fit and healthy.<\/li>\n<li>Other health benefit – Kissing releases hormone called Endorphins which burns calories, help exercise facial muscles and releases tension.<\/li>\n<\/ul>\n<p>Woah! This is really healthy. One might think that they should kiss more often. But wait and think about the question that was asked in the beginning. “Remember your first kiss?” Now imagine, your first kiss, you felt really good but later you complaint about infection. You probably never thought that the infection was result of kissing.<\/p>\n<p>Kissing can also be hazardous. Amazed! We thought that there are only benefits attached to it and so were happy. But it has some serious implications attached:<\/p>\n<ul>\n<li>Herpes from kissing – The saliva which had many healthy connotations can also be the reason of spreading viruses. It spreads Herpes infection virus which results in cold sores or blisters on the lips, around your mouth or even inside your mouth. The concerned part is, that there is no cure.<\/li>\n<li>Develops gum disease – If transferring 80 million bacteria boosts your immune system, then the same bacterias can be the cause of periodontitis. Yes it is true. If your partner is suffering from gum disease there are chances that you too get affected by it.<\/li>\n<li>Causes destructive diseases – Saliva can also carry destructive diseases with it which causes bacteria and viruses to easily spread through mouth, palate and throat while kissing.<\/li>\n<li>Virus Spread – There are many viruses that can be spread by kissing such as common cold, hepatitis B, flu, viral meningitis, upper respiratory infections etc.<\/li>\n<\/ul>\n<p>Confused? Yes that&#8217;s quite obvious. One might think, whether they should kiss or not. Don&#8217;t worry just a few precautions and you are all fit for kissing. Infact one might not even get affected by any of the above implications if he or she follows some simple steps.<\/p>\n<ul>\n<li>Do not kiss when you or your partner is sick.<\/li>\n<li>Know a little about your partner&#8217;s oral health.<\/li>\n<li>Try and maintain a good oral hygiene, brush twice a day, floss and rinse your mouth regularly.<\/li>\n<li>Do not kiss when your partner or you have cold sores or ulcers on your lips.<\/li>\n<li>Keep your mouth rinsed by drinking plenty of water to increase the flow of saliva.<\/li>\n<li>Try chewing xylitol gum as it prevents bacteria from sticking to your teeth.<\/li>\n<li>Visit your dentist regularly for a complete dental check-up.<\/li>\n<\/ul>\n<p>Always practice safe kissing and maintain a good oral hygiene.<br \/>\nEven celebrities know the importance of safe kissing.<br \/>\nThis is what Vivica. A. Fox who won the best kiss honor at MTV Movie Awards when interviewed by Dean Doctor magazine had to say about Oral Health being important for kissing:<br \/>\n“Ooohh yes yes honey. Cause baby, if you kiss somebody with a dragon mouth, my God its the worst experience even as an actor to try to act like you enjoy it. I visit dentist every three months and get my teeth cleaned, I floss, I brush. I am into dental hygiene for sure.”<\/p>\n<p>So guys and girls keep one thing clear, dental hygiene is important and when it is about kissing, Ah! It cannot be avoided.<br \/>\nJust be sure about your dental habits and your loved one will thank you for it!<\/p>\n<p>By:-<br \/>\nDr. Sunil Motwani<br \/>\nBDS, Post Graduate Diploma in Hospital Administration<br \/>\nZonal Clinical Head &#8211; North Delhi<br \/>\nClove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Kissing burn calories! A fact that is known to all. But is kissing just about burning calories? Isn&#8217;t it an emotion or way of expressing our love for someone. A kiss expresses sentiments such as love, romance, passion, greeting and friendship. It is a beautiful emotion experienced. Remember your first kiss? Ah! A stupid question &hellip; <a href=\"https:\/\/clovedental.in\/blog\/believe-healthy-kissing\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">AND&#8230;DO YOU BELIEVE IN HEALTHY KISSING?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":5459,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5458"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=5458"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5458\/revisions"}],"predecessor-version":[{"id":14833,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/5458\/revisions\/14833"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/5459"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=5458"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=5458"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=5458"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}