{"id":6323,"date":"2018-05-31T10:01:34","date_gmt":"2018-05-31T04:31:34","guid":{"rendered":"https:\/\/clovedental.in\/?p=6323"},"modified":"2022-02-15T05:02:42","modified_gmt":"2022-02-14T23:32:42","slug":"oral-hygiene-ramadan","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/oral-hygiene-ramadan\/","title":{"rendered":"ORAL HYGIENE IN RAMADAN"},"content":{"rendered":"<p>Ramadan is a holy month of fasting. The long fasting hours from ‘Suhoor’ to ‘Iftaar’ demands special care and the most neglected amongst all is the Oral Health. Not eating and drinking anything for a long time causes dehydration which builds the bacteria in the mouth which are responsible for foul breath.<\/p>\n<p>Here are a few simple tips by<strong> Dr. Shazia Farooq, Dental Surgeon at Clove Dental<\/strong> to avoid bad breath and maintain good oral health:<\/p>\n<ol>\n<li><strong>1.<\/strong> Brush after ‘iftaar’ and ‘suhoor’. Use fluoridated toothpaste as it prevents cavity formation and gives strengthens teeth. Use tongue cleaner to get rid of white coating on the tongue as it is the primary reason behind bad breath.<\/li>\n<li><strong>2.<\/strong> Floss and rinse your mouth with mouthwash (Non-Alcohol). Some people might fear of swallowing it and if that is the case then use it outside the fasting hours.<\/li>\n<li><strong>3.<\/strong> The traditional way to keep breath fresh; Use miswak sticks to clean teeth as it helps to control the formation of dental plaque and you will feel fresh throughout the day.<\/li>\n<li><strong>4. <\/strong>Cut down intake of coffee, tea, soda and other caffeinated drinks as they dehydrate your body, instead; drink plenty of water, juices and soups. Also avoid fried, spicy and salty food as it leads to dehydration.<\/li>\n<li><strong>5.<\/strong> If your suhoor meal includes fish or milk, brush and floss your teeth thoroughly as they contain special proteins which lead to bad breath.<\/li>\n<li><strong>6.<\/strong> If you use dentures make sure that you clean them properly using antiseptic solution as uncleaned dentures are a reason of decay and bad breath.<\/li>\n<li><strong>7.<\/strong> Smoking is refrain during the fasting hours so people who smoke can bag a great deal of quitting this habit as this too is one of the reasons for bad breath.<\/li>\n<li><strong>8.<\/strong> Diabetic patients must rinse their mouth twice a day with chlorhexidine mouthwash to prevent gum disease. It is also advised to get a thorough check-up done before Ramadan to make sure your gum health is not affected during fasting.<\/li>\n<li><strong>9.<\/strong> Avoid sticky food such as chocolates, cheese and certain type of cereals as if not brushed carefully these can get stuck in between the teeth.<\/li>\n<li><strong>10.<\/strong> Have fruits and boiled veggies at the time of breaking fast as they have high fiber content which will help in remineralizing your teeth naturally.<\/li>\n<li><strong>11.<\/strong> Do visit your dentist after Ramadan for a regular check-up.<\/li>\n<\/ol>\n<p>With celebrations all around, one will surely not like to miss them due to dental emergency. Make sure you maintain your Oral Health throughout the holy month and join in the ‘Eid’ celebrations with full enthusiasm.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ramadan is a holy month of fasting. The long fasting hours from ‘Suhoor’ to ‘Iftaar’ demands special care and the most neglected amongst all is the Oral Health. Not eating and drinking anything for a long time causes dehydration which builds the bacteria in the mouth which are responsible for foul breath. Here are a &hellip; <a href=\"https:\/\/clovedental.in\/blog\/oral-hygiene-ramadan\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">ORAL HYGIENE IN RAMADAN<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6322,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6323"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6323"}],"version-history":[{"count":6,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6323\/revisions"}],"predecessor-version":[{"id":14797,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6323\/revisions\/14797"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6322"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}