{"id":6431,"date":"2018-06-28T15:40:54","date_gmt":"2018-06-28T10:10:54","guid":{"rendered":"https:\/\/clovedental.in\/?p=6431"},"modified":"2022-02-15T05:33:53","modified_gmt":"2022-02-15T00:03:53","slug":"dentist-uncle-first-visit-child-dentist","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/dentist-uncle-first-visit-of-a-child-to-the-dentist\/","title":{"rendered":"Dentist Uncle… (First Visit of a Child to the Dentist)"},"content":{"rendered":"<p>The first dental visit of a child is full of anxiety for the parents as well as the child. It often depends on the parents, as to how they have prepared the child for the visit and whether the dental experience will be pleasant or traumatic. A child is definitely not going to be comfortable in an alien environment of dental surgery. And they normally have great apprehension and fear of the unknown<\/p>\n<p>Best age to plan visit to the Dentist<\/p>\n<p>The first dental visit of a child should be any time after the emergence of the first few teeth, which is generally speaking when the child is reaching one year. Visit to the dentist is also warranted if you see any black spots on teeth<\/p>\n<p>Prepare your child for a visit to the dentist<\/p>\n<p>Parents play an important role in preparing the child for the dentist visit. The parents by themselves being apprehensive may unknowingly instil fear in the child’s mind and resistance for treatment. To prepare the child to be comfortable in the dental surrounding, parents must start preparing the child a couple of days prior to the appointment. At no time, the child is to be made scared of a dentist by telling the child that we’ll ask the dentist to remove your teeth<\/p>\n<p>Parents should speak about going to the dental appointments using positive connotation only (both before and after each visit). They should not talk of the words like drilling, painful, hurt, pain, injection and needle, etc.<\/p>\n<p>One of the best ways to prepare your child is to start playing ‘Dentist-Dentist at home’, for example ‘counting of teeth’, ‘shape of teeth’, singing brushing songs while brushing teeth.<br \/>\nPhrases that can be used to describe the first visit to the dental office, ‘the dentist will tickle your teeth’, ‘will be painting vitamins on your teeth to make them strong’. These small measures will definitely aid in building the confidence in the child<\/p>\n<p>The first appointment of the child should be to let your child experience the dental office for a ‘visual inspection and a joy ride on the chair’. The dentist generally do not start any treatment on the first visit and they like to get to know the child and befriend them. Having said all this, the dentist also plays a major role in alleviating the fear from the child’s mind.<\/p>\n<p>The Dental Surgeons are specially trained to be patient friendly and use techniques so that the child feels ‘NO PAIN’ at all. In essence, our ultimate aim is to keep children absolutely comfortable, and to minimize anxiety when they visit the dental office to ensure that the traumatic experience does not create long term fear which may drive the child away from the dentist forever, which will lead them neglecting the oral hygiene and thus opening the oral health gateway to effect the general health.<\/p>\n<p>How to Choose A Dentist?<\/p>\n<p>The choice of dentist is a very important one and must be done with some thought and research going into it. Instinctively your own dentist would be a sensible choice but might not be the right one. A pedodontist will be a better choice as he understands the problems of kids better and is well qualified in this field.<br \/>\nYou should choose a dentist who is patient, friendly and dedicates time and attention. The dentist must know about child behaviour techniques, growth and development. All these will help in your child getting the best possible dental care.<\/p>\n<p>Parents should be involved in the treatment process and some questions parent must ask are:<br \/>\n1. Does the dentist give importance to prevention? This would include 6 monthly check-ups, radiographs to detect cavity (if required), diet education, etc.<br \/>\n2. Do they discuss brushing and flossing with your child? Do they educate the child or not?<br \/>\n3. Are Sealants used in the clinic as a preventive measure?<br \/>\n4. Are there any Pedodontist in the clinic.<br \/>\n5. What methods will the dentist use to make the child comfortable and happy? The choice of a pleasant looking, colourful office also helps. Children are very happy in a clinic which has toys, colours, cartoons, etc.<br \/>\n6. Are they using best sterilization in the clinic and are all instruments pouched after auto-claving.<br \/>\n7. Do they use radiation protection gear while taking x-rays<br \/>\n8. Do they maintain digital records for future use.<\/p>\n<p>HIGHLIGHTS<br \/>\n• A child’s first dental visit should be between the ages of 1–2 years preferably with a pedodontist.<br \/>\n• Try and make the first visit short and happy for the child as it has a lasting impression—so try and go in the morning when the child is fresh.<br \/>\n• Clinics must practice best asepsis method &amp; radiation protection.<br \/>\n• Emphasis should always be on prevention so you have a happy smiling kid.<br \/>\n• Dentist must have the facility to record and store digital records.<\/p>\n<p>By:- Dr. Nishu Bansal<br \/>\nPaedodontist, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The first dental visit of a child is full of anxiety for the parents as well as the child. It often depends on the parents, as to how they have prepared the child for the visit and whether the dental experience will be pleasant or traumatic. A child is definitely not going to be comfortable &hellip; <a href=\"https:\/\/clovedental.in\/blog\/dentist-uncle-first-visit-of-a-child-to-the-dentist\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Dentist Uncle… (First Visit of a Child to the Dentist)<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":754,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6431"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6431"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6431\/revisions"}],"predecessor-version":[{"id":14824,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6431\/revisions\/14824"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/754"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6431"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6431"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6431"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}