{"id":6442,"date":"2018-07-06T18:23:39","date_gmt":"2018-07-06T12:53:39","guid":{"rendered":"https:\/\/clovedental.in\/?p=6442"},"modified":"2022-02-15T05:49:17","modified_gmt":"2022-02-15T00:19:17","slug":"beware-childs-dental-habits","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/beware-of-your-childs-dental-habits\/","title":{"rendered":"Beware of your Child’s Dental Habits!!"},"content":{"rendered":"<p>Childhood is like being drunk. Everyone remembers what you did except you. Therefore, it becomes extremely important for parents to keep an eye on what their children are doing.<br \/>\nIt is the time when kids starts developing certain Dental Habits and correcting them in the initial stages will surely be beneficial. Because if not taken care of at the age of 4-5 year, it can later affect your permanent or adult teeth. Taking care of such habits is no rocket science just efforts would suffice.<br \/>\nThe most common Dental Habits are:<\/p>\n<p><strong>Thumb-sucking: <\/strong><\/p>\n<p>The most common of all the habits. It is a natural reflex which babies use to feel secure and it also helps them to feel relaxed. Therefore the parents should not worry if the behaviour is occasional. This could be a way of getting comfortable with the environment and feel secure. But if it extends beyond 5 years of age then the parents should surely visit a dentist.<br \/>\nIf not treated in time, this can lead to mis-aligned teeth, speech problem, open bite ie. when upper and lower teeth don’t meet, chewing problems etc.<\/p>\n<p><strong>Tips to Help:<\/strong><\/p>\n<ul>\n<li>Instead of scolding your child when they are sucking their thumb, praise them when they are not doing so.<\/li>\n<li>You can encourage them by promising to give special treats or toys if they discontinue this habit<\/li>\n<li>Keep reminding your child about the consequences they might face if they did not discontinue the same.<\/li>\n<li>Always reinforce your child in a positive way<\/li>\n<\/ul>\n<p><strong>Tongue Thrusting:<\/strong><\/p>\n<p>Did you know that your tongue is the strongest muscle in your body? Therefore just imagine how major an impact can it cause to the palate and the teeth. If a child indulge in such habit then he\/she is likely to face the orthodontic problem of not only having crooked teeth but this can also keep them from becoming normal. It can also cause speech problem.<\/p>\n<p><strong>Tips to Help:<\/strong><\/p>\n<ul>\n<li>It is always advised to breast-feed a child as children who are fed by bottle usually face this problem<\/li>\n<li>Visit a Paedodontist. He\/she may advise certain tongue exercises which will help your child to get rid of this habit<\/li>\n<li>An appliance can be given to correct such habit. Your Paedodontist can help you with finding a solution.<\/li>\n<\/ul>\n<p><strong>Mouth Breathing:<\/strong><\/p>\n<p>It might sometimes happen that your child is suffering from some nasal obstruction, as a result he\/she end up breathing through the mouth instead of nose. Your dentist is the only one who can diagnose and assess this habit during the regular check-up depending upon the gum condition.<br \/>\nYou can come across children between 3-6 years in age who sleep with parted mouth but they are actually breathing through nose, in that case there is nothing to worry about.<br \/>\nMouth breathing shows certain symptoms like red gums, bleeding gums or puffy gums. If this is the case then you should immediately consult an ENT specialist. Your paedodontist can certainly give your child an appliance to get it corrected.<\/p>\n<p><strong>Bruxism or Teeth Grinding:<\/strong><\/p>\n<p>Bruxism is also a common habit in children and is observed mostly at night when the child is sleeping (this can be because of the inner ear pressure) or concentrating.<br \/>\nApart from the reasons mentioned above there can be some psychological reasons like family issues, new environment, study pressure etc. which is putting mental pressure.<br \/>\n<strong>Teeth Grinding can cause various problems such as:<\/strong><\/p>\n<ul>\n<li>This can wear out the outer covering or enamel of the teeth making them shorter and flat.<\/li>\n<li>Sore jaw or face in the morning<\/li>\n<li>Sometimes the grinding could be so loud that it can be annoying to the family members<br \/>\nNormally children grind their teeth when new teeth are erupting which is upto the age of 6 yrs. But if they do not stop grinding their teeth by the age of 6 then it is required to visit a dentist and get the treatment done.<\/li>\n<\/ul>\n<p><strong>Tips to Help:<\/strong><\/p>\n<ul>\n<li>Make your child aware of this problem or let your dentist explain this issue to your child. This will make them conscious and they might stop grinding.<\/li>\n<li>Your dentist can recommend a mouth guard that can be put between the teeth to stop grinding<\/li>\n<li>Do not put pressure on your child or if they have any kind of stress try talking to them and make them feel comfortable. Help your child to have a peaceful sleep at night.<\/li>\n<\/ul>\n<p><strong>Nail Biting:<\/strong><\/p>\n<p>When kids go through a lot of physical and emotional changes during adolescence, they indulge in such habit. This is experienced in slightly elder children and is picked up in stressful situations.<\/p>\n<p><strong>Consequences faced are:<\/strong><\/p>\n<ul>\n<li>Chipped teeth specially the front teeth<\/li>\n<li>Nails and nail beds are damaged<\/li>\n<li>There are major chances of germs entering the body<\/li>\n<\/ul>\n<p>There is no dedicated treatment plan for this. Parents need to make their child conscious and should encourage their child to discontinue this habit.<\/p>\n<p>Dental wellness is usually the last on the list when parents think of their child’s health on and most of the times it happens that by the time you are aware or bring it to your notice it turns out to be a ‘Habit’.<br \/>\nHabits need to be changed with time as these can create a lot of difference in one’s personality and the way they carry themselves. Do not let Dental Habits harm you in any way.<\/p>\n<p>By:-<br \/>\nDr. Vrinda Sharma<br \/>\nPaedodontist, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Childhood is like being drunk. Everyone remembers what you did except you. Therefore, it becomes extremely important for parents to keep an eye on what their children are doing. It is the time when kids starts developing certain Dental Habits and correcting them in the initial stages will surely be beneficial. Because if not taken &hellip; <a href=\"https:\/\/clovedental.in\/blog\/beware-of-your-childs-dental-habits\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Beware of your Child’s Dental Habits!!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6461,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6442"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6442"}],"version-history":[{"count":6,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6442\/revisions"}],"predecessor-version":[{"id":14832,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6442\/revisions\/14832"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6461"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6442"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6442"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6442"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}