{"id":6530,"date":"2018-07-26T16:45:13","date_gmt":"2018-07-26T11:15:13","guid":{"rendered":"https:\/\/clovedental.in\/?p=6530"},"modified":"2022-02-15T05:32:08","modified_gmt":"2022-02-15T00:02:08","slug":"night-shifts-keep-teeth-happy-2","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/do-night-shifts-keep-your-teeth-happy\/","title":{"rendered":"Do NIGHT SHIFTS keep your teeth happy?"},"content":{"rendered":"<p style=\"text-align: left\"><!-- @page { margin: 0.79in } P { margin-bottom: 0.08in } --><\/p>\n<p align=\"JUSTIFY\">Information technology has been a boom and a boon to Indian economy. It had a huge impact on employment for all strata of people enabling them to earn big at their flexible time. Enabling them to choose their working hours with considerable number of people working during the night shifts.<\/p>\n<p align=\"JUSTIFY\">With such work schedule we over look our health which actually bears the impact on the human body. Teeth being one of the system which takes the brunt as well. In medical science, our body is working according to a body clock which is accustomed to the durinal variation or circadian rhythm.<\/p>\n<p align=\"JUSTIFY\">Saliva plays an important contributor in maintaining oral health. It helps to build and maintain the health of soft and hard tissues. Saliva helps in dilution of sugars after food and drink intake and its antimicrobial and cleansing activity prevent growth of harmful bacteria’s. It protects the tooth from acid attack by neutralising the acid produced. Sometimes it plays a bit of its role in remineralisation of enamel with calcium and phosphates<\/p>\n<p align=\"JUSTIFY\">Salivary system is one such system which gets affected the most. Our salivary secretion reduces by 50% during the night while its restored to normal by morning. While working or staying up late during the night we usually tend to munch which gets stuck to our teeth easily as there is no cleansing action of the saliva taking place. Thus, allowing harmful acids, plaque, and food remnants to stay on the teeth, often resulting in tooth decay.<\/p>\n<p align=\"JUSTIFY\">Along with our salivary gland system, our gastric secretions also become unsynchronized leading to acid reflux, indigestion, irritable bowel, GI ulcers as well. Due to constant high amount of acid build up in the stomach, its easily possible to vent and seep up into our oral cavity through our food pipe as regurgitation. These acids in the mouth are highly corrosive and being in contact with the tooth for prolonged time leads to weakening and dissolving the mineralized enamel.<\/p>\n<p align=\"JUSTIFY\">Late working hours, improper sleep builds up stress in our body leading to release of harmful chemicals in your system. These chemicals are call free radicals which affect your over all oral health causing gum diseases, mouth ulcers and teeth clenching leading to tooth wear and weakening. It has been seen that to combat stress youth indulge in smoking and tobacco chewing habits.<\/p>\n<p align=\"JUSTIFY\">Maintaining good oral health will allow you to have a good general health. Chronic indulgence in deleterious habits like tobacco consumption can lead to oral cancer and lung cancer. Your poor gum health can influence your sugar levels in your body. Tooth decay and neglect can lead to early tooth loss which in turn has its effect on your digestion. A visit to your dentist can help you to overcome all the foreseen oral health problems. At clove team of specialist looks into your teeth and provides you a holistic approach to your dental care needs. Simple precautions and mindfulness can help you fight the same<\/p>\n<p>By:-<\/p>\n<p><span style=\"color: #000000\"><span style=\"font-family: Arial, Helvetica, sans-serif\"><span style=\"font-size: small\">Dr Adhiraj Roy,<br \/>\nMDS oral medicine and radiology<\/span><\/span><\/span><\/p>\n<p><span style=\"color: #000000\"><span style=\"font-family: Arial, Helvetica, sans-serif\"><span style=\"font-size: small\">Clove Dental<\/span><\/span><\/span><\/p>\n\n","protected":false},"excerpt":{"rendered":"<p>Information technology has been a boom and a boon to Indian economy. It had a huge impact on employment for all strata of people enabling them to earn big at their flexible time. Enabling them to choose their working hours with considerable number of people working during the night shifts. With such work schedule we &hellip; <a href=\"https:\/\/clovedental.in\/blog\/do-night-shifts-keep-your-teeth-happy\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Do NIGHT SHIFTS keep your teeth happy?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":36,"featured_media":6526,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6530"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/36"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6530"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6530\/revisions"}],"predecessor-version":[{"id":14822,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6530\/revisions\/14822"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6526"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6530"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6530"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6530"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}