{"id":6531,"date":"2018-07-26T15:49:48","date_gmt":"2018-07-26T10:19:48","guid":{"rendered":"https:\/\/clovedental.in\/?p=6531"},"modified":"2022-02-15T05:30:56","modified_gmt":"2022-02-15T00:00:56","slug":"eat-right-make-teeth-right-2","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/eat-right-to-make-your-teeth-right\/","title":{"rendered":"EAT RIGHT TO MAKE YOUR TEETH RIGHT!"},"content":{"rendered":"<p>You are what you eat.<br \/>\nThe above statement holds equal importance for the body as well as your oral cavity. Tooth decay and gum disease are the most common oral diseases that destroy that treasured smile. Dental health is way more important than people actually realize and along with the daily oral hygiene practices your nutrition has a big role to play in this. In people with poor nutrition, dental disease progresses faster as compared to people with a healthy nutritious diet.<\/p>\n<p>The chunks that we eat in the middle of our meals do more harm than food eating during meal. The saliva secreted throughout the day helps to wash the food and lessen acid production which leads to lesser cavities and as a result do not cause any harm to teeth. A perfect diet is a healthy blend of many components contains proportionate amounts of essential nutrients. From fruits to vegetables, let’s discuss the secret recipe for happy oral health:<\/p>\n<ul>\n<li>Fruits – apples, oranges kiwi, limes, strawberry, banana are considered to be the best as they are rich source of vitamins, minerals esp. phosphorus<\/li>\n<li>Dairy products – milk , yogurt and cheese being rich sources of calcium and proteins<\/li>\n<li>Vegetables – foods like carrots , green leafy vegetables , cauliflower , green beans and peas are considered good as they clean out the teeth while you eat them<\/li>\n<li>Fluoridated water – is considered to be the most healthy tooth beverage<\/li>\n<\/ul>\n<p>Amongst the foods that should be avoided and are practically no – no’s to have for healthy mouth include sweetened beverages (like coffee and soft drinks), candy cookies, pastries, muffins etc. The first one leaves a layer over the teeth that causes tooth decay and all the latter ones contain a huge amount of sugar that become feeding grounds for bacteria also resulting in dental cavities. It also becomes difficult for tissues in the mouth to resist the infection and thus leading to gum disease and eventual tooth loss.<\/p>\n<p>There are certain types of foods that are not advised specifically in certain dental conditions. For a patient undergoing ORTHODONTIC treatments- sticky, chewy hard foods are not to be taken and instead a soft regular food is advised. Patients with DRY MOUTH are warned against alcohol, smoking, caffeinated drinks and spicy salty food. In cases of MOUTH ULCERS also spicy salty are to be refrained. . Hot, hard and crispy foods are to be avoided in the initial days Post treatment in IMPLANTS and ORAL SUR GICALcases. The foods generally recommended in such cases are yogurts, soups, custard, baked apples and mashed potato.<\/p>\n<p>In a nut shell, while brushing and flossing are the star cast to a healthy mouth , a healthy diet plays an indispensable supporting role. Maintaining this diet and its nutrient values will go a long way to keep your mouth healthy and enhance that beautiful smile.<\/p>\n<p>So next time you take a sip of your favorite sugar loaded soda – think again!<\/p>\n<p>By:-<br \/>\nDr. Shelly Batta Rishi<br \/>\nZonal Clinical Head &#8211; Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>You are what you eat. The above statement holds equal importance for the body as well as your oral cavity. Tooth decay and gum disease are the most common oral diseases that destroy that treasured smile. Dental health is way more important than people actually realize and along with the daily oral hygiene practices your &hellip; <a href=\"https:\/\/clovedental.in\/blog\/eat-right-to-make-your-teeth-right\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">EAT RIGHT TO MAKE YOUR TEETH RIGHT!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6523,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6531"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6531"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6531\/revisions"}],"predecessor-version":[{"id":14821,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6531\/revisions\/14821"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6523"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6531"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6531"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6531"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}