{"id":655,"date":"2017-03-07T14:36:19","date_gmt":"2017-03-07T14:36:19","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=655"},"modified":"2022-02-15T05:55:52","modified_gmt":"2022-02-15T00:25:52","slug":"4-common-oral-hygiene-mistakes-women-make","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/4-common-oral-hygiene-mistakes-women-make\/","title":{"rendered":"4 common oral hygiene mistakes women make"},"content":{"rendered":"<p align=\"JUSTIFY\"><strong>A beautiful smile divulges more about your health than one may think.<\/strong><\/p>\n<p align=\"JUSTIFY\">We’ve all overheard it before: brushing your teeth twice a day is Paramount. However when it comes to our oral hygiene routine, we shouldn’t stop there. Gum disease and decay, if it goes unchecked could destroy the auxiliary structures of teeth and thereby increasing the risk of us suffering from cardiovascular diseases. Many cohort and scientific studies shows a relationship between tooth loss, impending cardiovascular events, diabetes or even death.<\/p>\n<p align=\"JUSTIFY\">Thus it becomes essential to keep our teeth and gums healthy by inculcating good oral hygiene practices. Though it may seem easy enough process to brush and floss regularly, but certain simple unintentional mistakes could make this process less effective than required. Certain common dental hygiene slip-ups and ways to enable us keep our pearly whites healthy are as follows:<\/p>\n<p align=\"JUSTIFY\"><strong>1. WE’RE IN A HURRY<\/strong><\/p>\n<p align=\"JUSTIFY\">Take your time whilst brushing, says Gen. Vimal Arora, CCO of Clove Dental, India. “It’s important to brush slowly, lightly and gently.” The Indian Dental Association advocates brushing for a full two minutes, twice a day. Avoid brushing in a back and forth motion. This could lead to damage of gums and tooth enamel.<\/p>\n<p align=\"JUSTIFY\"><strong>2. WE USE THE WRONG TYPE OF BRUSH<\/strong><\/p>\n<p align=\"JUSTIFY\">Use brushes with soft bristles. Avoid hard brushes says Dr. Arora. Here’s why: Gums have a predisposition to shrink or draw back with age, even if the gums are healthy. Though the tooth above the gum-line is made of with enamel, cementum is the outermost layer of the root surface and is not as impervious to decay, Gen. Arora says. “Thus, it&#8217;s imperative as we age to be unyielding with flossing and gently brushing using a soft toothbrush.”<\/p>\n<p align=\"JUSTIFY\"><strong>3. WE SKIP FLOSSING (OR ONLY FLOSS BEFORE OUR DENTIST APPOINTMENT)<\/strong><\/p>\n<p align=\"JUSTIFY\"><a name=\"_GoBack\"><\/a>Flossing works best when done daily, says Dr. Aarti, BDS, GM Clove Dental. Flossing tends to reduces bacteria present in between the teeth and gums. She suggests you take time to floss between your teeth .She says “Take time to curl the floss around each tooth and go down to the gums as well. This leads to reduced risk of us having periodontal disease or early tooth loss.”<\/p>\n<p align=\"JUSTIFY\"><strong>4. WE DON’T DRINK ENOUGH WATER<\/strong><\/p>\n<p align=\"JUSTIFY\">Water plays a significant role in oral health and in preventing dry mouth, which could be a problematic as we age. Eight cups of water a day remains a general guideline. “Dry mouth could be because of medications (heart and blood pressure), lack of water or just the natural decline in saliva production due to biological aging,” says Dr. Aarti. A dry mouth allows the development of bacteria and fungi and leads to bad breath and tooth decay. So schedule a regular 6 month appointment with the dentist to save ourselves from the negligence.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A beautiful smile divulges more about your health than one may think. We’ve all overheard it before: brushing your teeth twice a day is Paramount. However when it comes to our oral hygiene routine, we shouldn’t stop there. Gum disease and decay, if it goes unchecked could destroy the auxiliary structures of teeth and thereby &hellip; <a href=\"https:\/\/clovedental.in\/blog\/4-common-oral-hygiene-mistakes-women-make\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">4 common oral hygiene mistakes women make<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":668,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/655"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=655"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/655\/revisions"}],"predecessor-version":[{"id":14838,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/655\/revisions\/14838"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/668"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=655"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=655"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=655"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}