{"id":671,"date":"2015-03-19T08:38:47","date_gmt":"2015-03-19T08:38:47","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=671"},"modified":"2022-02-15T05:51:25","modified_gmt":"2022-02-15T00:21:25","slug":"a-window-to-your-overall-health-part-i","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/a-window-to-your-overall-health-part-i\/","title":{"rendered":"ORAL HEALTH: A WINDOW TO YOUR OVERALL HEALTH, PART I"},"content":{"rendered":"<p><strong>What&#8217;s the connection between oral health and overall health?<\/strong><\/p>\n<p>Like many areas of the body, your mouth is teeming with <strong>bacteria<\/strong> — most of them harmless. Normally the body&#8217;s natural defenses and good oral health care, such as daily brushing and flossing, can keep these bacteria under control. However, without proper oral hygiene, bacteria can reach levels that might lead to oral infections, such as tooth decay and gum disease. In addition, certain medications — such as decongestants, antihistamines, painkillers and diuretics — can reduce saliva flow. Saliva washes away food and neutralizes acids produced by bacteria in the mouth, helping to protect you from microbial invasion or overgrowth that might lead to disease. Studies also suggest that oral bacteria and the inflammation associated with periodontitis — a severe form of gum disease — might play a role in some diseases. In addition, certain diseases, such as diabetes and HIV\/AIDS, can lower the body&#8217;s resistance to infection, making oral health problems more severe.<\/p>\n<p>Periodontal disease has been associated with a number of systemic conditions. Though the biological interactions between oral conditions such as periodontal disease and other medical conditions are still not fully understood, it is clear that major chronic diseases – namely cancer and heart disease – share common risk factors with oral disease. Recognition that oral health and general health are interlinked is essential for determining appropriate oral health care programmes and strategies at both individual and community care levels. That the mouth and body are integral to each other underscores the importance of the integration of oral health into holistic general health promotion.<\/p>\n<p><strong>Common Risk Factors for Oral Health<\/strong><\/p>\n<p>Oral disease is the most widespread chronic disease, despite being highly preventable. The common risk factors that oral disease shares with other chronic diseases\/conditions are:<\/p>\n<p>Diet<\/p>\n<p>– Risk factor for dental caries, coronary heart disease, stroke, diabetes, cancers, obesity<\/p>\n<p>Tobacco smoking \/ chewing<\/p>\n<p>– Risk factor for oral and other cancers, periodontal disease, coronary heart disease, stroke, respiratory diseases, diabetes<\/p>\n<p>Alcohol consumption<\/p>\n<p>– Risk factor for oral and other cancers, cardiovascular disease, liver cirrhosis, trauma<\/p>\n<p>Hygiene<\/p>\n<p>– Risk factor for periodontal disease and other bacterial and inflammatory conditions<\/p>\n<p>Injuries<\/p>\n<p>– Risk factor for trauma, including dental trauma.<\/p>\n<p>Control &amp; Stress<\/p>\n<p>– Risk factors for periodontal disease and cardiovascular disease<\/p>\n<p>Socio-economic status<\/p>\n<p>– Independent risk factor as well as underlying determinant of other risk factors.<\/p>\n<p>By:-<br \/>\nLt. Gen. (Dr) Vimal Arora; PVSM, AVSM, VSM &amp; Bar (Retd.)<br \/>\nBDS, MDS (Prosthodontist &amp; Implantologist), FDS, RCPS (UK)<br \/>\nChief Clinical Officer, Clove Dental<br \/>\nFormer Director General Dental Services, Indian Army Dental Corps<br \/>\nEx-Member, Dental Council of India<br \/>\nFormer Honorary Dental Surgeon to the President of India<\/p>\n","protected":false},"excerpt":{"rendered":"<p>What&#8217;s the connection between oral health and overall health? Like many areas of the body, your mouth is teeming with bacteria — most of them harmless. Normally the body&#8217;s natural defenses and good oral health care, such as daily brushing and flossing, can keep these bacteria under control. However, without proper oral hygiene, bacteria can &hellip; <a href=\"https:\/\/clovedental.in\/blog\/a-window-to-your-overall-health-part-i\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">ORAL HEALTH: A WINDOW TO YOUR OVERALL HEALTH, PART I<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":663,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/671"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=671"}],"version-history":[{"count":4,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/671\/revisions"}],"predecessor-version":[{"id":14835,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/671\/revisions\/14835"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/663"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=671"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=671"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=671"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}