{"id":6746,"date":"2018-09-05T15:43:47","date_gmt":"2018-09-05T10:13:47","guid":{"rendered":"https:\/\/clovedental.in\/?p=6746"},"modified":"2022-02-15T04:55:47","modified_gmt":"2022-02-14T23:25:47","slug":"teachers-cornerstone-imparting-health-education","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/teachers-cornerstone-imparting-health-education\/","title":{"rendered":"Teachers: Cornerstone in Imparting Health Education"},"content":{"rendered":"<p>Teacher. A word that bring lots of faces to our mind with which we have a lot of memories attached. But the question is – Who is a teacher? Is it just the face we remember? Or are they the ones responsible for who we are today?<br \/>\nTeachers are a ray of light in a child’s life. He\/she is someone who shapes the life of an individual. We spend almost a quarter of our life in school amongst the teachers. So technically a child spends more time with his\/her teacher than parents. This explains that whatever learning children imbibe is from their teacher.<br \/>\nTeachers educate their students, make them to be good human beings, teach them moral lessons and are considered as stepping stone to success. But do you think the job is done?<br \/>\nIn this busy life health is something that takes a backseat, specially oral health. And as far as a children are concerned, they are more prone to dental diseases as compared to adults. This is because they consume more sugary food which results in dental decay or caries which can lead to other health complications.<br \/>\nIt is now need of the hour to impart the basic knowledge of oral health and the dental habits to be adopted to avoid any future implications. For that it is very important that the teachers are aware of the basic dental problems and solutions to it. They should be well trained about health education especially dental education.<br \/>\nSchools should organize dental camp for teachers in which they should be taught the primary dental habits which we are sure that they know but often forget to implement.<br \/>\nThe basic habits includes:<br \/>\n• <strong>Brushing twice a day<\/strong> – By now everyone is aware that it is really important to brush twice a day to keep your teeth healthy. But do you actually practice the same?<br \/>\n• <strong>Rinsing mouth<\/strong> – It is very important to rinse your mouth after every meal. This washes away any food particle that is stuck to your teeth and gums and keep your mouth clean. Ohh ohh never took it seriously!<br \/>\n• <strong>Flossing<\/strong> – Along with brushing and rinsing it is also advised to floss everyday. This keeps your teeth clean by removing particles that are left between the teeth spaces and are stuck even after brushing. We bet you didn’t knew. Did you?<br \/>\n• <strong>Adopting proper brushing technique<\/strong> – With the point stated above some of you will say that we do brush twice a day, but do we do it properly? There is always a way of brushing. Place your toothbrush at an angle of 45 degree and rotate your brush in circular motion. Also do not be in hurry and take your time to brush your teeth properly. The standard time should be 2-3 minutes. Often people believe that brushing harder will whiten their teeth instantly which is a myth. One should move their tooth brush gently making it to reach all the parts.<br \/>\n• <strong>Never Neglect your Tongue<\/strong> – It is as important to clean your tongue as teeth. Along with creating bad odor it can also cause other health implications. Therefore, make it a habit to clean your tongue while brushing.<br \/>\n• <strong>Visiting dentist regularly<\/strong> – It is always recommended to visit dentist twice a year to keep your mouth healthy. They can help to spot the issues if any and can help you to solve them before it is too late.<\/p>\n<p>Following a few steps can make a wide difference and what can be better than being taught by the gurus themselves. Along with these habits teachers should be trained regarding the theoretical and practical knowledge which they can provide to their students. With this the aim to educating the students about maintaining oral hygiene will achieved. If possible have it as a part of curriculum as then it will bring about a change in the behaviour of students about oral hygiene which will lead to having a healthy lifestyle.<\/p>\n<p>If the teachers are well-trained and supported by the dentists they can bring about a major change in the lifestyle of the future of India.<\/p>\n<p>By:-<br \/>\nDr. Neelam Singh<br \/>\nAssistant General Manager<br \/>\nClove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Teacher. A word that bring lots of faces to our mind with which we have a lot of memories attached. But the question is – Who is a teacher? Is it just the face we remember? Or are they the ones responsible for who we are today? Teachers are a ray of light in a &hellip; <a href=\"https:\/\/clovedental.in\/blog\/teachers-cornerstone-imparting-health-education\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Teachers: Cornerstone in Imparting Health Education<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6745,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6746"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6746"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6746\/revisions"}],"predecessor-version":[{"id":14791,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6746\/revisions\/14791"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6745"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6746"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6746"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6746"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}