{"id":677,"date":"2015-07-30T10:16:53","date_gmt":"2015-07-30T10:16:53","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=677"},"modified":"2022-02-15T05:38:16","modified_gmt":"2022-02-15T00:08:16","slug":"dental-care-networks-why-they-make-sense","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/dental-care-networks-why-they-make-sense\/","title":{"rendered":"Dental Care Networks – Why They Make Sense"},"content":{"rendered":"<p style=\"text-align: left\">In an Aug. 13, 2012, article titled &#8220;Big Med,&#8221; Harvard public health Professor Atul Gawande, MD, deliberates U.S. Bureau of Labor Statistics data that showed that in the last decade, most physicians have gone from being practice owners to employees. Dr. Gawande does not disapprove the shift. In fact, he says, medicine should become even more corporatized, more structured, and more consistent—in short, more like the restaurant chain McDonalds or Barista. &#8220;Big chains thrive,&#8221; he writes, &#8220;because they provide goods and services of greater variety, better quality, and lower cost than would otherwise be available. Size is the key. It gives them buying power, lets them centralize common functions, and allows them to adopt and diffuse innovations faster than they could if they were a bunch of small, independent operations.&#8221;<\/p>\n<p style=\"text-align: left\">In an independent, stand-alone clinic, the dentist must spend a large part of his day dealing with staffing, accounting, marketing, training, sterilization, and maintaining stocks of consumables. There’s little time left to do what he\/she is best at. In a corporate setting, these matters are dealt with by management, leaving clinical staff to focus on patient care.<\/p>\n<p style=\"text-align: left\">Other challenges faced by independent clinics are the sizable initial investment required and the daily operating costs involved. Taken together, these challenges can lead practitioners to make compromises in order to reduce costs or to free up more of their time for treatment. For the patient, these compromises can lead to poor communication about their dental problem and the range of options to address it, as well as a lack of transparency and uniform pricing. Patients who experience this, or worse, problems caused by inadequate sterilization measures or the absence of proper tools and equipment, are then reluctant to visit the dentist again.<\/p>\n<p style=\"text-align: left\">Medical and dental networks can achieve economies of scale that independent clinics can’t achieve. This enables networks to incorporate the best technologies and equipment and build clinical teams that offer a wider range of skills and experience.<\/p>\n<p style=\"text-align: left\">In 2012, India registered 1,80,000 practicing dentists. While the number seems grossly insufficient to meet the needs of a population exceeding one billion, the dentist-to-patient ratio represents a marked improvement over preceding years. Most dentists prefer to work in private clinics, which are thus experiencing impressive growth. However, the risks and costs involved in establishing and operating private clinics present challenges that are off-putting for many qualified dentists. Joining a network of clinics enables dentists to practice their trade without the hassles of managing a business.<\/p>\n<p>Dr. Aarti Kapila-Sharma<br \/>\nHead of Dental Administration, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In an Aug. 13, 2012, article titled &#8220;Big Med,&#8221; Harvard public health Professor Atul Gawande, MD, deliberates U.S. Bureau of Labor Statistics data that showed that in the last decade, most physicians have gone from being practice owners to employees. Dr. Gawande does not disapprove the shift. In fact, he says, medicine should become even &hellip; <a href=\"https:\/\/clovedental.in\/blog\/dental-care-networks-why-they-make-sense\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Dental Care Networks – Why They Make Sense<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":657,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/677"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=677"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/677\/revisions"}],"predecessor-version":[{"id":14826,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/677\/revisions\/14826"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/657"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=677"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=677"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=677"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}