{"id":679,"date":"2017-02-06T16:29:29","date_gmt":"2017-02-06T16:29:29","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=679"},"modified":"2022-02-15T05:28:47","modified_gmt":"2022-02-14T23:58:47","slug":"fluoride-natures-cavity-fighter","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/fluoride-natures-cavity-fighter\/","title":{"rendered":"Fluoride – Nature’s Cavity Fighter"},"content":{"rendered":"<p>Ever since our birth, we are always told about how taking Calcium will make our bones and teeth stronger. There is no denying the fact that Calcium does have all these benefits. However, there is one other mineral, which works wonders in making your teeth stronger, known as Fluoride. Fluoride is a mineral that occurs naturally in many foods and water.<\/p>\n<p><strong><span style=\"text-decoration: underline\">Tooth Decay –<\/span><\/strong> Ever wondered what happens to your teeth that makes them decay? Every day your teeth undergo two processes – minerals are lost from a tooth’s enamel (outer surface of your teeth) – this process is called demineralization. And the second process is called remineralization – that is minerals like Calcium, Fluoride and phosphate are redeposited to the enamel layer from the food and water consumed. Too much demineralization without enough remineralization to repair the enamel leads to tooth decay. (Ailaa, I didn’t know so much is going on my tooth surface!!)<\/p>\n<h2><b>How does Fluoride help in preventing tooth decay?<\/b><\/h2>\n<p>Fluoride helps both adults and children. Let’s have a look at how it does that.<\/p>\n<p>Before the teeth come out of the gums, the Fluoride taken from foods, beverages and other dietary supplements makes the tooth enamel harder. This makes it more resistant to decay. This is the systemic effect of Fluoride.<\/p>\n<p>After the teeth erupt, Fluoride helps to rebuild (Remineralize) the enamel, thus making it stronger and reversing the early tooth decay. This fluoride comes from Fluoride containing toothpaste and other fluoridated dental products that are applied directly on the tooth surface. This is called the Topical (Local) effect of Fluoride. In addition, Fluoride from food and beverages continues to provide a topical effect as it becomes part of your saliva.<\/p>\n<h2><b>How do I Get Fluoride?<\/b><\/h2>\n<p><strong><span style=\"text-decoration: underline\">Drink water with Fluoride:<\/span><\/strong> Fluoride is naturally found in most drinking water sources like rivers, lakes, wells. Further, it will be interesting for you to know that Fluoride is being added to drinking water for the last 70 years. The fluoride is added in the concentration 0.7 to 1.2 parts per million (ppm).<\/p>\n<p><strong><span style=\"text-decoration: underline\">Fluoridated toothpaste and Mouth Rinses:<\/span><\/strong> These contain varying concentrations of Fluoride and can be used like regular toothpaste. They contain anything between 0.22% to 1.1% Fluoride.<\/p>\n<p><strong><span style=\"text-decoration: underline\">Fluoride Gels\/Foams and fluoride Varnishes:<\/span><\/strong> They are used for people at high risk of cavities, orthodontic patients, patients with the decreased salivary flow. They are applied to the teeth with the help of Special trays that keep the Fluoride gel in contact with the teeth.<\/p>\n<p>Varnishes have the advantage that they are easy to apply, they have a less offensive smell and are required in smaller amounts when compared to Fluoride Gels or Foams.<\/p>\n<p><strong><span style=\"text-decoration: underline\">Medical Supplements:<\/span><\/strong> Medical Fluoride supplements in the form of tablets, lozenges or liquids are used for children in areas with low fluoride concentrations in drinking water.<\/p>\n<p>The daily Adequate Intakes (AI) for elemental fluoride from all sources including drinking water are: infants birth through 6 months, 0.01 mg; babies age 7 through 12 months, 0.5 mg; children 1 through 3 years, 0.7 mg; 4 through 8 years, 1 mg; 9 through 13 years, 2 mg; 14 through 18 years, 3 mg; men 19 years and older, 4 mg; women 14 years and older, including those who are pregnant or breastfeeding, 3 mg.<\/p>\n<h2><b>When is Fluoride intake most critical?<\/b><\/h2>\n<p>It is most beneficial for children between the ages of 6 months to 16 years to get exposed to Fluoride because this is the time during which primary and permanent teeth usually erupt.<br \/>\nHowever, for children aged less than 6 years, the fluoride requirement is usually met by the fluoridated water and Fluoride from food and beverages. So, fluoridated products, like toothpaste, mouthwashes, rinses etc., are not recommended for children.<\/p>\n<h2><b>Side Effects\/Toxicity of Fluoride<\/b><\/h2>\n<p>Fluoride is safe for most people in the amounts added to public water supplies and used in toothpaste and mouthwashes, and applied by dentists. Low doses (up to 20 mg per day of elemental fluoride) of supplemental fluoride taken by mouth appear to be safe for most people. Higher doses are UNSAFE and can weaken bones and ligaments, and cause muscle weakness and nervous system problems. High doses of fluoride in children before their permanent teeth come through the gums can cause tooth discolouration.<\/p>\n<p>Toothpaste and fluoride rinses should not be swallowed routinely, particularly by children. It’s a good idea to make sure that children under six years of age use only a pea-sized amount of fluoride-containing toothpaste, just in case they swallow some.<\/p>\n<p><strong>Dental Fluorosis:<\/strong><\/p>\n<p>Dental Fluorosis, also known as Mottled Enamel, is hypomineralization of tooth enamel, caused by excessive intake of fluoride during enamel formation.<\/p>\n<p>The extent of effect depends upon the dose, duration and age of the individual during exposure. The appearance can vary from faint white lines or specks (mildest form) to brown discolouration and brittle, pitted and rough enamel (most severe form). The most common concern for patients with Fluorosis is the esthetic appearance.<\/p>\n<p>The highest risk of developing Fluorosis is between when the child is born up to 6 years old.<\/p>\n<p><strong>Management of Fluorosis:<\/strong><\/p>\n<p>Dental fluorosis may or may not be of cosmetic concern. In some cases, there may be varying degrees of negative psychosocial effects. The treatment options are:<\/p>\n<ul>\n<li>Tooth Bleaching<\/li>\n<li>Micro Abrasion<\/li>\n<li>Composite Fillings<\/li>\n<li>Veneers<\/li>\n<li>Crowns<\/li>\n<\/ul>\n<h2><b>Special Precautions &amp; Warnings:<\/b><\/h2>\n<p><span style=\"text-decoration: underline\"><b>Pregnancy and breastfeeding:<\/b><\/span> Fluoride seems to be safe during pregnancy and breastfeeding when taken in doses below the tolerable upper intake level (UL) of 10 mg per day of elemental fluoride and when applied directly to the teeth in toothpaste and mouthwashes. But higher doses are UNSAFE and can weaken bones and ligaments, and cause muscle weakness and nervous system problems.<\/p>\n<p><b>Dr Harmohan Singh<br \/>\nSenior Auditor- Quality, Clove Dental<br \/>\nBDS, MBA- Hospital &amp; Health Management.<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Ever since our birth, we are always told about how taking Calcium will make our bones and teeth stronger. There is no denying the fact that Calcium does have all these benefits. However, there is one other mineral, which works wonders in making your teeth stronger, known as Fluoride. Fluoride is a mineral that occurs &hellip; <a href=\"https:\/\/clovedental.in\/blog\/fluoride-natures-cavity-fighter\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Fluoride – Nature’s Cavity Fighter<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":659,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/679"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=679"}],"version-history":[{"count":7,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/679\/revisions"}],"predecessor-version":[{"id":14775,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/679\/revisions\/14775"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/659"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=679"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=679"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=679"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}