{"id":681,"date":"2015-08-14T08:20:21","date_gmt":"2015-08-14T08:20:21","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=681"},"modified":"2022-02-15T05:28:15","modified_gmt":"2022-02-14T23:58:15","slug":"green-dentistry-a-guide-for-dentists-and-patients","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/green-dentistry-a-guide-for-dentists-and-patients\/","title":{"rendered":"Green Dentistry: A Guide for Dentists and Patients"},"content":{"rendered":"<p>If you&#8217;ve ever sat in the dentist’s chair and wondered where all the latex gloves, chemicals and x-ray films end up or stopped to consider how much water and electricity the office uses, you aren&#8217;t alone. Some dentists are starting to take off their protective eyewear and see the bigger picture.<\/p>\n<p>Green certainly seems to be a buzzword right now, doesn&#8217;t it? Whether it&#8217;s automobiles or apples, seemingly everything has a “green” or “organic” connotation. So you must be asking yourself, “What does it mean to be green?”<\/p>\n<p><b>How to be green?<\/b><br \/>\nOne of the foremost goals of pollution prevention is to reduce or eliminate the use of toxic substances at the source itself. Regarding the use of materials other than silver and mercury-bearing amalgams &#8211; dental professionals are encouraged to follow the development of new dental materials that do not contain mercury. The clinic’s water should be filtered, as the filtering process diminishes calcium and other deposits, thereby increasing the longevity of the instruments and reducing the need for maintenance.<\/p>\n<p>Green dentistry means re-thinking dental processes and procedures, office administration and marketing, and office design and construction, using the tenets of green dentistry as a guide.<\/p>\n<p>Re-thinking doesn&#8217;t always mean we have an answer. Gloves, for instance. Currently, there&#8217;s no great solution for reducing the waste of used gloves. But that doesn&#8217;t mean it isn&#8217;t worth re-thinking. Perhaps you can find gloves in a recycled box. Or maybe you can order gloves in bulk to cut down on transportation pollution.<\/p>\n<p>Re-thinking also doesn&#8217;t mean there&#8217;s only one answer. It helps to think of going green as a continuum – light green to dark green. What&#8217;s most important is to choose the green option that you&#8217;ll do consistently. Impression trays are a great example of your choices on a green continuum. A plastic impression tray is made of petroleum. It uses a lot of energy to create, only to be used once. Even more energy is used to ship it to the landfill, where it piles high with other trash a problem for the next generation to solve. The light green option is a compostable impression tray. These are made from corn instead of petroleum, and while still only used one time, the material is designed to decompose in landfill. Further along the continuum is the stainless steel impression tray. It can be sterilized and used many times, and ultimately recycled into a new purpose, making it the least wasteful, least polluting option.<\/p>\n<p><b>How can the patient help?<\/b><br \/>\nPatients can also do their bit to help save the environment. Ideas to help out include turning off the taps when washing your hands, sharing lifts to or from the dentist or using public transport (where possible) and recycling waste. The drive for greener dentistry is still in its infancy so there is no doubt that more improvement is needed &amp; we along with our patients and office staff need to be a part of the movement.<\/p>\n<p>Let your patients know that you are “going Green!” and ask them to contribute to your movement. School and college-going kids would respond more enthusiastically to you.<\/p>\n<p>You may put a bunch of flyers in your waiting hall about what you do to “go Green!” and what your patients can do to help.<\/p>\n<p>Share the &#8220;Save 90 A Day!&#8221; campaign with your patients, encouraging them to turn off the water while they brush their teeth, saving as much as 90 glasses of water per day.<\/p>\n<p><b>Dr. Saurabh Lall<br \/>\nSpecialist – Periodontics &amp; Implantology<br \/>\nClinical Analyst, CEO’s Office, Clove Dental<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>If you&#8217;ve ever sat in the dentist’s chair and wondered where all the latex gloves, chemicals and x-ray films end up or stopped to consider how much water and electricity the office uses, you aren&#8217;t alone. Some dentists are starting to take off their protective eyewear and see the bigger picture. Green certainly seems to &hellip; <a href=\"https:\/\/clovedental.in\/blog\/green-dentistry-a-guide-for-dentists-and-patients\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Green Dentistry: A Guide for Dentists and Patients<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":666,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/681"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=681"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/681\/revisions"}],"predecessor-version":[{"id":14819,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/681\/revisions\/14819"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/666"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}