{"id":686,"date":"2015-03-10T11:03:29","date_gmt":"2015-03-10T11:03:29","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=686"},"modified":"2022-02-15T05:21:09","modified_gmt":"2022-02-14T23:51:09","slug":"hello-teeth","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/hello-teeth\/","title":{"rendered":"Hello Teeth!"},"content":{"rendered":"<p>As parents of infants can attest, the appearance of a baby’s first teeth is an exciting milestone in their child’s first year. When that first white cap pokes through the gums, it’s a source of delight for parents. But not necessarily for the infant.<\/p>\n<p>The process of teething typically begins around the age of six months, though it can start as early as three months. Around the age of three years, a child will have all 20 primary teeth. The lower front teeth are typically the first to emerge. The upper front teeth appear one to two months after the lower front teeth.<\/p>\n<p>Some babies experience soreness and swelling of the gums when a tooth is emerging, and naturally, this results in an understandably fussy baby. The symptoms usually begin three to five days before the tooth appears, and disappear once the tooth has broken through the gums. Some babies do not appear to experience discomfort when teething.<\/p>\n<p>Parents whose children have a difficult time with teething will remember these days well. A baby may refuse to eat or drink when their gums hurt. They may also bite their fingers or toys in order to relieve the pressure on their gums. Drooling is also common, and this can cause a rash on the child’s chin, face or chest. The teething process can also be characterized by crying spells and disrupted sleeping patterns.<\/p>\n<p>What can parents do to help their baby through the process of teething? They can use a clean finger to gently rub the baby’s gum for about two minutes at a time. A clean, cold (refrigerated, not frozen) teething ring can also relieve a teething baby. Teething rings with liquid inside should be avoided, as they can break or leak. And a teething ring should never be sterilized in boiling water, as this can damage the plastic and lead to the baby’s consumption of the chemicals present in the plastic.<\/p>\n<p>Parents can also consult the baby’s pediatrician for advice on appropriate pain relievers that might be effective. However, teething gels and tablets should not be used, as they may not be safe for babies.<\/p>\n<p>Now, what about caring for these first precious teeth? Read our blog on <a href=\"http:\/\/www.clovedental.in\/blog-post\/milk-teeth-need-care\/\">Taking Care of the Milk Teeth<\/a> for important tips and information on <a href=\"http:\/\/www.clovedental.in\/treatments\/pediatric-dentistry\/\">dental care for young children<\/a>.<\/p>\n<p>By:-<br \/>\nDr. Jayna Gandhi<br \/>\nPedodontist, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>As parents of infants can attest, the appearance of a baby’s first teeth is an exciting milestone in their child’s first year. When that first white cap pokes through the gums, it’s a source of delight for parents. But not necessarily for the infant. The process of teething typically begins around the age of six &hellip; <a href=\"https:\/\/clovedental.in\/blog\/hello-teeth\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Hello Teeth!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":329,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/686"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=686"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/686\/revisions"}],"predecessor-version":[{"id":14813,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/686\/revisions\/14813"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/329"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=686"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=686"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=686"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}