{"id":688,"date":"2015-05-22T11:13:17","date_gmt":"2015-05-22T11:13:17","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=688"},"modified":"2022-02-15T05:20:30","modified_gmt":"2022-02-14T23:50:30","slug":"help-my-parents-give-my-child-too-many-sweets","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/help-my-parents-give-my-child-too-many-sweets\/","title":{"rendered":"Help!!! My Parents Give My Child Too Many Sweets!"},"content":{"rendered":"<p>Grandparents are special figures in a child’s life. But their habit of spoiling the grandkids can wreak havoc on a child’s oral health. Sweets and treats are rarely denied, much to the angst of the parents. Dentists often hear the complaints: “Dadi and Dada keep giving my child chocolates and biscuits, no matter what I say! What can I do???”<\/p>\n<p>Chocolates, potato chips and biscuits are a tooth’s worst enemy. When they mix with saliva, they become sticky and cling to the tooth surface. Bacteria then grow in this sticky substance, and this produces acid that attacks the teeth, resulting in tooth decay.<\/p>\n<p><a href=\"http:\/\/www.clovedental.in\/blog-post\/milk-teeth-need-care\/\">Protecting the milk teeth<\/a> from tooth decay is just as important as protecting the permanent teeth. Tooth decay can progress to the point that the tooth must be extracted. If this happens before the permanent tooth is ready to erupt, the teeth next to the empty space may shift into this space. This may result in the need for braces later on, which can be time-consuming and expensive. So it’s important to monitor the diets of young children as well as older kids.<\/p>\n<p>Our diets have changed substantially over the past few years. Children today eat more processed foods that are full of sugar and sodium. Previous generations never had these issues while growing up, as the food they ate was more fibrous than what is being eaten by kids today.<\/p>\n<p>If you are a parent who worries about your child’s consumption of less-than-healthy foods, here are a few tips:<\/p>\n<ul>\n<li>Instruct your child to rinse after every snack.<\/li>\n<li>Your child should brush well after every meal and use dental floss.<\/li>\n<li>As tooth decay is visible to the naked eye, examine your child’s teeth regularly to detect dental decay early.<\/li>\n<li>Take your child to the dentist right away if he complains of pain in the teeth or gums.<\/li>\n<li>Please ask your dentist questions if you are ever in doubt about your child’s dental health.<\/li>\n<\/ul>\n<p>Most importantly, take your child to the dentist regularly for a check-up and professional cleaning. Dentists can also administer fluoride treatment or a sealant to provide an additional and very effective measure of protection against decay.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Grandparents are special figures in a child’s life. But their habit of spoiling the grandkids can wreak havoc on a child’s oral health. Sweets and treats are rarely denied, much to the angst of the parents. Dentists often hear the complaints: “Dadi and Dada keep giving my child chocolates and biscuits, no matter what I &hellip; <a href=\"https:\/\/clovedental.in\/blog\/help-my-parents-give-my-child-too-many-sweets\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Help!!! My Parents Give My Child Too Many Sweets!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":658,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/688"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=688"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/688\/revisions"}],"predecessor-version":[{"id":14812,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/688\/revisions\/14812"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/658"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=688"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=688"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=688"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}