{"id":690,"date":"2015-06-08T06:13:26","date_gmt":"2015-06-08T06:13:26","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=690"},"modified":"2022-02-15T05:18:15","modified_gmt":"2022-02-14T23:48:15","slug":"how-to-prepare-your-child-to-visit-the-dentist","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/how-to-prepare-your-child-to-visit-the-dentist\/","title":{"rendered":"How to Prepare Your Child to Visit the Dentist"},"content":{"rendered":"<p>When you mention the word “dentist,” does your child hide under the bed? Report the sudden onset of an illness? Or remember an important homework assignment that happens to be due the next day?<\/p>\n<p>Like their parents, most kids aren’t fond of visiting the dentist. In fact, they may well have learned their fear of the dentist from their parents. But given the pain-management solutions available today, as well as advancements in the <a href=\"http:\/\/www.clovedental.in\/specialties\/\">dental treatments<\/a> and products now offered, there’s no need to dread a visit to the dentist.<\/p>\n<p>Once your child has visited the dentist, he will see and experience for himself that there’s nothing to fear. But first you have to get him there. And you can do this with minimal drama by preparing your child for the visit.<\/p>\n<p>Start a few days before the appointment. Talk positively about the upcoming appointment and avoid any words that could instill fear in the child, such as needle, injection, or drilling. Tell your child that the dentist might tickle her teeth when checking them or cleaning them. Explain that the dentist might brush a special solution on her teeth to make them stronger and it will be like having her teeth painted. Tell her that the solutions used to clean and protect her teeth taste yummy – like a mint or bubble gum. Play dentist at home by letting your child inspect your teeth. Prepare your child for the sounds he’ll hear in the operatory, so he’s not frightened by them when he actually hears them. Tell him that he’ll get to sit in a very comfortable, fancy chair that can move in all directions.<\/p>\n<p>Ask family and friends to recommend dentists who are skilled at putting children at ease. A dentist who can relate well to a child and speak to her in a manner she’ll understand will be more successful in calming her nerves. And a calm child is easier to treat than one who is anxious or scared.<\/p>\n<p>Finally, make regular visits to the dentist a habit for the whole family. Explain that it’s one of the ways we take care of ourselves, just like getting a haircut or getting a vaccination. The more often the child visits the dentist for preventive care, the fewer times he’ll need treatment for a painful problem.<\/p>\n<p>By:-<br \/>\nDr. Bhavani Ramesh Nair<br \/>\nBDS<br \/>\nZonal Clinical Head, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When you mention the word “dentist,” does your child hide under the bed? Report the sudden onset of an illness? Or remember an important homework assignment that happens to be due the next day? Like their parents, most kids aren’t fond of visiting the dentist. In fact, they may well have learned their fear of &hellip; <a href=\"https:\/\/clovedental.in\/blog\/how-to-prepare-your-child-to-visit-the-dentist\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">How to Prepare Your Child to Visit the Dentist<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":669,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/690"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=690"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/690\/revisions"}],"predecessor-version":[{"id":8203,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/690\/revisions\/8203"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/669"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=690"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=690"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=690"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}