{"id":6921,"date":"2018-10-04T09:43:19","date_gmt":"2018-10-04T04:13:19","guid":{"rendered":"https:\/\/clovedental.in\/?p=6921"},"modified":"2022-02-15T04:57:07","modified_gmt":"2022-02-14T23:27:07","slug":"sugars-not-sweet-teeth","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/sugars-not-sweet-for-your-teeth\/","title":{"rendered":"SUGARS- Not Sweet For Your Teeth"},"content":{"rendered":"<p>Children’s and adult dental care needs largely match each other but there are a few aspects that will be different. Paediatric care demands spending time educating your kids on brushing and flossing tasks, as well as on oral care in general. As kids are still learning the fundamentals of oral health, it’s very important to be patient and educate them. As children are less supported to prevent dental problems, a dentist gives them an extra shield through dental sealants and fluoride treatments. These measures are indispensable to keep your kid’s teeth free of cavities.<\/p>\n<p>Dental sealants and fluoride treatments increases the tooth’s natural defence against cavities by 95%. Fluoride is a mineral that occurs naturally in many foods and water. Fluorides when applied to the teeth through fluoridated toothpastes and mouth rinses don’t do much good as they containing fluoride in lower strengths. Dentist applies fluoride on to your teeth by painting fluoride varnish or use a fluoridated gel which are at much higher concentrations, hence more beneficial. Dental sealants and fluoride treatment are non-invasive, non-painful, quick and can be repeated if necessary without damaging your tooth.<\/p>\n<p>Our teeth have lots of groves on their surfaces which are the potential spaces where the food gets lodged. Unfortunately, these spaces are unapproached by any tooth brush or paste. Dental sealants when applied flows into these grooves and seals them up preventing further food lodgement and keeps bacteria away. Though dental sealants are not the only cure for preventing tooth decay, they are cost-effective and helpful to particularly children in controlling decay in certain areas of the mouth. These sealants can last in your mouth for years depending on your chewing pattern.<\/p>\n<p>Whenever we eat something, our saliva helps to neutralize the acids which are produced by the bacteria which when acts on the food. These acids are harmful for our teeth as they cause caries attack leading to demineralization without enough remineralization to repair the enamel layer hence leading to tooth decay.<\/p>\n<p>With now a days difficult parenting circumstances and busy schedule, our kid’s teeth get neglected due to frequent snacking at play schools, chocolates every now and then during birthday celebrations or irregular brushing.  All these leads to continuous caries attack on the enamel.  In such circumstances, fluoride application comes handy.<\/p>\n<p>Fluoride treatments are an add on protection over dental sealants as they help keep enamel healthy, and strong and protect the tooth form caries attack. It also reverses early decay. It is very crucial that infants and children between the ages of 6 months and 16 years to be exposed to fluoride. This is when the primary and permanent teeth come in. However, adults also benefit from fluoride, too especially post tooth cleaning as they also reduce sensitivity.<\/p>\n<p>It is important to start preventive dental care for children by their three years of age. Early dental visits not only allow early prevention from tooth decay but also allows the dentist to foresee any dental malalignment anticipating their jaw growth pattern in advance. Regular dental exams help to reassure younger children that there is nothing to fear about a <a href=\"https:\/\/clovedental.in\">visit to a dentist<\/a>.<\/p>\n\n<p>By:-<br \/>\nDr. Adhiraj Roy<br \/>\nClinical Co-ordinator, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Children’s and adult dental care needs largely match each other but there are a few aspects that will be different. Paediatric care demands spending time educating your kids on brushing and flossing tasks, as well as on oral care in general. As kids are still learning the fundamentals of oral health, it’s very important to &hellip; <a href=\"https:\/\/clovedental.in\/blog\/sugars-not-sweet-for-your-teeth\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">SUGARS- Not Sweet For Your Teeth<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":36,"featured_media":5675,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6921"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/36"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6921"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6921\/revisions"}],"predecessor-version":[{"id":6922,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6921\/revisions\/6922"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/5675"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6921"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6921"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6921"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}