{"id":6932,"date":"2018-10-06T18:01:41","date_gmt":"2018-10-06T12:31:41","guid":{"rendered":"https:\/\/clovedental.in\/?p=6932"},"modified":"2022-02-15T05:17:03","modified_gmt":"2022-02-14T23:47:03","slug":"ignorance-dental-pain-bliss","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/ignorance-dental-pain-bliss\/","title":{"rendered":"Ignorance of Dental Pain &#8211; A Bliss"},"content":{"rendered":"<p>Ahhh! My tooth aches. Mommy I don’t want to go to a dentist. How often have you come across these incidents in your childhood or during your present times? There is nothing worse than the pain of a tooth… Sleepless nights and hunger strikes soothing it with ice-creams or ice packs. Even taking un-prescribed painkillers.<\/p>\n<p>This pain might be from a food entrapment, tooth decay, nearby gums or even undiscovered disease or lesion. Irregular care and not maintaining oral hygiene is the commonest cause for this upbringing.<\/p>\n<p>It all begins with sensitivity towards cold beverages or the slightest gush of air. This is one stage where we use anti-sensitive toothpastes or home remedies like keeping a piece of clove between teeth to give temporary relief. However, we do not visit a dentist. Then comes a time when it becomes unbearable with food lodgment, unable to eat anything. It becomes an irreversible condition where either the tooth has to be removed or undergo root canal treatment to prevent further infection.<\/p>\n<p>All this at the cost of increasing further expenses and stricter dental follow up visits with medications. Dental pain can be acute or chronic. Acute dental pain is often sudden with swelling and warmth near the site of pain, onset within few days persisting for approximately 14 days.<\/p>\n<p>Chronic dental pain on the other hand is long lasting with vague sensation but here the damage to the tooth has surpassed preventable stage and the infection has usually travelled deeper into the deeper layers of the tooth surface towards the pulp chamber. The tooth might be tender on percussion affecting the nearby periodontal fibers which hold the tooth in its socket.<\/p>\n<p>You try to soothe yourself by googling and youtubing. Trying all sorts of remedies. Once you fell there is a hole in my tooth, I think I must visit a dentist. Small preventive steps like brushing regularly twice a day, massaging your gums to stimulate blood flow and flossing your teeth can prevent the commonest dental disease and keep your smile intact and long lasting.<\/p>\n<p>A dental visit must be planned every 6 months for a preventive checkup. Ask the dentist for a personalized session on brushing technique and type of brush best suitable for you. A small step from your side can prevent untoward incidents in the future to a great extent and you can alive a comfortable life.<\/p>\n<p>Find the best solution to your dental needs. Market yourself as never before and show the world that you are a conscious dictator for your oral health needs. Education is the best tool to prevention and dentist is the best solution for resolution.<br \/>\nBy:<\/p>\n<p>Dr. Ruchin Arora<\/p>\n<p>Management Trainee<\/p>\n<p>Clinic Operations &#8211; Clove Dental<\/p>\n\n","protected":false},"excerpt":{"rendered":"<p>Ahhh! My tooth aches. Mommy I don’t want to go to a dentist. How often have you come across these incidents in your childhood or during your present times? There is nothing worse than the pain of a tooth… Sleepless nights and hunger strikes soothing it with ice-creams or ice packs. Even taking un-prescribed painkillers. &hellip; <a href=\"https:\/\/clovedental.in\/blog\/ignorance-dental-pain-bliss\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Ignorance of Dental Pain &#8211; A Bliss<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6931,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6932"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6932"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6932\/revisions"}],"predecessor-version":[{"id":8076,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6932\/revisions\/8076"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6931"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6932"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6932"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6932"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}