{"id":6944,"date":"2018-10-12T09:31:30","date_gmt":"2018-10-12T04:01:30","guid":{"rendered":"https:\/\/clovedental.in\/?p=6944"},"modified":"2022-02-15T05:19:07","modified_gmt":"2022-02-14T23:49:07","slug":"hesitant-brushers-guide-getting-munchkins-brush","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/hesitant-brushers-guide-getting-munchkins-brush\/","title":{"rendered":"Hesitant Brushers !!!! – A guide to getting your munchkins to brush"},"content":{"rendered":"<p>More often than not, we have parents struggling to get their reluctant kids to brush. Getting your child to brush can be a mammoth task, and when it comes to getting your child to brush twice, well you got it right, it is a tough battle!!!!! But, like all battles come to an end, you can put an end to this battle too, by being proactive in initial phases of a child’s life. It may seem like a tough fight, but it’s a fight worth having, because at the end of it all, your child would have learnt the habit of maintaining their pearly whites. Good habits inculcated early in a child get registered in the child’s head, and stays on for life. The parents, especially the mother plays a pivotal role when it comes to habit formation, because the adoption of habits first begins at home. Studies show that dental decay is one of the most prevalent dental disease in children. Though largely preventable, it remains the most common, due to frequent intake of sticky refined foods and faulty brushing habits. Dental decay, not only affects the tooth causing pain and infection, it affects the developing baby permanent tooth underneath, and the unsightly appearance can become embarrassing for your child, playing havoc on his self confidence. The infected tooth paves way for many other systemic infections, as the microorganisms travel through the blood to other organs. Brushing twice a day and rinsing your mouth after every meal is a simple and effective way to keep dental decay at bay. Thus, it becomes important to introduce this healthy habit early in your child so that it becomes a part of your child’s routine, and it is no longer a boring chore for them. So how to get your kids to brush? THE SOONER, THE BETTER As the saying goes, it’s never too late. Introducing oral hygiene habits early help in adoption and formation of that habit. The mother should make a conscious effort to maintain infant’s oral hygiene. The oral hygiene should begin, even before the infant gets his first baby tooth. A clean soft damp cloth or dampened sterile gauze wrapped around the index finger of the mother can be used to wipe the baby’s gums, so as to remove all traces of milk. When the first tooth erupts (usually around 6 months), a toothbrush can be used to clean the teeth.<br \/>\nDentists recommend that the first visit of the child should be well before the child’s first birthday. Regular visits to the dentist also help the child get familiar with the dental setting. BRUSH TOGETHER Practice what you preach. Set an example for your kid, by brushing your teeth twice too. A child learns what he sees, and the parents are his biggest role models. So, get hold of your brush too, and start brushing with your kid. The kid will enjoy the experience when you all brush as a family, and will inculcate the habit faster. Infact, sometimes the child might even remind you to brush!!!! Floss in front of the child, so that the child also emulates, and will learn how to floss. Flossing can be a little tricky initially, but once you start, you would never go to bed without flossing. BE PATIENT Try to be patient with your kid. The child may take some time to get accustomed to the whole thing. As the child learns several other habits with time, he will develop this habit too. The child needs a tender, loving approach when it comes to learning. Do not be harsh or strict, and do invest some time with your child. Your endurance and time spent is surely going to pay off in the long run. MAKE IT INTERESTING Youtube is flooded with animated videos and cartoons demonstrating the brushing technique. You can play videos of popular cartoon characters and brush along. Songs can also be played and used as a timer to help the child brush for a good 2-3 minutes. Encourage your child at every step and praise them for their amazing technique. You can even make a reward chart, where the child would be entitled to a reward or an incentive every week if he brushes twice daily. This will encourage and motivate your little one to brush their pearly whites. GUIDE YOUR KID WITH THE RIGHT WORDS Use of expressions like Sweeping “sugar bugs” from your teeth, removing Tartar Uncle, saying goodbye to Mr. Cavity Maker, say hello to Mr. Sparky can make toothbrushing interesting and fascinating for the kids. Tell them a story<br \/>\nthat the sugar bug needs to go from your mouth or it will make holes in your teeth. This will help them to get on board. The little hands have less manual dexterity, so guide your child by asking him to big circles in the air, just like the wheels of a moving train. Gradually reduce the size of the circles and tell him to brush his teeth in circular motions. Ask your child to pretend to be a lion or a hippo, and open their mouth wide just like a lion or hippo would. CHOOSE THE RIGHT KIT The little hands are delicate and have less dexterity. Age appropriate soft baby toothbrushes, or power toothbrush, and flossers without sharp edges can be employed. Very young kids are unable to brush, in such a case, choose finger brushes, which can be inserted on a mother’s finger and then child’s teeth can be brushed. For kids who are learning to brush on their own, choose a small size soft toothbrush for easy handling and a small head size for easy insertion in the mouth. Toothbrushes with favourite cartoon characters can be chosen to encourage brushing. Toothpastes are also available in a variety of baby friendly flavours which can be used for brushing. Barbie, Minions, Spiderman, Doremon and Batman are some of the popular cartoon characters when it comes to brushes and toothpastes. Take little quantity of toothpaste, ADA recommends a smear of toothpaste for kids younger than 3, and a pea size amount for 3 years and above. Toothpastes for kids can be fluoride free or with a fluoride concentration of 500 ppm. All these tips and tricks can help make brushing an enjoyable experience for a child. Creating a fun routine early in a child’s life will ensure that your child develops a lifelong habit of brushing and flossing.<\/p>\n\n<p>By :- Dr. Garima Jain Agrawal<\/p>\n<p>Pedodontist, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>More often than not, we have parents struggling to get their reluctant kids to brush. Getting your child to brush can be a mammoth task, and when it comes to getting your child to brush twice, well you got it right, it is a tough battle!!!!! But, like all battles come to an end, you &hellip; <a href=\"https:\/\/clovedental.in\/blog\/hesitant-brushers-guide-getting-munchkins-brush\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Hesitant Brushers !!!! – A guide to getting your munchkins to brush<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6943,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6944"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6944"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6944\/revisions"}],"predecessor-version":[{"id":6945,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/6944\/revisions\/6945"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6943"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6944"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=6944"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=6944"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}