{"id":700,"date":"2017-02-06T16:33:44","date_gmt":"2017-02-06T16:33:44","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=700"},"modified":"2022-02-15T04:58:37","modified_gmt":"2022-02-14T23:28:37","slug":"role-of-nutrition-in-preventing-cancer","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/role-of-nutrition-in-preventing-cancer\/","title":{"rendered":"Role of Nutrition in Preventing Cancer"},"content":{"rendered":"<p><b><i>&#8216;Right now the effects of diets and nutrition in preventing cancer is hot&#8217;<\/i><\/b> as said by Dr Lewei Zhang, a Professor of Oral and Biomedical Sciences at the University of British Columbia.<\/p>\n<p>According to the Oral Cancer Foundation, certain food components help in preventing cancer and sometimes they may even assist the body in fighting cancer if one is already suffering from the disease.<br \/>\nResearchers call these components as chemo-protective agents including a group commonly known as anti-oxidants. They seem to protect the body from the effects of carcinogenic (cancer causing) elements. Two common examples are Vitamin C &amp; E. Both these vitamins have anti-oxidant properties. They help in preventing damage at the DNA level. They also help in the repair of the DNA if it&#8217;s already damaged. The damage to the structure of the DNA is what leads to transforming the cells from normal to malignant.<\/p>\n<p><b>Anti-Oxidants-<\/b> Good sources of anti-oxidants are not very difficult to find. Most of it will be available in our kitchens.<br \/>\nAccording to the American Cancer Society (ACS), a diet that includes many common fruits and vegetables will be rich in preventative agents including anti-oxidants. Most of the fruits and vegetables are excellent sources of vitamins and they are naturally low in fat and have a high fiber content.<\/p>\n<p><b>Phytonutrients-<\/b> Anti-oxidants which are not vitamins are also found in fruits and vegetables and they have strong cancer fighting properties. One of them is Beta-Carotene, a substance which gives color to some vegetables like carrots and peppers and it is converted into Vitamin A by the human body. Beta-Carotene when taken in natural form helps in improving the immune responses in the body by stimulating a molecule that helps the immune system to target and destroy cancer cells. Vitamin A and it&#8217;s nutrients are known to have chemo-protective effects.<\/p>\n<p>The new ACS guidelines lay stress on the need to eat a mixed diet and not any particular food or group of foods. It is also highly recommended to have anti-oxidants in their natural form like fruits and vegetables and not as vitamin supplements. For example, one study has shown that pre-menopausal women who ate natural foods rich in Vitamin A and Carotene were at a reduced risk of Breast Cancer than the women who took only the Vitamin supplements.<\/p>\n<p>Other Compounds such as Bio-flavonoids which are found in apples, onions, tea and red wine are now being studied for cancer fighting properties. Researchers have also found that high levels of soybean consumption are also associated with decreased rates of many types of cancer. According to U.C Irvine College of Medicine&#8217;s clinical study, a chemical derived from Soybean has been found to shrink abnormal growths that lead to oral cancer.<\/p>\n<p>The American Institute for Cancer Research recommends to eat lots of beans, berries, cruciferous vegetables (cabbage and broccoli), dark green leafy vegetables, flaxseed, garlic, grapes, green tea, soy and tomatoes for their role in preventing cancer.<\/p>\n<p><b>Dr. Divya Verma<br \/>\nLead &#8211; Brand &amp; Digital Marketing, Clove Dental<br \/>\nBDS, Msc-Healthcare Management.<\/b><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&#8216;Right now the effects of diets and nutrition in preventing cancer is hot&#8217; as said by Dr Lewei Zhang, a Professor of Oral and Biomedical Sciences at the University of British Columbia. According to the Oral Cancer Foundation, certain food components help in preventing cancer and sometimes they may even assist the body in fighting &hellip; <a href=\"https:\/\/clovedental.in\/blog\/role-of-nutrition-in-preventing-cancer\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Role of Nutrition in Preventing Cancer<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":662,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/700"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=700"}],"version-history":[{"count":4,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/700\/revisions"}],"predecessor-version":[{"id":10519,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/700\/revisions\/10519"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/662"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=700"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=700"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=700"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}