{"id":703,"date":"2015-07-06T09:11:47","date_gmt":"2015-07-06T09:11:47","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=703"},"modified":"2022-02-15T04:54:37","modified_gmt":"2022-02-14T23:24:37","slug":"the-dangers-of-tobacco-use","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/the-dangers-of-tobacco-use\/","title":{"rendered":"The Dangers of Tobacco Use"},"content":{"rendered":"<p>When we think of the dangers associated with tobacco use, we tend to think of lung cancer first. But tobacco use – whether it’s smoked or not – is associated with several types of cancer,<br \/>\nincluding cancer of the tongue, lip and salivary glands.<\/p>\n<p>Early warning signs of oral cancer include non-healing ulcers or white or red patches in the mouth. A burning sensation, the presence of swelling or nodules (small lumps or knots), a change of color inside the mouth, an inability to swallow, or a thickening of the skin of the mouth are also symptoms that are linked to oral cancer. Like other cancers, oral cancer spreads through a process called metastasis, and the first indications are found in the form of nodules in the neck.<\/p>\n<p>Roughly 30% of India’s adult population (15 years and older) uses some form of tobacco according to “Tobacco use in India: an evil with many faces,” a report compiled by the American Cancer Society under the India Cancer Initiative. “Many faces” refers to the various types of smoked and smokeless tobacco products consumed in India, which include beedis, cigarettes, chillum, hookah, chutta, khaini, gutkha, paan with tobacco and paan masala. Each one of them is dangerous.<\/p>\n<p>A dentist is highly qualified to identify these signs and the process of screening for oral cancer is painless. In addition to visiting the dentist on a regular basis, tobacco users should make self-examination a habit. It’s done by examining the mouth in good light to check for ulcers, white or red patches, discoloration of the skin, swellings, lumps or nodules, or thickening of the skin. If self-examination reveals one or more of these symptoms, immediate attention from a healthcare professional is advised.<\/p>\n<p>Most importantly, tobacco users must not let fear stand in the way of regular examinations. The improved outcomes associated with early detection should encourage tobacco users to take action.<\/p>\n<p>By:-<br \/>\nDr. Sumona Pal<br \/>\nOral Medicine &amp; Radiology, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>When we think of the dangers associated with tobacco use, we tend to think of lung cancer first. But tobacco use – whether it’s smoked or not – is associated with several types of cancer, including cancer of the tongue, lip and salivary glands. Early warning signs of oral cancer include non-healing ulcers or white &hellip; <a href=\"https:\/\/clovedental.in\/blog\/the-dangers-of-tobacco-use\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">The Dangers of Tobacco Use<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":664,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/703"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=703"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/703\/revisions"}],"predecessor-version":[{"id":8202,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/703\/revisions\/8202"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/664"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=703"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=703"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=703"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}