{"id":705,"date":"2015-03-10T11:09:02","date_gmt":"2015-03-10T11:09:02","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=705"},"modified":"2022-02-15T04:52:44","modified_gmt":"2022-02-14T23:22:44","slug":"the-right-diet-for-your-teeth-part-i","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/the-right-diet-for-your-teeth-part-i\/","title":{"rendered":"The Right Diet for Your Teeth – Part I"},"content":{"rendered":"<p>An apple a day might keep the doctor away, but it won’t have the same effect on the dentist. Surprising, right?<\/p>\n<p>We all know that some foods are good for our body and some aren’t. The same is true for your oral health: some foods are good for the health of your teeth and gums, and some foods can do damage. So it pays to consider your oral health when choosing the food you eat.<\/p>\n<p>Take care to monitor the ingredients in the food and drinks you consume. One ingredient to watch out for is sugar. It even turns up in the foods we consider to be healthy. For example, red apples actually contain up to 20 grams of sugar.<\/p>\n<p>Sweetened drinks – whether carbonated sodas, sweetened fruit juices or your twice-daily cup of sugary chai – all contribute to tooth decay. Fruit juices can be especially dangerous because we are convinced that they are good for us. A 12-ounce (around 350 ml) serving of grape juice, for example, contains over 58 grams of sugar. (One teaspoon of granulated sugar equals four grams of sugar.)<\/p>\n<h3><strong><a href=\"https:\/\/clovedental.in\/blog\/the-right-diet-for-your-teeth-part-ii\/\">Must read our next post, Part 2 of The Right Diet for Your Teeth<\/a>.<\/strong><\/h3>\n<p>That’s why it pays to read labels and develop an awareness of the sugar content in the foods you eat.<\/p>\n<p>Here are some other sugary drinks and foods to watch out for:<\/p>\n<ul>\n<li>Bottled teas – some have as much as 50 grams of sugar in them.<\/li>\n<li>Milk offers another surprise. It can have as many as 12 grams of sugar per serving.<\/li>\n<li>Bottled pasta sauce can contain as much as 12 grams of sugar.<\/li>\n<li>Be mindful of the amount of sugar present in breakfast cereals and cereal bars. Even those healthy-sounding cereals – the ones that boast about the content of wheat, oats or fiber – can be full of sugar.<\/li>\n<\/ul>\n<p>What about the treats we love? Biscuits, cakes, mithai, ice cream – we know they are full of sugar. Fortunately, the occasional treat won’t do much harm to our teeth, as long as we follow it with a thorough brushing to remove that lingering sugar.<\/p>\n<p>The presence of sugar in your mouth causes acid to attack the teeth for up to an hour after the consumption of a sugary item. This leads to decay, and tooth decay results in the need for fillings, root canal treatments, and if the decay has progressed too far, extractions.<\/p>\n<p>So watch the sugar content in the foods you eat. And when you do indulge, be sure to brush right away to protect your teeth from decay.<\/p>\n<p>By:-<br \/>\nDr. Ritika Singh<br \/>\nConsultant, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>An apple a day might keep the doctor away, but it won’t have the same effect on the dentist. Surprising, right? We all know that some foods are good for our body and some aren’t. The same is true for your oral health: some foods are good for the health of your teeth and gums, &hellip; <a href=\"https:\/\/clovedental.in\/blog\/the-right-diet-for-your-teeth-part-i\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">The Right Diet for Your Teeth – Part I<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":660,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/705"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=705"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/705\/revisions"}],"predecessor-version":[{"id":14790,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/705\/revisions\/14790"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/660"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=705"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=705"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=705"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}