{"id":712,"date":"2015-07-15T10:51:19","date_gmt":"2015-07-15T10:51:19","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?p=712"},"modified":"2022-01-17T15:49:48","modified_gmt":"2022-01-17T10:19:48","slug":"worried-about-oral-cancer-see-your-dentist","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/worried-about-oral-cancer-see-your-dentist\/","title":{"rendered":"Worried about Oral Cancer? See Your Dentist."},"content":{"rendered":"<p style=\"text-align: justify\">India is facing a health crisis with 130,000 people dying every year due to oral cancer. It essentially means that oral cancer kills 14 Indians per hour. This statistic has put India at the epicenter of the oropharyngeal cancer scourge, with the highest rate of prevalence in the world.<\/p>\n<p style=\"text-align: justify\">Oral cancer should not be one of most fatal diseases. If caught early, it is 80% to 90% curable. It is one of the few cancers that do not require a special test, an invasive procedure, or an elaborate equipment to discover it. The subtle tissue changes can be seen with the naked eyes, or felt with fingers. There really is no good reason that it should lie undetected if someone is looking for it.<\/p>\n<p style=\"text-align: justify\">Published studies show that currently less than 25% of those who visit a dentist regularly report having had an oral cancer screening. This is unfortunate. I as a dental surgeon and many like me are here to change that.<\/p>\n<p style=\"text-align: justify\">Dental surgeons are instrumental in early detection of oral cancer. And dental surgeons need to take the leadership role if oral cancer is to be brought down from its high ranking as a killer disease. It has been documented that the greatest impact in battling most cancers has come from increased awareness and aggressive campaigns directed at early detection. For instance, it is now a standard routine to annually get a PAP smear for cervical cancer, a mammogram to check for breast cancer or PSA and digital rectal exams for prostate cancer. These screenings have been successful as a result of increased public awareness combined with motivated doctors for conducting the examination.<\/p>\n<p style=\"text-align: justify\">A cost-effectiveness analysis revealed that an oral cancer visual inspection by trained health workers can be carried out for under $6 per person. The cost of screening is only a small percentage of the burden oral cancer causes on the economic health of the country. Most importantly it keeps the human resource of the country in good health who will in one way or the other contribute to the growth of the economy.<\/p>\n<p style=\"text-align: justify\">It is high time that both general public and dental surgeons realize that a visit to a <a href=\"http:\/\/www.clovedental.in\/\" target=\"_blank\" rel=\"noopener noreferrer\">dental clinic<\/a> can be a matter of life and death.<\/p>\n<p>By:- Dr. Tandeep Malhotra<br \/>\nAssociate Dental Surgeon, Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>India is facing a health crisis with 130,000 people dying every year due to oral cancer. It essentially means that oral cancer kills 14 Indians per hour. This statistic has put India at the epicenter of the oropharyngeal cancer scourge, with the highest rate of prevalence in the world. Oral cancer should not be one &hellip; <a href=\"https:\/\/clovedental.in\/blog\/worried-about-oral-cancer-see-your-dentist\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Worried about Oral Cancer? See Your Dentist.<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":665,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/712"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=712"}],"version-history":[{"count":4,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/712\/revisions"}],"predecessor-version":[{"id":14661,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/712\/revisions\/14661"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/665"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=712"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=712"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=712"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}