{"id":7331,"date":"2018-11-14T10:43:15","date_gmt":"2018-11-14T05:13:15","guid":{"rendered":"https:\/\/clovedental.in\/?p=7331"},"modified":"2019-08-08T13:53:08","modified_gmt":"2019-08-08T08:23:08","slug":"prescriptions-killing","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/prescriptions-killing\/","title":{"rendered":"Are Over Prescriptions killing you?"},"content":{"rendered":"<p align=\"justify\"><span style=\"font-size: medium;\">Strangely, whenever someone has dental pain, they just pop some pills on anyone’s advice; and this is true only for dental pain, and never for chest pain or pain in eye etc. Mostly, the prescriptions are by a local chemist, who never even thinks twice before handing over antibiotics or anti-inflammatory medicines across the counter. In countries abroad, situation is different where one cannot have access to these without a prescription. Dental Surgeons’ use of these drugs has been a subject of concern in many countries, however in India this has remained largely a neglected issue. <\/span><\/p>\n<p align=\"justify\"><a name=\"_GoBack\"><\/a> <span style=\"font-size: medium;\">The US Centre for Disease Control and Prevention (CDC) and also the American Dental Association have been drawing the attention for overuse of the dental prescriptions, to alarming proportions by the dentists. And the CDC had reasons to be worried as the number of prescriptions by dentists rose to 24.9 million during 2014. Similar sentiments have also been expressed by various researchers in India and a recent survey in Hyderabad by K. Pavan Kumar Et. All confirmed that the Antibiotic prescribing practices among the group of dentists was quiet high. And in India, “the overuse of antibiotics mainly amoxicillin, metronidazole, ciprofloxacin, ibuprofen etc by dentists is a huge problem because antibiotics and pain killers are being used indiscriminately for routine prophylactic use, or for pain; meaning thereby that antibiotics are used even before dental treatment has started”, says Lt Gen Vimal Arora, CCO Clove Dental.<\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">To a layman, it seems normal to have medicines when prescribed by doctor; however, the number of times these prescriptions are given without proper justification or without taking proper history should be worrisome. The awareness and knowledge are necessary about harmful effects of overuse of antibiotics and other medications thereby protecting our health and wellbeing. <\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">Emergency Dentistry as a science deals with infection control and pain relief; both of which necessitate the use of the antibiotics and pain killers (either the opiates or the non-steroidal anti-inflammatory pain killers). Dental treatments are generally long and require multiple sittings before the results can be achieved and control of infection and pain during the procedure may require multiple prescriptions. Gen Vimal Arora cautions that a Dentist must manage his prescriptions in a manner that procedures involving need for medications are carried out together within a short span or so thus reducing the risk for overuse. Full mouth rehabilitation cases ae especially at risk for this overuse. It is routine these days for a patient who is getting four root canals, extractions and getting implants placed to be under treatment for almost 6 months and require multiple procedures requiring surgery. However, multiple times the antibiotics are taken is neither necessary nor warranted.<\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">One of the biggest risks from the overuse of multiple medicines is <\/span><span style=\"font-size: medium;\"><i>drug resistance<\/i><\/span><span style=\"font-size: medium;\">. With this frequent usage, the bacteria or the disease-causing organisms ‘develop resistance’ to antibiotics and thereby the medicine does not remain effective anymore. Thus, one has to go for a longer duration medication without effect, requiring shifting to higher antibiotics, which are definitely with additional side effects and highly expensive. The antibiotic resistance is a major concern and cause of many deaths as the medicines just don’t work and the infection does not get controlled. <\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">In addition to the resistance, drug allergies are far too common when the prescriptions are not by experienced specialists who doesn’t have complete knowledge and not elicited proper history. Drug allergies may range from skin rashes, abdominal problems or breathing difficulties. And sometimes, there may also be drug inter-reactions due to the already continuing medicines for some other ailment including life style diseases which may cause major issues.<\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">Antibiotics are used for killing bacteria or the disease causing micro-organisms, however, they do not only kill the bad bacteria but also the good bacteria which are so necessary for our good health especially in the oral cavity and the gut. The <\/span><span style=\"font-size: medium;\"><i>dysbiosis<\/i><\/span><span style=\"font-size: medium;\"> effect which causes imbalance in the quality, quantity and the type of microflora (normal bacteria in our gut) and severely effects function of the <\/span><span style=\"font-size: medium;\"><i>microbiome<\/i><\/span><span style=\"font-size: medium;\"> (the combined good &amp; bad bacteria) leading to increased susceptibility of person to diseases related to immune altered responses. Further, the action of killing the good bacteria generally happens with indiscriminate and long usage of the antibiotics which creates the over growth of some very negative bacteria like <\/span><span style=\"font-size: medium;\"><i>clostridium difficile<\/i><\/span><span style=\"font-size: medium;\"> which causes severe complications often leading to health issues unmanageable by routine methods.<\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">Which antibiotics to prescribe in special patients like during pregnancy, patients undergoing radiation, cardiac intervention, chemo or patients with multiple diseases, patients with prosthetic joints (anyone who has undergone joint replacement surgery) and old age patients. All of them need specific antibiotics and certain antibiotics have to be avoided. Like during pregnancy, tetracycline group of antibiotics have to be avoided completely as they cause gross abnormality in developing teeth. Which medicines can be given without worry needs a thorough knowledge of the disease and the drug’s indications and contra-indications and the pharmacopeia to maintain patient’s safety. Undoubtedly, there is a need for most of the dentists, to have this specified exposures from profession and the drug industry. Any trainings in this direction, which makes their knowledge current will be the step in right direction keeping in mind the large number of new graduates who have had very little patient exposure in colleges. The indiscriminate prescriptions of pain killers also have its share of complications as most of them are habit forming or cause severe allergic reactions, damage to multiple organs and most commonly acidity. Thus, there is no doubt that one has to be vigilant about the prescriptions and the overuse of the drugs.<\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">Routine treatments in dentistry like root canal, impactions, dry sockets, crowning etc are mostly operative in nature and it is easy to avoid the antibiotics, if the surgical procedure is done in its entirety with meticulousness. Covering antibiotics are only necessary if one is not sure of the sterilisation, instruments are not clean, and asepsis is not maintained in the surgery. In institutions and hospitals, there is normally a drug policy, which manages and controls the overuse of antibiotics especially the usage of higher antibiotics for minimal infections. Clove Dental follows stringent policy on the use of Antibiotics and has regular interactions with the doctors across the country to manage this overuse. <\/span><\/p>\n<p align=\"justify\"><span style=\"font-size: medium;\">Antibiotics and analgesics are never to be had at the drop of a hat, rather a conscious discussion with your treating dentist must be done eliciting your complete history of other diseases, any allergies, drug hyper-sensitivity or drug adverse reactions, medications being taken for any other aliment, using the prosthetic joint, having cardiac or neuro insufficiency as well as the clinical presentation of your symptoms before accepting the prescription.<\/span><\/p>\n<p align=\"justify\">By:-<\/p>\n<p><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\"><b>Lt Gen (Dr) Vimal Arora<\/b><\/span><\/span><\/span><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\">;<\/span><\/span><\/span><\/p>\n<p>Chief Clinical Officer, Clove Dental<\/p>\n<p><span style=\"color: #222222;\"><span style=\"font-family: Calibri, sans-serif;\"><span style=\"font-size: medium;\">BDS, MDS, FDS RCPS (Glasgow) <\/span><\/span><\/span><\/p>\n<p><span style=\"font-family: Calibri, sans-serif;\"><span style=\"color: #222222;\"><span style=\"font-size: medium;\">PVSM, AVSM, VSM &amp; Bar (Retd), OSRE (Oman)<\/span><\/span><\/span><\/p>\n\n","protected":false},"excerpt":{"rendered":"<p>Strangely, whenever someone has dental pain, they just pop some pills on anyone’s advice; and this is true only for dental pain, and never for chest pain or pain in eye etc. Mostly, the prescriptions are by a local chemist, who never even thinks twice before handing over antibiotics or anti-inflammatory medicines across the counter. &hellip; <a href=\"https:\/\/clovedental.in\/blog\/prescriptions-killing\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Are Over Prescriptions killing you?<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":7330,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7331"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=7331"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7331\/revisions"}],"predecessor-version":[{"id":7332,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7331\/revisions\/7332"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/7330"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=7331"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=7331"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=7331"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}