{"id":7343,"date":"2018-11-18T15:56:28","date_gmt":"2018-11-18T10:26:28","guid":{"rendered":"https:\/\/clovedental.in\/?p=7343"},"modified":"2019-07-06T17:48:01","modified_gmt":"2019-07-06T12:18:01","slug":"watch-oral-health-diabetes","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/having-diabetes-your-teeth-bones-are-reducing-and-you-dont-even-know-it\/","title":{"rendered":"Watch your Oral Health if you have Diabetes!!"},"content":{"rendered":"<p><strong>Doctor:<\/strong> Good morning ma’am, welcome to Clove Dental, How may we help you today?<\/p>\n<p><strong>Patient:<\/strong> Good morning doctor, from many months I feel all my teeth are shaking, have bad breath and my gums bleed every time I brush. I am just 40 years old and don’t want to lose my teeth. Please help me.<\/p>\n<p><strong>Doctor:<\/strong> Can you please tell me about your medical history and if you are under any medications.<\/p>\n<p><strong>Patient:<\/strong> I am a diabetic and take medications for the same.<br \/>\n(Doctor proceeds to check the patient’s oral cavity….)<\/p>\n<p><strong>Doctor:<\/strong> Ma’am, when was the last time you got a scaling done for your teeth?<\/p>\n<p><strong>Patient:<\/strong> Never doctor. My friends told me that the teeth become weaker after scaling. I am very scared to get the scaling done.<\/p>\n<p><strong>Doctor:<\/strong> Dear ma’am, I will explain you in detail two important points now on the basis of your oral examination.<\/p>\n<p>1. The gums support your teeth above the bone. Therefore, the infection from plaque and tartar spreads from your gums to your bones. You have severe tartar and plaque around all your teeth. They are sitting around the necks of your teeth and have infected the gums and bones. This must have started many years ago and had slowly infected and destroyed the bones surrounding your teeth. This is called “Periodontitis”. Therefore, there is no adequate bone support and your teeth are only standing with the support of the tartar (calculus). In order to reduce the infection, I have to first remove the tartar. This will lead to your teeth shaking more as the support tartar was providing will no more be present. However, if we have to stop the infection and save your teeth from falling we need to remove the source of infection, which is plaque and tartar and let the bones and gums heal.<\/p>\n<p>2. An individual who has diabetes has a slower healing response in gums and bone in presence of plaque and tartar. Therefore, as you have diabetes there is a higher chance that your gums are inflamed from a very long time and the capacity to reduce inflammation and initiate healing is compromised. This had led to a cascade of destructive events spreading the infection to the gums and bones of all teeth. The level of bone has reduced, therefore the support has reduced and the teeth are shaking.<\/p>\n<p><strong>Patient:<\/strong> Thank you doctor, for all this information. I was not aware of these details. I want to get my treatment done now as fast as possible.<\/p>\n<h3>Points to understand if you have diabetes (Evidence-based)<\/h3>\n<ul>\n<li style=\"list-style-type: none;\">The first sign of inflammation: Bleeding gums. Ask your dentist to check if your gums are bleeding.<\/li>\n<li>Notice if your teeth are developing spaces, have pus coming out of gums, bad breath, teeth are becoming loose or experiencing a bad taste in the mouth. Seek your dentist immediately.<\/li>\n<li>Periodontitis affects both children as well as adults with diabetes.<\/li>\n<li>There are diabetics who will have less inflammation in comparison to those who have double to five times the level of inflammation in presence of same levels of oral hygiene. This is because each diabetic has a different level of response to the presence of plaque and tartar (calculus) in the mouth, they are “hyper-responsive”, that is why no two diabetics should compare each other and seek a dentist for an absolute diagnosis.<\/li>\n<li>Diabetes and Periodontitis are interlinked. If your gums are bleeding and are infected, they may be worsening your diabetes status. Extensive research has provided consistent evidence that treatment of periodontitis may improve the HbA1c levels in diabetics.<\/li>\n<li>As the healing is slow in diabetics, regular follow-ups are mandatory to ensure the maintenance of periodontal health.<\/li>\n<\/ul>\n<p>By: Dr. Shikha<\/p>\n<p>Periodontist<\/p>\n<p>Clove Dental<\/p>\n<h3><\/h3>\n","protected":false},"excerpt":{"rendered":"<p>Doctor: Good morning ma’am, welcome to Clove Dental, How may we help you today? Patient: Good morning doctor, from many months I feel all my teeth are shaking, have bad breath and my gums bleed every time I brush. I am just 40 years old and don’t want to lose my teeth. Please help me. &hellip; <a href=\"https:\/\/clovedental.in\/blog\/having-diabetes-your-teeth-bones-are-reducing-and-you-dont-even-know-it\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Watch your Oral Health if you have Diabetes!!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":36,"featured_media":7365,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205,705],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7343"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/36"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=7343"}],"version-history":[{"count":7,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7343\/revisions"}],"predecessor-version":[{"id":7366,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7343\/revisions\/7366"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/7365"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=7343"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=7343"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=7343"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}