{"id":7675,"date":"2018-12-06T17:07:16","date_gmt":"2018-12-06T11:37:16","guid":{"rendered":"http:\/\/clovelive.minddigital.net\/?p=7675"},"modified":"2019-07-06T17:47:49","modified_gmt":"2019-07-06T12:17:49","slug":"mental-health-oral-health-yes-related","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/mental-health-oral-health-yes-related\/","title":{"rendered":"Mental Health and Oral Health: Yes, They Are Related"},"content":{"rendered":"<p>In this modern world where everything is technology driven and is leading to innovations, human mind is also evolving which is leading to stress. Stress in any form is not good for health. It can keep you motivated if is in small ratio but excessive stress can harm you both physically and mentally. The chronic stress is leading to psychological disorders like anxiety, depression and bipolar disorders. The oral and mental health share a two-directional relationship. In one direction, the thought of getting dental treatment creates anxiety. In the other, patients who have a mental illness like chronic depression and bipolar disorders makes them least concerned about the maintenance of their oral health.<\/p>\n\n<p>The primary reason that makes people suffer from mental illness more prone to oral diseases is poor oral hygiene and heavy consumption of sugary beverages. This increases the incidence of caries in these patients. Moreover, they use antidepressants and other antipsychotic medications for their mental disorders that lead to a common side effect of dry mouth or xerostomia that further prevents the teeth and soft tissues in the mouth from being properly lubricated. Saliva acts as a buffer for acidic foods and drinks and contains essential minerals to keep the enamel strong. Hence, a low amount of saliva makes a person more susceptible to decay and other gum problems. The gums and surrounding oral tissues become red in colour because of inflammation, which makes it difficult to eat and follow a proper oral hygiene regimen. Attrition of teeth can be seen commonly in depression patients due to bruxism. On the other hand, poor diet in conjugation with dependency on alcohol and smoking make them prone to oral diseases.<\/p>\n\n<p>Another kind of mental illness which is becoming prominent these days is the bipolar disorder which is characterised by episodes of extreme elation followed by long periods of depression. In the manic phase, overzealous brushing or flossing may cause dental abrasion as well as mucosal or gingival lacerations. Lithium is used as one of the most common therapy for bipolar disorder has been associated with xerostomia and stomatitis (inflammation of oral tissues). Hence, there is a sudden increase in widespread caries partly because of the anticholinergic effects of lithium and other psychotropic medications and partly because of excessive intake of sugar-laden candies and sweetened beverages. Moreover, habitual caffeine intake and heavy smoking heighten the drying effects of antipsychotic drugs.<\/p>\n\n<p>Patients who have mental illness require a very gentle approach for dental treatment as symptoms associated with mental illness might interfere with the acceptance of dental care and patient keep delaying the treatment until the stage of tooth loss. Hence, motivation becomes an integral part of treatment planning.<\/p>\n\n<p>To summarise, it becomes essential for patients who have a mental illness to have regular professional dental care as well as excellent oral care at home. Therefore, brushing twice daily using a soft-bristled toothbrush and toothpaste that contains fluoride is recommended. To manage side effects of dry mouth, salivary substitutes and stimulants like chlorhexidine mouth rinse become an essential part of oral hygiene regimen.<\/p>\n<p>By:-<\/p>\n<p>Dr. Ridhima Seth<\/p>\n<p>General Dentist<\/p>\n<p>Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this modern world where everything is technology driven and is leading to innovations, human mind is also evolving which is leading to stress. Stress in any form is not good for health. It can keep you motivated if is in small ratio but excessive stress can harm you both physically and mentally. The chronic &hellip; <a href=\"https:\/\/clovedental.in\/blog\/mental-health-oral-health-yes-related\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Mental Health and Oral Health: Yes, They Are Related<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":7696,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205,705],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7675"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=7675"}],"version-history":[{"count":1,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7675\/revisions"}],"predecessor-version":[{"id":7676,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7675\/revisions\/7676"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/7696"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=7675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=7675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=7675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}