{"id":7681,"date":"2018-12-11T12:07:15","date_gmt":"2018-12-11T06:37:15","guid":{"rendered":"https:\/\/clovedental.in\/?p=7681"},"modified":"2022-02-15T05:36:57","modified_gmt":"2022-02-15T00:06:57","slug":"dental-implants-good-natural-teeth","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/dental-implants-good-natural-teeth\/","title":{"rendered":"Dental Implants!! As Good as Natural Teeth."},"content":{"rendered":"<p><strong>‘I had a tooth yesterday; I don’t have a tooth today’. . . What do I do???<\/strong><\/p>\n<p>If this is exactly where you stand, you might want to go through this blog to know about the replacement of missing teeth in the most natural way as possible.<\/p>\n\n<p>Missing teeth can lead to a serious impact in a person’s life. The various consequences of missing teeth are:<\/p>\n<ul>\n<li>Loss of chewing\/eating function which can lead to problems in digestion.<\/li>\n<li>Lack of aesthetics which can lead to a lowered self-esteem.<\/li>\n<li>Loss of function of speech which includes slurring of sounds and causes problems in communication.<\/li>\n<li>Tilting of neighbouring teeth- For example- If a lower tooth is missing; the upper tooth tips below and the adjacent teeth try to fill in the spaces. This leads to weakening of bone support of the remaining teeth and their subsequent mobility.<\/li>\n<li>Bad breath since the food gets stuck in missing spaces which are uneasy to clean.<\/li>\n<\/ul>\n\n<p><strong>So What Next???<\/strong><\/p>\n<p>Plan an Extraction- Even before getting a tooth extracted, talk to your dentist about the various treatment options available for getting a replacement of the tooth.<\/p>\n\n<p>The various replacement options available for missing teeth are as follows:<\/p>\n<ul>\n<li>Denture- These are custom made teeth sets which can be easily removed by the patient as and when required. They take support from the structures of the mouth like palate, cheek, remaining teeth and jaw bone.<\/li>\n<\/ul>\n<p>Advantages: Low Cost, Can be given to a person who has any other health issues. 50% Chewing power as compared to natural teeth.<\/p>\n<p>Disadvantages: Removable, puts pressure on the bone, Takes time to get used to, Palatal plate causes slurred speech.<\/p>\n\n<ul>\n<li>Bridge: A dental bridge makes use of the two adjacent healthy teeth at the vicinity of the missing tooth. For example- If your first molar is missing, the support will be borne by the adjacent second molar (at the back) and second premolar (in the front) by trimming it into a smaller structure.<\/li>\n<\/ul>\n<p>Advantages: Fixed, 70-75% chewing power compared to natural teeth.<\/p>\n<p>Disadvantages: Cannot be given for full mouth missing teeth, Healthy teeth are trimmed to accommodate the bridge.<\/p>\n\n<ul>\n<li>Dental Implant: A <a href=\"https:\/\/clovedental.in\/specialties\/dental-implant\/\">dental implant is as close to natural tooth<\/a> as possible. The root of the tooth is replaced by a root of your new tooth which is embedded in the bone called as an implant. Once an implant gets integrated into the bone which takes approximately 3 to 6 months, the final tooth will be delivered and bingo this works as your natural tooth.<\/li>\n<\/ul>\n<p>Advantages: Fixed, 90-98% chewing power as compared to natural teeth, Bone growth over the implant with subsequent time making it stronger with time. Most natural contour of gums around the implant supported tooth which leads to better aesthetics.<\/p>\n<p>Disadvantages: Cannot be done in highly critical bone loss, Cannot be done in patients with systemic diseases like uncontrolled diabetes and chronic smokers.<\/p>\n<p>By:-<\/p>\n<p>Dr. Kritika Jangid<\/p>\n<p>Periodontist &amp; Implantologist<\/p>\n<p>Clove Dental<\/p>\n","protected":false},"excerpt":{"rendered":"<p>‘I had a tooth yesterday; I don’t have a tooth today’. . . What do I do??? If this is exactly where you stand, you might want to go through this blog to know about the replacement of missing teeth in the most natural way as possible. Missing teeth can lead to a serious impact &hellip; <a href=\"https:\/\/clovedental.in\/blog\/dental-implants-good-natural-teeth\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Dental Implants!! As Good as Natural Teeth.<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":7691,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[205,700],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7681"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=7681"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7681\/revisions"}],"predecessor-version":[{"id":14298,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7681\/revisions\/14298"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/7691"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=7681"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=7681"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=7681"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}