{"id":7716,"date":"2018-12-17T10:05:59","date_gmt":"2018-12-17T04:35:59","guid":{"rendered":"https:\/\/clovedental.in\/?p=7716"},"modified":"2022-02-11T11:19:54","modified_gmt":"2022-02-11T05:49:54","slug":"unhealthy-lifestyle-affecting-oral-health","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/unhealthy-lifestyle-affecting-oral-health\/","title":{"rendered":"Is unhealthy lifestyle affecting your Oral Health???"},"content":{"rendered":"<p>Our lifestyle influences every aspect of our life, be it our food habits or our sleeping pattern. Everything we do, has its effects, either good or bad.<\/p>\n<p>In today&#8217;s world, time is a luxury, we can&#8217;t afford. The world around us or should say, the people in it are always running. We try to fit the maximum work in our day, and while doing this we often fall into certain lifestyle patterns.<\/p>\n<p>We want to do everything in a hurry. The “Food” has been transformed into “Fast Food” and our “Sleep” into “Power Naps.”<\/p>\n<p>In this blog, let&#8217;s discuss such lifestyle patterns and its impact on our oral health.<\/p>\n<p><strong><u>JUNK FOODS<\/u><\/strong><\/p>\n<p>Junk food often consists of too much unhealthy fats and carbohydrates. These foods are usually high in calories and low in nutritional value. Frequent consumption of these can lead to heart problems, diabetes or obesity.<\/p>\n<p>There have been researches highlighting the co-relation between heart issues and oral health problems. Diabetes affects the overall health and work capacity of person. It’s an evil, once acquired, you can never get rid of.<\/p>\n<p>Obesity can lead to Sleep Apnea (snoring or irregular sleep patterns due to breathing irregularities.)<\/p>\n<p>Also Read: https:\/\/clovedental.in\/blog\/healthy-recipes-for-healthy-teeth\/<\/p>\n<p><u>CARBONATED DRINKS\/ SUGARY FOODS<\/u><\/p>\n<p>Carbonated drinks are a rich source of sugars and have an acidic PH, which is harmful for our teeth and gums. Similarly, high sugar foods such as doughnuts, pastries, candies, etc. act as an energy source for the bad bacteria in our oral cavity.<\/p>\n<p>Too much consumption can lead to oral cavities, tooth erosions and periodontal health problems (such as bleeding gums, etc.) This can later lead to tooth cavity treatment.<\/p>\n<p><u>SMOKING\/ CHEWING TOBACCO<\/u><\/p>\n<p>Smoking or chewing tobacco leads to staining of teeth, bad breath and reduce taste sensation. Continued smoking habit over a period reduces the healing capacity of the body and make us more vulnerable to infections. It also leads to lung diseases. Smoking not only affects the one doing it, it also can cause similar problems in people around smokers. Passive smoking is also a huge health risk.<\/p>\n<p>Tobacco is carcinogenic in nature. Smokeless tobacco or chewing tobacco especially, increases the risk of oral cancer, leading to deadly conclusions.<\/p>\n<p><u>SHESHA\/ VAPING<\/u><\/p>\n<p>Flavoured hookahs or vapor pens are often assumed healthy as compared to cigarette smoking, because of lack of tobacco.<\/p>\n<p>Potentially reduced but these also have certain health risks. Smoke from vaping pens contains carbon monoxide, polycyclic aromatic hydrocarbons, carcinogenic agents such as heavy metals, etc.<\/p>\n<p>A frequent usage of these still carries a potential threat to our oral as well as over-all health.<\/p>\n<p>Must Read: https:\/\/clovedental.in\/blog\/the-right-diet-for-your-teeth-part-i\/<\/p>\n<p><u>ALCOHOL<\/u><\/p>\n<p>Alcohol abuse or excessive intake causes dryness of mouth, periodontal problems, staining of teeth, cardiovascular and liver diseases.<\/p>\n<p>Drinkers have been found to be at much higher risk of oral cancer, as compared to non-drinkers.<\/p>\n<p>Alcohol drinkers have more tendency for plaque accumulation, further leading to high risk for tooth loss. Researches have emphasised on co-relation between alcohol consumption and depression, memory loss, and reduced healing capacity.<\/p>\n<p><u>BRUSHING HABITS<\/u><\/p>\n<p>Irregular brushing habits can lead to huge array of oral health problems such as bad breath, oral infections, cavities, tooth loosening, etc.<\/p>\n<p>After eating the PH of oral cavity reduces, activating the bad bacteria and putting oral health in a vulnerable position. Hence brushing or rinsing is always advised after meals to neutralize the oral environment.<\/p>\n<p>Brushing twice daily and using mouthwash after brushing helps reducing accumulation of plaque on teeth. Plaque acts as an attachment platform and potential damage sites for bacteria.<\/p>\n<p>Tongue cleaning should also be a regular part of our brushing regimen to reduce risks of diseases like candiasis, hairy tongue, halitosis, etc.<\/p>\n<p><u>STRESS\/ IRREGULAR SLEEP PATTERNS<\/u><\/p>\n<p>High stress can lead to a lot of health issues including oral health problems such as bruxism, TMJ&#8217;s (Temporo-Mandibular Joint disorders).<\/p>\n<p>Insomnia or inability to sleep is also a common result of stressful lifestyle. Lack of sleep or proper rest to the body further accentuates the stress levels leading to vicious cycle of health issues.<\/p>\n<p>Bruxism or grinding of teeth can lead to wearing of tooth surface and resulting in sensitivity or pain.<\/p>\n<p>TMJ&#8217;s or unrelated pains in the ear\/ jaw joint areas are a serious problem. If untreated or ignored it can further lead to attrition of jaw-joint, continuous pain, functional or chewing difficulties, etc.<\/p>\n<p>A healthy lifestyle is an answer to all the above-mentioned problems. Incorporating yoga or meditation or early morning walks into our routine, reducing intake of junk foods or sugary drinks, following proper brushing regimen, avoiding or stopping alcohol or tobacco consumption, following a proper sleep pattern can all lead to a healthy and stress-free lifestyle. Let’s try to do better for ourselves and our body with each passing day.<\/p>\n\n<p>By:-<\/p>\n<p>Dr. Ashima Chugh<\/p>\n<p>Orthodontist, <a href=\"https:\/\/clovedental.in\/\">Clove Dental<\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our lifestyle influences every aspect of our life, be it our food habits or our sleeping pattern. Everything we do, has its effects, either good or bad. In today&#8217;s world, time is a luxury, we can&#8217;t afford. The world around us or should say, the people in it are always running. We try to fit &hellip; <a href=\"https:\/\/clovedental.in\/blog\/unhealthy-lifestyle-affecting-oral-health\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Is unhealthy lifestyle affecting your Oral Health???<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":7719,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205,705],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7716"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=7716"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7716\/revisions"}],"predecessor-version":[{"id":14766,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/7716\/revisions\/14766"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/7719"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=7716"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=7716"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=7716"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}