{"id":8051,"date":"2019-01-29T14:40:32","date_gmt":"2019-01-29T09:10:32","guid":{"rendered":"https:\/\/clovedental.in\/?p=8051"},"modified":"2022-02-11T11:47:23","modified_gmt":"2022-02-11T06:17:23","slug":"unexplained-headache-dental-health-reason","status":"publish","type":"post","link":"https:\/\/clovedental.in\/blog\/unexplained-headache-dental-health-reason\/","title":{"rendered":"Unexplained Headache? Dental Health could be a reason!"},"content":{"rendered":"<p>A 45 year old lady visited Clove Dental as she had severe chronic headache since months.<\/p>\n<p>Sounds weird….Right? Why would she visit a <a href=\"https:\/\/clovedental.in\/\">Dental Clinic<\/a> if suffering from a headache?<\/p>\n<p>Mrs. Sobti happened to go visit a dentist because her daughter read somewhere that unexplained headaches can be because of irregular or crooked teeth.<\/p>\n<p>Since months she was not able to figure out the reason behind her severe headache. She visited, physicians, neurosurgeons, ENT specialist but none of them were able to diagnose the cause to it.<\/p>\n<p>After going through several diagnostic tests like MRI, CT Scan, EEG – Neurosurgeons suggested her to go for an open surgery which would cost her around 2 lacs.<\/p>\n<p>Read More : https:\/\/clovedental.in\/blog\/oral-health-window-overall-health\/<\/p>\n<p>Amidst all this drama kudos to her daughter Tina’s fine sense of judgement. Mrs. Sobti visited Clove Dental clinic where she explained the symptoms which by now she is tired of explaining to every doctor.<\/p>\n<p>The dentist diagnosed full mouth, whole set of teeth and found that her teeth were misaligned. Due to small jaw, her teeth were not properly placed leading to crowding which was constantly triggering the headache all this while.<\/p>\n<p>She was a bit amazed as the treatment plan suggested by the dentist was quite simple and to a greater extent painless. She had to undergo a detailed orthodontic treatment after which not only she was relieved of her headache but got a beautiful smile. Her teeth were corrected which had a positive impact on her personality. She was more confident than before and loved her smile.<\/p>\n<p>Had she not visited a dentist she would have never known of any such connection and might end up undergoing open surgery which would have costed her pots of money without treating her chief complaint.<\/p>\n<p>Dentistry lacks awareness. People are not aware about even the basic dental problems which if not treated in time can lead to major health complication. Even the surgeons or physicist are unaware about the link between Oral Health and General Health as a result they end up suggesting surgeries without even knowing the cause.<\/p>\n<p>Your dental health is as important as regular physical health. It’s not just about getting a cavity filled, it’s about the overall health of an individual.<\/p>\n<p>By:-<\/p>\n<p>Lt. Gen. (Dr) Vimal Arora;<\/p>\n<p>PVSM, AVSM, VSM &amp; Bar (Retd.)<\/p>\n<p>BDS, MDS (Prosthodontist &amp; Implantologist), FDS, RCPS (UK)<\/p>\n<p>Chief Clinical Officer, Clove Dental<\/p>\n\n","protected":false},"excerpt":{"rendered":"<p>A 45 year old lady visited Clove Dental as she had severe chronic headache since months. Sounds weird….Right? Why would she visit a Dental Clinic if suffering from a headache? Mrs. Sobti happened to go visit a dentist because her daughter read somewhere that unexplained headaches can be because of irregular or crooked teeth. Since &hellip; <a href=\"https:\/\/clovedental.in\/blog\/unexplained-headache-dental-health-reason\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Unexplained Headache? Dental Health could be a reason!<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":8064,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[205,705],"tags":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/8051"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=8051"}],"version-history":[{"count":3,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/8051\/revisions"}],"predecessor-version":[{"id":14768,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/posts\/8051\/revisions\/14768"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/8064"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=8051"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/categories?post=8051"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/tags?post=8051"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}