{"id":10612,"date":"2019-12-16T14:23:24","date_gmt":"2019-12-16T08:53:24","guid":{"rendered":"https:\/\/clovedental.in\/?page_id=10612"},"modified":"2021-01-12T17:34:14","modified_gmt":"2021-01-12T12:04:14","slug":"submission-author-guidelines","status":"publish","type":"page","link":"https:\/\/clovedental.in\/submission-author-guidelines\/","title":{"rendered":"Author Guidelines"},"content":{"rendered":"<div class=\"box \">\n<div class=\"row about_the_journal_\">\n<div id=\"journal_sidebar\" class=\"left_Sideabr\">\n<div class=\"theiaStickySidebar\">\n<p><!--\n\n\n<div class=\"news-tab journalNews\">\n\n\n<div class=\"news-tabnav row\">\n\n\n<ul>\n \t\n\n<li><a href=\"\/articles\">Articles<\/a><\/li>\n\n\n \t\n\n<li><a href=\"\/issues\">Issues<\/a><\/li>\n\n\n<\/ul>\n\n\n<\/div>\n\n\n<\/div>\n\n\n--><\/p>\n<div class=\"sidebar_inner\"><a href=\"https:\/\/clovedental.in\/articles\">Articles<\/a><a href=\"\/previous-edition\">Previous Edition<\/a><a href=\"https:\/\/clovedental.in\/journal\">About the Journal<\/a><a href=\"https:\/\/clovedental.in\/editorial-board\">Editorial Board<\/a><a href=\"https:\/\/clovedental.in\/reviewers\">Reviewers<\/a><a href=\"https:\/\/clovedental.in\/journal-downloads\">Downloads<\/a><a class=\"active\" href=\"https:\/\/clovedental.in\/submission-author-guidelines\">Author Guidelines<\/a><a href=\"\/submit-paper\">Submit Your Paper<\/a><\/div>\n<\/div>\n<\/div>\n<div id=\"journal_main_content\" class=\"content_box\">\n<div class=\"theiaStickySidebar\">\n<div class=\"author-guidelines\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li class=\"heading_font\"><strong>NO PLAGIARISM POLICY<\/strong>\n<ul>\n<li class=\"head_guide\">The journal follows a strict no plagiarism policy. Each manuscript undergoes an extensive plagiarism check using a high quality plagiarism detection software. If a submitted manuscript contains more than 10% of plagiarised content, it shall be rejected.<\/li>\n<\/ul>\n<ul>\n<li class=\"heading_font\"><strong>RESEARCH PAPERS<\/strong>\n<ul>\n<li class=\"head_guide\">Randomised controlled trials, intervention studies, studies of screening and diagnostic test, outcome studies, cost effectiveness analyses, case-control series, cohort studies, dissertations and surveys with high response rate. Up to 2500 words excluding references and abstract.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>SHORT COMMUNICATIONS<\/strong>\n<ul>\n<li class=\"head_guide\">Up to 1000 words excluding references and abstract and up to 8 references. A short communication contains only a short report of the case (only pertinent details) and a short discussion and references upto a maximum of 8. Number of figures should be restricted to a maximum of 6.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>CASE REPORTS<\/strong>\n<ul>\n<li class=\"head_guide\">Only New \/ interesting \/ rare cases can be reported. Cases with clinical significance or implications will be given priority, whereas, mere reporting of a rare case may not be considered. Up to 2000 words excluding references and abstract and up to 10 references.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>REVIEW ARTICLES<\/strong>\n<ul>\n<li class=\"head_guide\">Systemic critical assessments of literature and data sources. Up to 3500 words excluding references and abstract.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>LETTERS TO THE EDITOR<\/strong>\n<ul>\n<li class=\"head_guide\">Should be short, decisive observation. They should not be preliminary observations that need a later paper for validation. Up to 400 words and 4 references.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>ANNOUNCEMENTS<\/strong>\n<ul>\n<li class=\"head_guide\"><strong>Announcements of conferences, meetings, courses, awards,<\/strong> and other items likely to be of interest to the readers should be submitted with the name and address of the person from whom additional information can be obtained. Up to 100 words.<\/li>\n<\/ul>\n<\/li>\n<li><strong>SUBMISSION OF THE MANUSCRIPT<\/strong>\n<ul>\n<li class=\"head_guide\">Articles should be submitted via email at <a style=\"color: blue;\" href=\"mailto:journal@clovedental.in\"> journal@clovedental.in <\/a>.<\/li>\n<\/ul>\n<\/li>\n<li><strong>PREPRATION OF THE MANUSCRIPT<\/strong>\n<ul>\n<li class=\"head_guide\">The text of observational and experimental articles should be divided into sections with the headings: Introduction, Methods, Results, Discussion, References, Tables, Figures, Figure legends, and Acknowledgment. Do not make subheadings in these sections.<\/li>\n<li class=\"head_guide\"><strong>The manuscripts should be typed in A4 size MS word document with margins of 25 mm (1 inch) from all the four sides. Use single spacing throughout. Number pages consecutively, beginning with the title page.The language should be British English. The font shall be preferrably Times New Roaman Font Size 12. Use justified alignment.<\/strong><\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>TITLE PAGE<\/strong>\n<p class=\"\">The title page should carry<\/p>\n<ul class=\"head_guides_ul\" style=\"list-style-type: none; margin-left: 0;\">\n<li class=\"head_guides\" style=\"list-style-type: none;\">1. Type of manuscript<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">2. The title of the article, which should be concise, but informative;<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">3. Name of the authors (the way it should appear in the journal), with his or her highest academic degree(s) and institutional affiliation;<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">4. The name of the department(s) and institution(s) to which the work should be attributed;<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">5. The name, address, phone numbers, facsimile numbers, and e-mail address of the contributor responsible for correspondence about the manuscript;<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">6. The total number of pages, total number of photographs and word counts separately for abstract and for the text (excluding the references and abstract).<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">7. Source(s) of support in the form of grants, equipment, drugs, or all of these; and<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">8. If the manuscript was presented as part at a meeting, the organisation, place, and exact date on which it was read.<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">9. Conflict of Interest, if any in detail<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">10. Acknowledgements in detail<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>ABSTRACT<\/strong>\n<ul>\n<li class=\"head_guide\">The second page should carry the full title of the manuscript and an abstract (of no more than 150 words for case reports, brief reports and 250 words for original articles). The abstract should be structured and state the Objectives, Settings and Design, Materials and Methods, Statistical analysis used, Results and Conclusions. Below the abstract should provide 3 to 10 key words.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>INTRODUCTION<\/strong>\n<ul>\n<li class=\"head_guide\">State the purpose of the article and summarize the rationale for the study or observation.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>MATERIALS AND METHODS<\/strong>\n<ul>\n<li class=\"head_guide\">Describe the selection of the observational or experimental subjects (patients or laboratory animals, including controls) clearly. Identify the age, sex, and other important characteristics of the subjects. Identify the methods, apparatus (give the manufacturer&#8217;s name and address in parentheses), and procedures in sufficient detail. Give references to established methods, including statistical methods; provide references and brief descriptions for methods that have been published but are not well known; describe new or substantially modified methods, give reasons for using them, and evaluate their limitations. Identify precisely all drugs and chemicals used, including generic name(s), dose(s), and route(s) of administration.<\/li>\n<li class=\"head_guide\">Reports of randomised clinical trials should present information on all major study elements, including the protocol, assignment of interventions (methods of randomization, concealment of allocation to treatment groups), and the method of masking (blinding), based on the CONSORT statement (Moher D, Schulz KF, Altman DG: The CONSORT Statement Revised). Authors submitting review manuscripts should include a section describing the methods used for locating, selecting, extracting, and synthesising data. These methods should also be summarised in the abstract. Surveys should follow the STROBE guidelines.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>VERY IMPORTANT: <\/strong>\n<ul>\n<li class=\"head_guide\">Please note that as per the regulations of the Government of India Notification via its Gazette publication dated 8th February 2013, all trials (human or as applicable) need to be registered with Clinical trial registry of India. The IRB\/ IEC need to be registered with appropriate authorities. It is assumed that all Indian authors’ research work complies with this government policy\/rules and regulations. All manuscript are published under good faith that all rules and regulations have been complied.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>RESULTS<\/strong>\n<ul>\n<li class=\"head_guide\">Present the results in logical sequence in the text, tables, and illustrations. Do not repeat in the text all the data in the tables or illustrations; emphasise or summarise only important observations.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>DISCUSSION<\/strong>\n<ul>\n<li class=\"head_guide\">Emphasize the new and important aspects of the study and the conclusions that follow from them. Do not repeat in detail data or other material given in the Introduction or the Results section. Include in the Discussion section the implications of the findings and their limitations, including implications for future research. Relate the observations to other relevant studies. In particular, contributors should avoid making statements on economic benefits and costs unless their manuscript includes economic data and analyses. Avoid claiming priority and alluding to work that has not been completed. State new hypotheses when warranted, but clearly label them as such. Recommendations, when appropriate, may be included.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>ACKNOWLEDGMENTS<\/strong>\n<ul class=\"head_guides_ul\" style=\"margin-left: 0;\">\n<li class=\"head_guides\" style=\"list-style-type: none;\">1. Contributions that need acknowledging but do not justify authorship, such as general support by a departmental chair;<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">2. Acknowledgments of technical help; and<\/li>\n<li class=\"head_guides\" style=\"list-style-type: none;\">3. Acknowledgments of financial and material support, which should specify the nature of the support. This should be the last page of the manuscript.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>REFERENCES<\/strong>\n<ul>\n<li class=\"head_guide\">References should be numbered consecutively in the order in which they are first mentioned in the text (not in alphabetic order). Identify references in text, tables, and legends by Arabic numerals in superscript. References cited only in tables or figure legends should be numbered in accordance with the sequence established by the first identification in the text of the particular table or figure. Use the style of the examples below, which are based on the formats used by the NLM in Index Medicus. The titles of journals should be abbreviated according to the style used in Index Medicus. Use complete name of the journal for non-indexed journals. Avoid using abstracts as references. Information from manuscripts submitted but not accepted should be cited in the text as &#8220;unpublished observations&#8221; with written permission from the source. Avoid citing a &#8220;personal communication&#8221; unless it provides essential information not available from a public source, in which case the name of the person and date of communication should be cited in parentheses in the text. For scientific articles, contributors should obtain written permission and confirmation of accuracy from the source of a personal communication. If the number of authors is more than six, list the first six authors followed by et al.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p class=\"sub_head_p\">Journal references<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li class=\"head_guide top_space\"><strong>Standard journal article<\/strong>\n<ul>\n<li class=\"head_guide\">Kulkarni SB, Chitre RG, Satoskar RS. Serum proteins in tuberculosis. J Postgrad Med 1960; 6:113-120.<\/li>\n<\/ul>\n<\/li>\n<li class=\"head_guide\"><strong>Volume with supplement<\/strong>\n<ul>\n<li class=\"head_guide\">Shen HM, Zhang QF. Risk assessment of nickel carcinogenicity and occupational lung cancer. Environ Health Perspect 1994; 102 Suppl 1:275-282.<\/li>\n<\/ul>\n<\/li>\n<li class=\"head_guide\"><strong>Issue with supplement<\/strong>\n<ul>\n<li class=\"head_guide\">Payne DK, Sullivan MD, Massie MJ. Women&#8217;s psychological reactions to breast cancer. Semin Oncol 1996; 23(1, Suppl 2):89-97.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<p class=\"sub_head_p\">Books and Other Monographs<\/p>\n<ul>\n<li style=\"list-style-type: none;\">\n<ul>\n<li class=\"head_guide top_space\"><strong>Personalauthor(s)<\/strong>\n<ul>\n<li class=\"head_guide\">Ringsven MK, Bond D. Gerontology and leadership skills for nurses. 2nd ed. Albany (NY): Delmar Publishers; 1996.<\/li>\n<\/ul>\n<\/li>\n<li><strong>Editor(s), compiler(s) as author<\/strong>\n<ul>\n<li class=\"head_guide\">Norman IJ, Redfern SJ, editors. Mental health care for elderly people. New York: Churchill Livingstone; 1996.<\/li>\n<\/ul>\n<\/li>\n<li><strong>Chapter in a book<\/strong>\n<ul>\n<li class=\"head_guide\">Phillips SJ, Whisnant JP. Hypertension and stroke. In: Laragh JH, Brenner BM, editors. Hypertension: pathophysiology, diagnosis, and management. 2nd ed. New York: Raven Press; 1995. pp 465-478.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>Tables<\/strong>\n<p class=\"\">Tables should be self-explanatory and should not duplicate textual material.<\/p>\n<ul class=\"head_guides_ul\">\n<li class=\"head_guides\">Tables with more than 10 columns and 25 rows are not acceptable.<\/li>\n<li class=\"head_guides\">Type or print out each table with double spacing on a separate sheet of paper. If the table must be continued, repeat the title on a second sheet followed by &#8220;(contd.)&#8221;.<\/li>\n<li class=\"head_guides\">Number tables, in Arabic numerals, consecutively in the order of their first citation in the text and supply a brief title for each.<\/li>\n<li class=\"head_guides\">Place explanatory matter in footnotes, not in the heading.<\/li>\n<li class=\"head_guides\">Explain in footnotes all non-standard abbreviations that are used in each table.<\/li>\n<li class=\"head_guides\">Obtain permission for all fully borrowed, adapted, and modified tables and provide a credit line in the footnote.<\/li>\n<li class=\"head_guides\">For footnotes use the following symbols, in this sequence: *, †, ‡, §, ¦,  *,*, ††, ‡‡<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>ILLUSTRATIONS (FIGURES)<\/strong>\n<ul class=\"head_guides_ul\">\n<li class=\"head_guides\">Figures should be numbered consecutively according to the order in which they have been first cited in the text.<\/li>\n<li class=\"head_guides\">Symbols, arrows, or letters used in photomicrographs should contrast with the background and should mark neatly with transfer type or by tissue overlay and not by pen.<\/li>\n<li class=\"head_guides\">Titles and detailed explanations belong in the legends for illustrations not on the illustrations themselves.<\/li>\n<li class=\"head_guides\">When graphs, scatter-grams or histograms are submitted the numerical data on which they are based should also be supplied.<\/li>\n<li class=\"head_guides\">If photographs of people are used, either the subjects must not be identifiable or their pictures must be accompanied by written permission to use the photograph.<\/li>\n<li class=\"head_guides\">If a figure has been published, acknowledge the original source and submit written permission from the copyright holder to reproduce the material. A credit line should appear in the legend for figures for such figures.<\/li>\n<li class=\"head_guides\">The Journal reserves the right to crop, rotate, reduce, or enlarge the photographs to an acceptable size.<\/li>\n<li class=\"head_guides\">Submit good quality color images.<\/li>\n<li class=\"head_guides\">All image formats (jpeg, tiff, gif, bmp, png, eps, etc.) are acceptable; jpeg is most suitable.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>PRIVACY POLICY<\/strong>\n<ul>\n<li class=\"head_guide\">Identifying information should not be published in written descriptions, photographs, sonograms, CT scans, etc., and pedigrees unless the information is essential for scientific purposes and the patient (or parent or guardian) gives written informed consent for publication. Informed consent for this purpose requires that the patient be shown the manuscript to be published. When informed consent has been obtained, it should be indicated in the article and copy of the consent should be attached in PDF format.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>COPYRIGHTS<\/strong>\n<ul>\n<li class=\"head_guide\">The whole of the literary matter is the copyright of the Editorial Board. The Journal, however, grants to all users a free, irrevocable, worldwide, perpetual right of access to, and a license to copy, use, distribute, perform and display the work (either in pre-print or post-print format) publicly and to make and distribute derivative works in any digital medium for any reasonable non-commercial purpose, subject to proper attribution of authorship and ownership of the rights. The journal also grants the right to make small numbers of printed copies for their personal non-commercial use. The copyright form mentioning the name of all the authors and duly signed by the corresponding author on behalf of all authors should be submitted along with the manuscript. The form is available under the DOWNLOADS section.<\/li>\n<\/ul>\n<\/li>\n<li class=\"heading_font\"><strong>CONFLICT OF INTEREST:<\/strong>\n<ul>\n<li class=\"head_guide\">Conflict of interest declaration should be signed by all authors and duly submitted. The form is available under the DOWNLOADS section.<\/li>\n<li class=\"head_guide\"><\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/div>\n<\/div>\n<\/div>\n<\/div>\n<p><!-- about the journal end here --><\/p>\n<\/div>\n<p><script type=\"text\/javascript\" src=\"\/\/code.jquery.com\/jquery-1.11.0.min.js\"><\/script><br \/>\n<script src=\"\/wp-content\/themes\/clove-child\/js\/ResizeSensor.min.js\"><\/script><br \/>\n<script src=\"\/wp-content\/themes\/clove-child\/js\/theia-sticky-sidebar.min.js\"><\/script><br \/>\n<script type=\"text\/javascript\">\n    $('#journal_main_content,#journal_sidebar').theiaStickySidebar({additionalMarginTop:100});\n<\/script><\/p>\n<style>\n.row:before,.row:after{ content:'';display:table;clear:both;}.journalNews{width:100%;display:block;padding:0;}.journalNews .news-tabnav li {float: left;display: inline-block;width: 49%;margin:0;}.journalNews .news-tabnav li:first-child{margin-right:2%;}.journalNews .news-tabnav li a:before{content: \"\\f0d7\";position: absolute;left: 50%;bottom: -12px;font-size: 40px;color:#4e3224; margin-left:-12px;z-index: 9;}.journalNews .news-tabnav{margin-bottom:12px;float:none;}.about_the_journal_{width:100%;position:relative;}.about_the_journal_ .left_Sideabr{width:100%;max-width:280px;position:absolute !important;left:0;top:0;z-index:9;}.about_the_journal_ .content_box{width:100%;padding:20px;position:relative;padding-left:310px;}.sidebar_inner{width:100%;}.about_the_journal_ .left_Sideabr a{display: block;width: 100%;padding: 16px 20px;margin-bottom: 5px;background-color: #4e3224;height: auto;color: #ff8001;font-size: 16px;line-height: 17px;text-align: left;border-radius:4px;}.about_the_journal_ .left_Sideabr a.active,.about_the_journal_ .left_Sideabr a:hover{background-color:#ff8001;color:#fff;}.author-guidelines{margin-top: -20px;text-align:justify;}.author-guidelines h4{margin-bottom:10px;}.author-guidelines ul{margin-bottom:20px;}.author-guidelines li{font-size: 14px;line-height: 24px;\/*background: url(https:\/\/reinventmedia.in.md-46.webhostbox.net\/clove\/wp-content\/themes\/clove-child\/images\/img_bulits.png) left 3px no-repeat;padding-left: 28px;*\/margin-bottom: 10px;}.author-guidelines ol{padding-bottom:20px;}.author-guidelines p{font-size: 14px;line-height: 24px;margin-bottom: 10px;font-weight: 600;}.head_guide{background: none!important;list-style-type: none;padding-left: 0!important;}.head_guides{background: none!important;list-style-type: disc;padding-left: 0!important;}.head_guides_ul{margin-left: 18px;}.heading_font{font-size:17px!important;}.sub_head_p{font-size:16px!important;font-weight:700!important;}.top_space{margin-top:-10px;}@media only screen and (max-width: 767px){.journal_editorsBox{margin-top: auto;}} @media screen and (max-width:1300px){.about_the_journal_ .left_Sideabr{left:20px;}.about_the_journal_ .content_box{padding-left:330px;}}@media screen and (max-width:992px){.about_the_journal_ .left_Sideabr{left:20px;max-width:200px;}.about_the_journal_ .left_Sideabr a{font-size:14px;line-height:15px;padding:15px 15px;}.about_the_journal_ .content_box{padding-left:250px;}}@media screen and (max-width:767px){.about_the_journal_ .left_Sideabr{position:static !important;margin:0 auto 20px;}.about_the_journal_ .content_box{padding-left:20px;}}<\/style>\n","protected":false},"excerpt":{"rendered":"<p>ArticlesPrevious EditionAbout the JournalEditorial BoardReviewersDownloadsAuthor GuidelinesSubmit Your Paper NO PLAGIARISM POLICY The journal follows a strict no plagiarism policy. Each manuscript undergoes an extensive plagiarism check using a high quality plagiarism detection software. If a submitted manuscript contains more than 10% of plagiarised content, it shall be rejected. RESEARCH PAPERS Randomised controlled trials, intervention studies, &hellip; <a href=\"https:\/\/clovedental.in\/submission-author-guidelines\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Author Guidelines<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":10611,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/10612"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=10612"}],"version-history":[{"count":31,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/10612\/revisions"}],"predecessor-version":[{"id":13411,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/10612\/revisions\/13411"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/10611"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=10612"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}