{"id":109,"date":"2016-12-07T09:22:05","date_gmt":"2016-12-07T09:22:05","guid":{"rendered":"http:\/\/192.168.1.98\/clove_new\/?page_id=109"},"modified":"2022-01-13T17:48:17","modified_gmt":"2022-01-13T12:18:17","slug":"about-us","status":"publish","type":"page","link":"https:\/\/clovedental.in\/about-us\/","title":{"rendered":"About Us"},"content":{"rendered":"<div class=\"ceo-overlay\">\n<div class=\"ceo-main\">\n<div class=\"close\"><\/div>\n<div class=\"ceo-inner scroll-pane\">\n<h3>CEO Message<\/h3>\n<p>Oral health of Indian’s lag behind most nations, including many developing nations. Dentistry is a highly specialized and intricate medical profession, where Dentist work on very small surfaces to try and repair micro decay. There are six specialities in Dentistry, each requiring a three year Master’s degree, making Dentistry one of the most complex medical field.<\/p>\n<p>We as consumers or normal “non-dentist” citizens, often have no idea of how difficult it is to go in and repair a tooth that is about 2 cm in size. We often don’t realize that Dentistry involved saliva and blood and therefore Sterilization and Hygiene are of utmost important. Moreover, when working on such small surfaces, technology plays a critical role and over the last ten years new technology has enabled dentist across the globe to deliver highly innovative dental solutions to patients.<\/p>\n<p>In 2011, while visiting a highly respected Dental clinic in Delhi, I, as a patient was horrified to see the poor hygiene and sterilization protocols and use of archaic technology. It is then, I decided that I will relocate back to India from Silicon Valley, in the US, and build an ethical, transparent and high-quality dental network. Clove Dental opened its first clinic in September of 2011 and by December 2021, had grown to over 340+ clinics across 11 states in India.<\/p>\n<h4>The growth of our network of clinics was based on our core fundamental principles<\/h4>\n<ul>\n<li><strong>QUALITY:<\/strong> We have the latest technology and India’s smartest and most capable Dental Sugeons. Our Hygiene and Sterilization protocols are at par, if not better, than Dental Clinics in Europe and USA. All our clinics are audited twice a month to ensure protcols are followed at all times and Dental treatments are reviewed by our Dentist panels to ensure right treatment is delivered to each patient at the right time for the right cost.<\/li>\n<li><strong>CONVENIENCE:<\/strong> Our clinics are in local neighbourhoods and are open on weekends and until late evenings, to ensure that our patients can visit a dentist without the need to take a day off from work which they rather spend with family or on holidays.<\/li>\n<li><strong>VALUE:<\/strong> All our clinics use the best materials (such as 3M compounds, Swiss made dental implants, etc.) and our Dentists are on salary with quality and service related incentives to ensure that they deliver the best value and care to our patients. We are able to procure our equipment and consumables at better costs than smaller clinics and therefore we are able to deliver better products at prices much lower than others for the same treatment.<\/li>\n<\/ul>\n<p>Our growth has been phenomenal, and that has been possible based on the trust of over five lac patients who have already trusted us with their dental health and the dedication of our professional staff and Dentists.<\/p>\n<p>The biggest challenge we face is how soon can we bring high-quality dentistry in every neighbourhood across India. Our goal is to get to 1000 clinics by 2025 that will enable us to get ready for 6000 clinics soon thereafter, enabling us to bring professional, ethical and high-quality dentistry to every Indian neighbourhood. Thank you for giving us your confidence.<\/p>\n<div class=\"client-text\">Humbly Yours Amar Singh, Chairman &amp; CEO Clove Dental<\/div>\n<\/div>\n<\/div>\n<\/div>\n<div class=\"row\">\n<div class=\"imgbox\"><img class=\"alignnone size-medium wp-image-370\" src=\"https:\/\/clovedental.in\/wp-content\/uploads\/2017\/05\/img-ceo-5.jpg\" alt=\"Clove Dental\" \/><\/div>\n<div class=\"textbox\">\n<h2>CEO Message<\/h2>\n<p>Oral health of Indian’s lag behind most nations, including many developing nations. Dentistry is a highly specialized and intricate medical profession, where Dentist work on very small surfaces to try and repair micro decay. There are six specialities in Dentistry, each requiring a three year Master’s degree, making Dentistry one of the most complex medical field.<\/p>\n<p>We as consumers or normal “non-dentist” citizens, often have no idea of how difficult it is to go in and repair a tooth that is about 2 cm in size. We often don’t realize that Dentistry involved saliva and blood and therefore Sterilization and Hygiene are of utmost important. Moreover, when working on such small surfaces, technology plays a critical role and over the last ten years new technology has enabled dentist across the globe to deliver highly innovative dental solutions to patients.<br \/>\n<span class=\"ceo-read\">Read more<\/span><\/p>\n<\/div>\n<\/div>\n<div class=\"row\">\n<div class=\"imgbox right\"><img loading=\"lazy\" width=\"800\" height=\"800\" class=\"alignnone size-medium wp-image-1865\" src=\"https:\/\/clovedental.in\/wp-content\/uploads\/2016\/12\/cco_message.png\" alt=\"Clove Dental\" srcset=\"https:\/\/clovedental.in\/wp-content\/uploads\/2016\/12\/cco_message.png 800w, https:\/\/clovedental.in\/wp-content\/uploads\/2016\/12\/cco_message-150x150.png 150w, https:\/\/clovedental.in\/wp-content\/uploads\/2016\/12\/cco_message-300x300.png 300w, https:\/\/clovedental.in\/wp-content\/uploads\/2016\/12\/cco_message-768x768.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/div>\n<div class=\"textbox\">\n<h2>CCO Message<\/h2>\n<p>“Clove Dental Clinics represent new standards in Dental Care; standards that emphasize quality, convenience and transparency. For the last ten years, Clove Dental has been working towards redefining the Oral Health Care delivery system in India by introducing patients to technologically enabled painless dentistry parallel to the best in the world. We have developed end to end dental solutions with our own Clinical setups, Dental Laboratory, Quality Control &amp; Management, In-house Training &amp; dedicated Software for Patient Management. Our Clinics across the Country offer an entire range of Dental Care; from restorative treatments like fillings and root canal to complex Oral and maxillofacial surgery to the latest cosmetic treatment modules at an affordable price. The team of Dentists at Clove are highly qualified and regularly trained in best international practices in Dentistry.”<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>CEO Message Oral health of Indian’s lag behind most nations, including many developing nations. Dentistry is a highly specialized and intricate medical profession, where Dentist work on very small surfaces to try and repair micro decay. There are six specialities in Dentistry, each requiring a three year Master’s degree, making Dentistry one of the most &hellip; <a href=\"https:\/\/clovedental.in\/about-us\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">About Us<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":272,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"about-us.php","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/109"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=109"}],"version-history":[{"count":27,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/109\/revisions"}],"predecessor-version":[{"id":14649,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/109\/revisions\/14649"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/272"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=109"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}