{"id":3287,"date":"2017-06-23T11:35:16","date_gmt":"2017-06-23T11:35:16","guid":{"rendered":"http:\/\/minddigital.net\/clove_new\/?page_id=3287"},"modified":"2020-10-16T20:25:28","modified_gmt":"2020-10-16T14:55:28","slug":"refund-policy","status":"publish","type":"page","link":"https:\/\/clovedental.in\/refund-policy\/","title":{"rendered":"Refund &#038; Re-treatment Policy"},"content":{"rendered":"<div class=\"box\">\n<div class=\"refund\">\n<h3>Policy on Refunds &amp; Re-treatment<\/h3>\n<h4>REFUND POLICY<\/h4>\n<p>Refunds will be available when there is a wrong payment or swiping of card into Clove account. Refunds are also available when there is a change in patient’s general medical condition like Cardiac, Pulmonary or Endocrinal etc, rendering the patient unsuitable for said treatment.<\/p>\n<p>Dental treatment outcome (much like all medical) depends on many factors including condition and progress of under-lying disease, patient’s biology, pre-and post-treatment care and patient’s compliance. If Clove Dental management, subject to review by the Clove Dental Quality Processes, determines that treatment outcome could have been better, they under sole discretion may approve refunds.<\/p>\n<p><strong>Refunds (2 Modes):<\/strong> Credit to patient’s Bank (takes 15-30 days) or patient may choose ‘Clove Credit Cover’.<br \/>\nClove Credit Cover: It is quicker &amp; they can use their money for any alternate treatment for self or for anyone else:<\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> What is it: Refund will be credited in patient’s Clove Account, which may be used for any treatment within one year for the patient or anyone known to patient and may transfer same to anyone by an e-mail to Clove.<br \/>\n<strong>2.<\/strong> Clove Credit Advantages: ‘No deductions will be done for Consultations, x-rays, diagnosis &amp; treatment planning except for treatment carried out like scaling, extraction, lab work etc.<\/p>\n<p><strong>Refund Process<\/strong> (Time required for the process to complete 15-30 days)<\/p>\n<div class=\"refund_padding\">\n<p><strong>1.<\/strong> Refund process will start once written request is received from patient with reasons. Request should have been initiated within 6 months.<br \/>\n<strong>2.<\/strong> For Refund: Patient will submit documents, receipts, x-rays. Patient will also return clove delivered dentures, crowns, aligners, failed implants, ortho appliances if any, to the treating clinic for which refund is asked. No refund will be eligible if there is a loss of prosthesis or failure to return the implant.<br \/>\n<strong>3.<\/strong> Clove Quality Team will review refund request based on all facts &amp; patient-provided records pertaining to the underlying condition and reserves full and complete right to approve the above.<br \/>\n<strong>4.<\/strong> Consultations, x-rays, diagnosis &amp; treatment planning, membership plans are not eligible for refund; these will be deducted. Lab charges for prosthesis, aligners, crowns, dentures etc. will also be deducted.<\/p>\n<\/div>\n<p><strong>Refund Claims will not be eligible:<\/strong><\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> Treatment has started \/ part completed \/ prosthesis fitted or the implant, brackets or crowns have been ordered.<br \/>\n<strong>2.<\/strong> Patient does not report for treatment for long time and condition deteriorates or the fit has changed; like in cases of dentures, crowns, aligners etc.<br \/>\n<strong>3.<\/strong> 6 months have passed since the treatment is over or the patient gets treatment done at any clinic outside Clove.<br \/>\n<strong>4.<\/strong> Patient did not comply with instructions or failed to report for further treatment like in implants or wear retention plates in Orthodontic treatment as advised.<br \/>\n<strong>5.<\/strong> Aligners: If impressions or scan has been done and the aligners have been ordered.<br \/>\n<strong>6.<\/strong> If the Aligner \/ crown \/ denture has not been collected by the patient and the ‘fit has changed’, due to shifting of teeth, requiring new measurements.<br \/>\n<strong>7.<\/strong> If the treatment is booked under ‘zero interest’ finance schemes.<\/p>\n<p><strong>Warranty treatments:<\/strong><\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> Crowns\/ bridges under warranty by Lab: Warranty is limited to free replacement of prosthesis (crown, bridge) during warranty if it cracks, chips or comes out. Crown will have to be returned to avail warranty.<br \/>\n<strong>2.<\/strong> Wherever, the crown or prosthesis is lost, cost of remaking will be charged.<br \/>\n<strong>3.<\/strong> Warranty is for the crown only and not for tooth. Pain in tooth does not qualify for refunds towards the Crown.<br \/>\n<strong>4.<\/strong> The warranty does not cover tooth fracture, tooth disease or toothache.<\/p>\n<p><strong>Compulsory Deductions for Aligners\/Orthodontic\/Implant\/Other Treatment:<\/strong><\/p>\n<table class=\"refund-aligner\">\n<tbody>\n<tr>\n<td><strong>1<\/strong><\/td>\n<td>Cancellation of Aligners work<\/td>\n<td>– Rs 10,000<\/td>\n<\/tr>\n<tr>\n<td><strong>2<\/strong><\/td>\n<td>Cancellation of Implant \/ Orthodontic treatment<\/td>\n<td>– Rs 5,000<\/td>\n<\/tr>\n<tr>\n<td><strong>3<\/strong><\/td>\n<td>For any other Treatment<\/td>\n<td style=\"width: 140px;\">– Rs 3,000<\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<h4>RE-TREATMENT POLICY (Re-treatments)<\/h4>\n<p>‘Clove Dental’ always aims to ensure best clinical practices by highly qualified and trained doctors in its clinics. However, if the prognosis\/outcome of any treatment is not on the desired lines, due to various limitations.<\/p>\n<p><strong>Re-treatment will be undertaken on priority by Clove Dental in case:<\/strong> (limited to 6 months unless otherwise specified)<\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> There is Loss of filling, breakage of appliance or cementation failure.<br \/>\n<strong>2.<\/strong> When treatment outcome is not as per patient’s satisfaction – Patient should have been regular in appointments and post-operative check-ups and followed instructions and not done anything contrary to instructions. However, if the patient has not complied with appointments and\/or instructions as specified by the dental surgeon during the treatment, leading to a situation resulting in need of additional procedure to rectify the presented situation, difference in costs will be paid for by the patient. If the cost of re-treatment is higher than previously paid, differential amount will be paid by the patient.<br \/>\n<strong>3.<\/strong> In case of failed treatment: Re-treatment or alternate treatment at any Clove Clinic within 6 months will be undertaken.<br \/>\n<strong>4.<\/strong> Patient should not have got any treatment done from a clinic other than Clove Dental clinic to qualify for the re-treatment.<\/p>\n<p><strong>Orthodontic Patient’ will qualify for Re-treatment: Within 1 yr of completion of treatment if:<\/strong><\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> Patient has complied with the timely appointments and review visits, reported immediately on breakages of brackets\/appliances, worn the retainers and\/or aligners as advised and not delayed the visits to dentists. Failure to do so causes relapse or prolong the treatment, which is not covered under re-treatment.<br \/>\n<strong>2.<\/strong> Will not Qualify: If the patient stops coming (for 4 months at a stretch) after the treatment has started, the company will be at liberty to cancel the treatment.<\/p>\n<p><strong>Implant Patient’ will qualify for Re-treatment:<\/strong> Within 1 yr of completion of treatment if:<\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> Patient has come for balance treatment in time, both for Implant surgery or for fixing crowns or teeth etc.<br \/>\n<strong>2.<\/strong> Patient must have followed post-operative instructions, maintained normal blood parameters specially Serum Calcium &amp; Vit D &amp; abstained from smoking.<br \/>\n<strong>3.<\/strong> Diabetic or hypertension patients should have come for timely post-operative check-ups every month till prosthesis is fitted and then every alternate month for one year.<br \/>\n<strong>4.<\/strong> Will not Qualify: If the patient has delayed coming to get the balance treatment done (implant surgery\/fixing teeth), re-treatment will not be eligible. Additional costs will be applicable as per procedure.<\/p>\n<p><strong>Patient Relocates to Other City\/Country<\/strong><\/p>\n<p class=\"refund_padding\"><strong>1.<\/strong> Treatment will be continued, or the Re-Treatment will be undertaken at any Clove Clinic across the country after consultation by Clove Doctor, subject to approval by the Management on case to case basis.<br \/>\n<strong>2.<\/strong> For Ortho &amp; Implant Patients – If Clove Clinic has ‘No In-house specialist’ of that specialty, in that city, patient will have to bear the visitation charges for external specialist. Further, if there is ‘No Clove Clinic’ in the city, where patient relocates, no refunds will be admissible, and treatment will only be given in the closest Clove Clinics.<\/p>\n<h4>MANAGEMENT RIGHTS<\/h4>\n<p>In case a patient has made any attempt to defame Clove or the doctors of Clove, management reserves the right to reject the claim for refund or retreatment. Clove Dental Management reserves the right to accept or reject any refund claim based on the clinical findings &amp; patient history. Management has also the right to accept or reject any Re-treatment if the patient has not followed the instructions. Disputes if any are subject to exclusive Jurisdiction of Delhi courts, where the company has its registered office.<\/p>\n<\/div>\n<\/div>\n<style>\n.refund-aligner{border:1px solid;}.refund-aligner td{border:1px solid;padding:10px 7px}.refund h3{font-size:25px;}@media only screen and (max-width: 767px){.refund h3 {    font-size: 20px;   margin-bottom: 5px;}}<\/style>\n","protected":false},"excerpt":{"rendered":"<p>Policy on Refunds &amp; Re-treatment REFUND POLICY Refunds will be available when there is a wrong payment or swiping of card into Clove account. Refunds are also available when there is a change in patient’s general medical condition like Cardiac, Pulmonary or Endocrinal etc, rendering the patient unsuitable for said treatment. Dental treatment outcome (much &hellip; <a href=\"https:\/\/clovedental.in\/refund-policy\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Refund &#038; Re-treatment Policy<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":272,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/3287"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=3287"}],"version-history":[{"count":39,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/3287\/revisions"}],"predecessor-version":[{"id":13134,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/3287\/revisions\/13134"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/272"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=3287"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}