{"id":6555,"date":"2018-08-01T17:10:23","date_gmt":"2018-08-01T11:40:23","guid":{"rendered":"https:\/\/clovedental.in\/?page_id=6555"},"modified":"2019-02-28T18:50:36","modified_gmt":"2019-02-28T13:20:36","slug":"coupon-policy","status":"publish","type":"page","link":"https:\/\/clovedental.in\/coupon-policy\/","title":{"rendered":"Coupon Policy"},"content":{"rendered":"<div class=\"box\">\n<div class=\"refund\">\n<h4 style=\"text-align: center; line-height: 24px;\">CLOVE DENTAL, a Brand Name of M\/s. Star Dental Centre Private Limited<\/h4>\n<p style=\"text-align: center;\">TERMS OF PROPER COUPON REDEMPTION<\/p>\n<p>The Terms of Proper Coupon Redemption explains the terms &amp; conditions under which Clove Dental will reimburse patients for coupon submissions. Your redemption of coupons signifies compliance with Clove Dental requirements. Please call our Coupon Redemption Customer Service Department at 011-33553232 \/ 9393553232 if you have any questions or need further clarification.<\/p>\n<p>1. Coupons are redeemable only by a patient taking treatment as indicated on the coupon. Multiple Clove Dental coupons, including using a paper and digital coupon together, may not be applied against the relevant treatment. There is a limit to use of coupons as per prevalent offer.<\/p>\n<p>2. Coupons submitted for availment become the property of Clove Dental.<\/p>\n<p>3. Clove Dental reserves the right to withdraw and\/or refuse availment of current coupon offers (paper or digital) due to fraud or errors including but not limited to counterfeiting, unauthorized distribution, significant data errors or system security breaches.<\/p>\n<p>4. Paper or digital coupons may not be reproduced, copied, trimmed, or altered in any way by the patient.<\/p>\n<p>5. Coupons must be presented at the time of treatment. Coupons presented after the treatment has been completed should not be honored.<\/p>\n<p>6. The terms &amp; conditions of a coupon offer are clearly indicated on the face of the coupon and set forth the offer and the intent of the Clove Dental. Any technical issues, conflicts, limitations, or scanning problems in the bar code do not alter the intent of the coupon.<\/p>\n<p>7. Coupons are non-assignable and are void if transferred from their original recipient to any other person, firm or group. Clove Dental does not permit the unauthorized distribution, collection, sale, auction, trade or assignment of its coupons for any reason.<\/p>\n<p>8. Coupons must not be accepted from the patient after the stated expiration date.<\/p>\n<p>9. CLOVE DENTAL will deny redemption for any coupons which exhibit signs of misredemption. Examples include, but are not limited to: gang cuts, similar cuts or tears, evidence of tape, mint condition, sequential number patterns, excessive or larger than normal quantities of coupons in single or multiple transactions, accuracy or quality issues in data files, excessive or unusual patterns of redemption.<\/p>\n<p>10. Clove Dental will, in its sole discretion, consider redeeming the patient coupons misredeemed by third parties, where the patient provides full cooperation to Clove Dental in identifying and resolving the causes of such misredemption and, as appropriate, enabling criminal prosecution and\/or civil litigation against such third parties.<\/p>\n<p>11. Coupons not issued or authorized by Clove Dental (i.e. counterfeit or fake coupons) will not be redeemed and will not be returned to the submitter. Non-Clove Dental coupons (i.e. coupons issued by other service provider) submitted to Clove Dental will be returned to the submitter.<\/p>\n<p>12. Disclosure of redemption data to a third party is prohibited.<\/p>\n<p>13. Clove Dental will reimburse paper coupon submissions for the face value of the coupons (or, if a free coupon, the selling price of the service), plus a handling fee, within 30 days from the date of receipt of invoice and coupons by such third party patients. Any inquires for payment discrepancies should be made in writing within 120 days of the invoice date. CLOVE DENTAL will reimburse digital coupon submissions for the face value of coupons (or, if a free coupon, the selling price of the service), plus any applicable handling fees within 15 days from the date of receipt of the invoice data file.<\/p>\n<p>14. CLOVE DENTAL may establish different handling fees for different types of coupons as used by various third party providers.<\/p>\n<p>15. Coupons are redeemable only in India.<\/p>\n<p>16. Any lawsuit involving redemption disputes shall be brought within 1 month of the original date of notification or such claims shall be extinguished. Any such lawsuit shall be venued in a state of Delhi. Each party is responsible for its own legal fees and costs.<\/p>\n<p>17. Coupons are void where prohibited, taxed or otherwise restricted by law.<\/p>\n<p>18. Failure to observe these terms &amp; conditions for proper redemption may at the option of Clove Dental, void all coupons submitted for redemption and all coupons may be retained as property of CLOVE DENTAL without redemption. CLOVE DENTAL reserves the right to forward coupons which Clove Dental judges to be misredeemed to law enforcement authorities, for their review and investigative purposes.<\/p>\n<p>19. Any use not consistent with these terms shall be treated as a material breach of this Agreement. Acceptance or redemption of any coupon shall not constitute a waiver of CLOVE DENTAL’s right to seek enforcement of any portion of this agreement. CLOVE DENTAL reserves all of its rights and remedies in connection with any dispute over coupons submitted for redemption or these terms &amp; conditions, up to and including cessation of business relationship.<\/p>\n<p>20. For Enquiry: Clove Dental, RK Khanna Tennis Stadium, 1, Africa Avenue, New Delhi-110029.<\/p>\n<p>Any questions or comments about Clove Dental Coupon Requirements should be addressed to the address above. If you are aware of any potential coupon fraud, please contact Clove Dental Coupon Redemption Customer Service at 011-33553232 \/ 9393553232.<\/p>\n<p>March 20, 2017<\/p>\n<\/div>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>CLOVE DENTAL, a Brand Name of M\/s. Star Dental Centre Private Limited TERMS OF PROPER COUPON REDEMPTION The Terms of Proper Coupon Redemption explains the terms &amp; conditions under which Clove Dental will reimburse patients for coupon submissions. Your redemption of coupons signifies compliance with Clove Dental requirements. Please call our Coupon Redemption Customer Service &hellip; <a href=\"https:\/\/clovedental.in\/coupon-policy\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Coupon Policy<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":272,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/6555"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=6555"}],"version-history":[{"count":2,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/6555\/revisions"}],"predecessor-version":[{"id":7700,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/6555\/revisions\/7700"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/272"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=6555"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}