{"id":82,"date":"2016-12-05T09:42:47","date_gmt":"2016-12-05T09:42:47","guid":{"rendered":"http:\/\/192.168.1.98\/clove_new\/?page_id=82"},"modified":"2021-07-21T09:42:44","modified_gmt":"2021-07-21T04:12:44","slug":"your-teeth","status":"publish","type":"page","link":"https:\/\/clovedental.in\/blog\/","title":{"rendered":"Blogs"},"content":{"rendered":"<h2>DENTISTRY IS AN ART – VERY INTRICATE!<\/h2>\n<p>Dentistry is an art, performed through the heart and mind. You will be surprised to know but it actually takes 18 years for any individual to fully know or master all the branches of dentistry.<\/p>\n<p>From giving shape to your front teeth or regenerating soft tissues or covering exposed roots of the teeth or shaping artificial molar just like a natural tooth, it all requires skill coupled with science. Every millimeter counts to give you that beautiful million dollar smile. It’s a science of precision done intricately.<\/p>\n<p>Sometimes visiting a dentist and having artificial teeth or veneers does not give you that beautiful smile you have been looking for. Or many times a dental procedure does not give you the desired results, because dentistry is a fine blend of clinical skill, knowledge, aptitude and judgment where precision matters to a fraction of a millimeter, so much so that modern day dentistry requires use of microscopes, however the intense training received by a dentist involves achieving high levels of precision consistently over a period of time, factoring various variables including uncooperative patients, anatomical variations and also taking into consideration systemic diseases and co-morbidities which may influence treatment plan.<\/p>\n<p>And because dentistry is a professional branch and requires finesse, it becomes mandatory to get the treatment from someone who understands the treatment required and not from a quack or fly by night operators whose every and only treatment option is ‘tooth extraction’ or ‘complete dentures’ which will only further lead to many problems. Such so called dentists or quacks can also never understand what challenges a medically compromised patient can face or how important exposed root coverage of just a few millimeters becomes in case of sensitivity. A treatment done with skill and knowledge provides better and long lasting results.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>DENTISTRY IS AN ART – VERY INTRICATE! Dentistry is an art, performed through the heart and mind. You will be surprised to know but it actually takes 18 years for any individual to fully know or master all the branches of dentistry. From giving shape to your front teeth or regenerating soft tissues or covering &hellip; <a href=\"https:\/\/clovedental.in\/blog\/\" class=\"more-link\">Continue reading <span class=\"screen-reader-text\">Blogs<\/span> <span class=\"meta-nav\">&rarr;<\/span><\/a><\/p>\n","protected":false},"author":1,"featured_media":6172,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"blog.php","meta":[],"acf":[],"_links":{"self":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/82"}],"collection":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/comments?post=82"}],"version-history":[{"count":12,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/82\/revisions"}],"predecessor-version":[{"id":12153,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/pages\/82\/revisions\/12153"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media\/6172"}],"wp:attachment":[{"href":"https:\/\/clovedental.in\/wp-json\/wp\/v2\/media?parent=82"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}